;******************************************************************************
;* TMS470 C/C++ Codegen                                           Unix v4.9.5 *
;* Date/Time created: Wed Apr  3 11:43:22 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=2 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("_Syslink.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS470 C/C++ Codegen Unix v4.9.5 Copyright (c) 1996-2012 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/sksung/work/udx/ch2/ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("xdc_runtime_System_printf__E")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("xdc_runtime_System_printf__E")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$208)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/System.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x101)
	.dwattr $C$DW$1, DW_AT_decl_column(0x12)
$C$DW$2	.dwtag  DW_TAG_formal_parameter

;** 128	-----------------------    RingIOShm_destroy();
;** 129	-----------------------    RingIO_destroy();
;**  	-----------------------    return;
	.dwcfi	cfa_offset, 0
	.dwcfi	save_reg_to_reg, 84, 14
        PUSH      {A4, LR}
	.dwcfi	cfa_offset, 4
	.dwcfi	save_reg_to_mem, 14, -4
	.dwcfi	cfa_offset, 8
	.dwcfi	save_reg_to_mem, 3, -8
	.dwcfi	cfa_offset, 8
	.dwpsn	file "_Syslink.c",line 125,column 5,is_stmt
$C$DW$52	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$52, DW_AT_low_pc(0x00)
	.dwattr $C$DW$52, DW_AT_name("FrameQBufMgr_destroy")
	.dwattr $C$DW$52, DW_AT_TI_call
        BL        FrameQBufMgr_destroy  ; |125| 
        ; CALL OCCURS {FrameQBufMgr_destroy }  ; |125| 
	.dwpsn	file "_Syslink.c",line 126,column 5,is_stmt
$C$DW$53	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$53, DW_AT_low_pc(0x00)
	.dwattr $C$DW$53, DW_AT_name("FrameQ_destroy")
	.dwattr $C$DW$53, DW_AT_TI_call
        BL        FrameQ_destroy        ; |126| 
        ; CALL OCCURS {FrameQ_destroy }  ; |126| 
	.dwpsn	file "_Syslink.c",line 127,column 5,is_stmt
$C$DW$54	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$54, DW_AT_low_pc(0x00)
	.dwattr $C$DW$54, DW_AT_name("ClientNotifyMgr_destroy")
	.dwattr $C$DW$54, DW_AT_TI_call
        BL        ClientNotifyMgr_destroy ; |127| 
        ; CALL OCCURS {ClientNotifyMgr_destroy }  ; |127| 
	.dwpsn	file "_Syslink.c",line 128,column 5,is_stmt
$C$DW$55	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$55, DW_AT_low_pc(0x00)
	.dwattr $C$DW$55, DW_AT_name("RingIOShm_destroy")
	.dwattr $C$DW$55, DW_AT_TI_call
        BL        RingIOShm_destroy     ; |128| 
        ; CALL OCCURS {RingIOShm_destroy }  ; |128| 
	.dwpsn	file "_Syslink.c",line 129,column 5,is_stmt
$C$DW$56	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$56, DW_AT_low_pc(0x00)
	.dwattr $C$DW$56, DW_AT_name("RingIO_destroy")
	.dwattr $C$DW$56, DW_AT_TI_call
        BL        RingIO_destroy        ; |129| 
        ; CALL OCCURS {RingIO_destroy }  ; |129| 
	.dwpsn	file "_Syslink.c",line 134,column 1,is_stmt
	.dwcfi	cfa_offset, 8
$C$DW$57	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$57, DW_AT_low_pc(0x00)
	.dwattr $C$DW$57, DW_AT_TI_return
        POP       {A4, PC}
        ; BRANCH OCCURS {[SP, #0]}      
	.dwattr $C$DW$51, DW_AT_TI_end_file("_Syslink.c")
	.dwattr $C$DW$51, DW_AT_TI_end_line(0x86)
	.dwattr $C$DW$51, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$51

;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text:SysLink_setup"
	.align	4
||$C$SL1||:	.string	"ERROR: RingIO_setup Failed",10,0
	.align	4
||$C$SL2||:	.string	"ERROR: RingIOShm_getConfig Failed",10,0
	.align	4
||$C$SL3||:	.string	"ERROR: FrameQ_setup Failed",10,0
	.align	4
||$C$SL4||:	.string	"ERROR: FrameQBufMgr_setup Failed",10,0
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	xdc_runtime_System_printf__E
	.global	RingIO_getConfig
	.global	RingIO_setup
	.global	RingIO_destroy
	.global	RingIOShm_getConfig
	.global	RingIOShm_setup
	.global	RingIOShm_destroy
	.global	FrameQ_getConfig
	.global	FrameQ_setup
	.global	FrameQ_destroy
	.global	FrameQBufMgr_setup
	.global	FrameQBufMgr_destroy
	.global	FrameQBufMgr_getConfig
	.global	ClientNotifyMgr_getConfig
	.global	ClientNotifyMgr_setup
	.global	ClientNotifyMgr_destroy

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(2)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$341	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$341, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$341, DW_AT_byte_size(0x01)
$C$DW$58	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$58, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$58, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$58, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$341

	.dwattr $C$DW$T$341, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$341, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$341, DW_AT_decl_column(0x0e)
$C$DW$T$342	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$342, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x03)

$C$DW$T$92	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$92, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$92, DW_AT_byte_size(0x10)
$C$DW$59	.dwtag  DW_TAG_member
	.dwattr $C$DW$59, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$59, DW_AT_name("gate")
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$59, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$59, DW_AT_decl_line(0x87)
	.dwattr $C$DW$59, DW_AT_decl_column(0x1b)
$C$DW$60	.dwtag  DW_TAG_member
	.dwattr $C$DW$60, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$60, DW_AT_name("numProcessors")
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$60, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$60, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$60, DW_AT_decl_column(0x0f)
$C$DW$61	.dwtag  DW_TAG_member
	.dwattr $C$DW$61, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$61, DW_AT_name("procIds")
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$61, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$61, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$61, DW_AT_decl_column(0x0f)
$C$DW$62	.dwtag  DW_TAG_member
	.dwattr $C$DW$62, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$62, DW_AT_name("drvHandles")
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$62, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$62, DW_AT_decl_line(0x93)
	.dwattr $C$DW$62, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$92

	.dwattr $C$DW$T$92, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$92, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$92, DW_AT_decl_column(0x10)
$C$DW$T$343	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$343, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$343, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$343, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$343, DW_AT_decl_column(0x03)
$C$DW$T$344	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$T$344, DW_AT_address_class(0x20)

$C$DW$T$346	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$346, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$346, DW_AT_byte_size(0x01)
$C$DW$63	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$63, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$63, DW_AT_decl_line(0x61)
	.dwattr $C$DW$63, DW_AT_decl_column(0x05)
$C$DW$64	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$64, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$64, DW_AT_decl_line(0x63)
	.dwattr $C$DW$64, DW_AT_decl_column(0x05)
$C$DW$65	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$65, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$65, DW_AT_decl_line(0x65)
	.dwattr $C$DW$65, DW_AT_decl_column(0x05)
$C$DW$66	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$66, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$66, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$66, DW_AT_decl_column(0x05)
$C$DW$67	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$67, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$67, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$67, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$346

	.dwattr $C$DW$T$346, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$346, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$346, DW_AT_decl_column(0x0e)
$C$DW$T$347	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$T$347, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$347, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$347, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$347, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$348	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$348, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$348, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$348, DW_AT_decl_column(0x27)
$C$DW$T$349	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$349, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$349, DW_AT_address_class(0x20)
$C$DW$T$350	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$350, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$350, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$350, DW_AT_decl_column(0x29)

$C$DW$T$105	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$105, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$105, DW_AT_byte_size(0x2c)
$C$DW$68	.dwtag  DW_TAG_member
	.dwattr $C$DW$68, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$68, DW_AT_name("name")
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$68, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$68, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$68, DW_AT_decl_column(0x14)
$C$DW$69	.dwtag  DW_TAG_member
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$69, DW_AT_name("eventNo")
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$69, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$69, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$69, DW_AT_decl_column(0x14)
$C$DW$70	.dwtag  DW_TAG_member
	.dwattr $C$DW$70, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$70, DW_AT_name("openFlag")
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$70, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$70, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$70, DW_AT_decl_column(0x14)
$C$DW$71	.dwtag  DW_TAG_member
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$71, DW_AT_name("creatorProcId")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$71, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$71, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$71, DW_AT_decl_column(0x14)
$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$72, DW_AT_name("sharedAddr")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$72, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$72, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$72, DW_AT_decl_column(0x14)
$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$73, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$73, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$73, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$73, DW_AT_decl_column(0x14)
$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$74, DW_AT_name("gate")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$74, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$74, DW_AT_decl_line(0xac)
	.dwattr $C$DW$74, DW_AT_decl_column(0x14)
$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$75, DW_AT_name("cacheFlags")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$75, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$75, DW_AT_decl_line(0xae)
	.dwattr $C$DW$75, DW_AT_decl_column(0x14)
$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$76, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$76, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$76, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$76, DW_AT_decl_column(0x14)
$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$77, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$77, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$77, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$77, DW_AT_decl_column(0x14)
$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$78, DW_AT_name("regionId")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$78, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$78, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$78, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$105

	.dwattr $C$DW$T$105, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$105, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$105, DW_AT_decl_column(0x10)
$C$DW$T$351	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$T$351, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$351, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$351, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$351, DW_AT_decl_column(0x03)

$C$DW$T$109	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$109, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$109, DW_AT_byte_size(0x1c)
$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$79, DW_AT_name("clientHandle")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$79, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$79, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$79, DW_AT_decl_column(0x12)
$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$80, DW_AT_name("procId")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$80, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$80, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$80, DW_AT_decl_column(0x12)
$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$81, DW_AT_name("notifyType")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$81, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$81, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$81, DW_AT_decl_column(0x12)
$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$82, DW_AT_name("fxnPtr")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$82, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$82, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$82, DW_AT_decl_column(0x1d)
$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$83, DW_AT_name("cbContext")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$83, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$83, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$83, DW_AT_decl_column(0x12)
$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$84, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$84, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$84, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$84, DW_AT_decl_column(0x12)
$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$85, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$85, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$85, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$85, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$109

	.dwattr $C$DW$T$109, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x10)
$C$DW$T$352	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$352, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$352, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$352, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$352, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$352, DW_AT_decl_column(0x03)

$C$DW$T$353	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$353, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$353, DW_AT_byte_size(0x01)
$C$DW$86	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$86, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$86, DW_AT_decl_line(0x162)
	.dwattr $C$DW$86, DW_AT_decl_column(0x05)
$C$DW$87	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$87, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$87, DW_AT_decl_line(0x166)
	.dwattr $C$DW$87, DW_AT_decl_column(0x05)
$C$DW$88	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$88, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$88, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$88, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$353

	.dwattr $C$DW$T$353, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$353, DW_AT_decl_line(0x161)
	.dwattr $C$DW$T$353, DW_AT_decl_column(0x0e)
$C$DW$T$354	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$T$354, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$354, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x02)

$C$DW$T$355	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$355, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$355, DW_AT_byte_size(0x01)
$C$DW$89	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$89, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$89, DW_AT_decl_line(0x156)
	.dwattr $C$DW$89, DW_AT_decl_column(0x05)
$C$DW$90	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$90, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$90, DW_AT_decl_line(0x158)
	.dwattr $C$DW$90, DW_AT_decl_column(0x05)
$C$DW$91	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$91, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$91, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$91, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$355

	.dwattr $C$DW$T$355, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$355, DW_AT_decl_line(0x155)
	.dwattr $C$DW$T$355, DW_AT_decl_column(0x0e)
$C$DW$T$356	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$356, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$356, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$T$356, DW_AT_decl_column(0x02)

$C$DW$T$110	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$110, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$110, DW_AT_byte_size(0x0c)
$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$92, DW_AT_name("name")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$92, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$92, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$92, DW_AT_decl_column(0x11)
$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$93, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$93, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$93, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$93, DW_AT_decl_column(0x11)
$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$94, DW_AT_name("sharedAddr")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$94, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$94, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$94, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$110

	.dwattr $C$DW$T$110, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$110, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$T$110, DW_AT_decl_column(0x10)
$C$DW$T$357	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$357, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$357, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$357, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$T$357, DW_AT_decl_column(0x03)

$C$DW$T$111	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$111, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$111, DW_AT_byte_size(0x0c)
$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$95, DW_AT_name("eventNo")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$95, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$95, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$95, DW_AT_decl_column(0x0c)
$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$96, DW_AT_name("maxInstances")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$96, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$96, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$96, DW_AT_decl_column(0x0c)
$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$97, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$97, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$97, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$97, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$111

	.dwattr $C$DW$T$111, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$111, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$111, DW_AT_decl_column(0x10)
$C$DW$T$358	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$358, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$358, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$T$358, DW_AT_decl_column(0x03)
$C$DW$T$359	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$359, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$T$359, DW_AT_address_class(0x20)

$C$DW$T$361	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$361, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$361, DW_AT_byte_size(0x04)
$C$DW$98	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$98, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$98, DW_AT_decl_line(0x130)
	.dwattr $C$DW$98, DW_AT_decl_column(0x09)
$C$DW$99	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$99, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$99, DW_AT_decl_line(0x134)
	.dwattr $C$DW$99, DW_AT_decl_column(0x09)
$C$DW$100	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$100, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$100, DW_AT_decl_line(0x138)
	.dwattr $C$DW$100, DW_AT_decl_column(0x09)
$C$DW$101	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$101, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$101, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$101, DW_AT_decl_column(0x09)
$C$DW$102	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$102, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$102, DW_AT_decl_line(0x140)
	.dwattr $C$DW$102, DW_AT_decl_column(0x09)
$C$DW$103	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$103, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$103, DW_AT_decl_line(0x144)
	.dwattr $C$DW$103, DW_AT_decl_column(0x09)
$C$DW$104	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$104, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$104, DW_AT_decl_line(0x148)
	.dwattr $C$DW$104, DW_AT_decl_column(0x09)
$C$DW$105	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$105, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$105, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$105, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$361

	.dwattr $C$DW$T$361, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$361, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$T$361, DW_AT_decl_column(0x0e)
$C$DW$T$362	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$361)
	.dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$362, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$362, DW_AT_decl_line(0x150)
	.dwattr $C$DW$T$362, DW_AT_decl_column(0x03)

$C$DW$T$114	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$114, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x10)
$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$106, DW_AT_name("size")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$106, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$106, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$106, DW_AT_decl_column(0x0c)
$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$107, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$107, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$107, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$107, DW_AT_decl_column(0x1c)
$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$108, DW_AT_name("name")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$108, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$108, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$108, DW_AT_decl_column(0x0c)
$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$109, DW_AT_name("openFlag")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$109, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$109, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$109, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$114

	.dwattr $C$DW$T$114, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$114, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$114, DW_AT_decl_column(0x10)
$C$DW$T$124	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$124, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$124, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$124, DW_AT_decl_column(0x03)

$C$DW$T$115	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$115, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$115, DW_AT_byte_size(0x14)
$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$110, DW_AT_name("size")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$110, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$110, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$110, DW_AT_decl_column(0x0c)
$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$111, DW_AT_name("pixelFormat")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$111, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$111, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$111, DW_AT_decl_column(0x0c)
$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$112, DW_AT_name("height")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$112, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$112, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$112, DW_AT_decl_column(0x0c)
$C$DW$113	.dwtag  DW_TAG_member
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$113, DW_AT_name("width")
	.dwattr $C$DW$113, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$113, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$113, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$113, DW_AT_decl_column(0x0c)
$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$114, DW_AT_name("align")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$114, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$114, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$115

	.dwattr $C$DW$T$115, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$115, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$T$115, DW_AT_decl_column(0x10)
$C$DW$T$363	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$363, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$T$363, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$363, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$363, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$T$363, DW_AT_decl_column(0x02)

$C$DW$T$364	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$364, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$364, DW_AT_byte_size(0x01)
$C$DW$115	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$115, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$115, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$115, DW_AT_decl_column(0x05)
$C$DW$116	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$116, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$116, DW_AT_decl_line(0x190)
	.dwattr $C$DW$116, DW_AT_decl_column(0x05)
$C$DW$117	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$117, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$117, DW_AT_decl_line(0x193)
	.dwattr $C$DW$117, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$364

	.dwattr $C$DW$T$364, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$364, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$364, DW_AT_decl_column(0x0e)
$C$DW$T$365	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$T$365, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$365, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$365, DW_AT_decl_line(0x194)
	.dwattr $C$DW$T$365, DW_AT_decl_column(0x03)

$C$DW$T$366	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$366, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$366, DW_AT_byte_size(0x01)
$C$DW$118	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$118, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$118, DW_AT_decl_line(0x180)
	.dwattr $C$DW$118, DW_AT_decl_column(0x05)
$C$DW$119	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$119, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$119, DW_AT_decl_line(0x184)
	.dwattr $C$DW$119, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$366

	.dwattr $C$DW$T$366, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$366, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$366, DW_AT_decl_column(0x0e)
$C$DW$T$367	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$366)
	.dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$367, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$367, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$367, DW_AT_decl_column(0x03)

$C$DW$T$112	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$112, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$112, DW_AT_byte_size(0x01)
$C$DW$120	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$120, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0x174)
	.dwattr $C$DW$120, DW_AT_decl_column(0x05)
$C$DW$121	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$121, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0x178)
	.dwattr $C$DW$121, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$112

	.dwattr $C$DW$T$112, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$112, DW_AT_decl_line(0x173)
	.dwattr $C$DW$T$112, DW_AT_decl_column(0x0e)
$C$DW$T$113	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$113, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$113, DW_AT_decl_line(0x179)
	.dwattr $C$DW$T$113, DW_AT_decl_column(0x03)

$C$DW$T$123	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$123, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$123, DW_AT_byte_size(0x14)
$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$122, DW_AT_name("notifyType")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$122, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$122, DW_AT_decl_column(0x1d)
$C$DW$123	.dwtag  DW_TAG_member
	.dwattr $C$DW$123, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$123, DW_AT_name("watermark")
	.dwattr $C$DW$123, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$123, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$123, DW_AT_decl_column(0x1d)
$C$DW$124	.dwtag  DW_TAG_member
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$124, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$124, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$124, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$124, DW_AT_decl_column(0x1d)
$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$125, DW_AT_name("cbContext")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$125, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$125, DW_AT_decl_column(0x1d)
$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$126, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$126, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0x201)
	.dwattr $C$DW$126, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$123

	.dwattr $C$DW$T$123, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$123, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$T$123, DW_AT_decl_column(0x10)
$C$DW$T$368	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$368, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$368, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$368, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$368, DW_AT_decl_line(0x204)
	.dwattr $C$DW$T$368, DW_AT_decl_column(0x03)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("FrameQBufMgr_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$118	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$118, DW_AT_address_class(0x20)
$C$DW$T$119	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Handle")
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$119, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$119, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$T$119, DW_AT_decl_column(0x25)

$C$DW$T$125	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$125, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$125, DW_AT_byte_size(0x18)
$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$127, DW_AT_name("commonCreateParams")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("commonCreateParams")
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$127, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$127, DW_AT_decl_column(0x21)
$C$DW$128	.dwtag  DW_TAG_member
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$128, DW_AT_name("impParams")
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("impParams")
	.dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$128, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$128, DW_AT_decl_column(0x09)
$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$129, DW_AT_name("impParamsSize")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("impParamsSize")
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$129, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$129, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$125

	.dwattr $C$DW$T$125, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$125, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$T$125, DW_AT_decl_column(0x10)
$C$DW$T$369	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$369, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$T$369, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$369, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$369, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$T$369, DW_AT_decl_column(0x03)

$C$DW$T$126	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$126, DW_AT_name("FrameQ_CommonOpenParams_Tag")
	.dwattr $C$DW$T$126, DW_AT_byte_size(0x10)
$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$130, DW_AT_name("name")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$130, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$130, DW_AT_decl_column(0x12)
$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$131, DW_AT_name("sharedAddr")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$131, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$131, DW_AT_decl_column(0x11)
$C$DW$132	.dwtag  DW_TAG_member
	.dwattr $C$DW$132, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$132, DW_AT_name("openMode")
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("openMode")
	.dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$132, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$132, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$132, DW_AT_decl_column(0x11)
$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$133, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$133, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$133, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$126

	.dwattr $C$DW$T$126, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$126, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$126, DW_AT_decl_column(0x10)
$C$DW$T$370	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CommonOpenParams")
	.dwattr $C$DW$T$370, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$370, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$370, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$370, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$T$370, DW_AT_decl_column(0x03)

$C$DW$T$131	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$131, DW_AT_name("FrameQ_Config_Tag")
	.dwattr $C$DW$T$131, DW_AT_byte_size(0x0c)
$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$134, DW_AT_name("eventNo")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$134, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0x196)
	.dwattr $C$DW$134, DW_AT_decl_column(0x0c)
$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$135, DW_AT_name("maxInstances")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$135, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0x199)
	.dwattr $C$DW$135, DW_AT_decl_column(0x0c)
$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$136, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$136, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$136, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$131

	.dwattr $C$DW$T$131, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$131, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$131, DW_AT_decl_column(0x10)
$C$DW$T$371	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Config")
	.dwattr $C$DW$T$371, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$T$371, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$371, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$371, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$T$371, DW_AT_decl_column(0x03)
$C$DW$T$372	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$372, DW_AT_type(*$C$DW$T$371)
	.dwattr $C$DW$T$372, DW_AT_address_class(0x20)

$C$DW$T$374	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$374, DW_AT_name("FrameQ_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$374, DW_AT_byte_size(0x04)
$C$DW$137	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$137, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0x165)
	.dwattr $C$DW$137, DW_AT_decl_column(0x09)
$C$DW$138	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$138, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0x169)
	.dwattr $C$DW$138, DW_AT_decl_column(0x09)
$C$DW$139	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$139, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$139, DW_AT_decl_column(0x09)
$C$DW$140	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$140, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x171)
	.dwattr $C$DW$140, DW_AT_decl_column(0x09)
$C$DW$141	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$141, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x175)
	.dwattr $C$DW$141, DW_AT_decl_column(0x09)
$C$DW$142	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$142, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x179)
	.dwattr $C$DW$142, DW_AT_decl_column(0x09)
$C$DW$143	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$143, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$143, DW_AT_decl_column(0x09)
$C$DW$144	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$144, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0x181)
	.dwattr $C$DW$144, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$374

	.dwattr $C$DW$T$374, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$374, DW_AT_decl_line(0x164)
	.dwattr $C$DW$T$374, DW_AT_decl_column(0x0e)
$C$DW$T$375	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CpuAccessFlags")
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$375, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$375, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$375, DW_AT_decl_column(0x03)

$C$DW$T$134	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$134, DW_AT_name("FrameQ_CreateParams_Tag")
	.dwattr $C$DW$T$134, DW_AT_byte_size(0x10)
$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$145, DW_AT_name("size")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$145, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$145, DW_AT_decl_column(0x1d)
$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$146, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$146, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$146, DW_AT_decl_column(0x1d)
$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$147, DW_AT_name("name")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$147, DW_AT_decl_column(0x1d)
$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$148, DW_AT_name("openFlag")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$148, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$134

	.dwattr $C$DW$T$134, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x10)
$C$DW$T$144	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CreateParams")
	.dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$144, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x03)

$C$DW$T$132	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$132, DW_AT_name("FrameQ_Interface_Tag")
	.dwattr $C$DW$T$132, DW_AT_byte_size(0x01)
$C$DW$149	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$149, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$149, DW_AT_decl_column(0x05)
$C$DW$150	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$150, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$150, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$132

	.dwattr $C$DW$T$132, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$132, DW_AT_decl_line(0x18a)
	.dwattr $C$DW$T$132, DW_AT_decl_column(0x0e)
$C$DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Interface")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$133, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$133, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$133, DW_AT_decl_column(0x03)

$C$DW$T$143	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$143, DW_AT_name("FrameQ_NotifyParams_Tag")
	.dwattr $C$DW$T$143, DW_AT_byte_size(0x14)
$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$151, DW_AT_name("notifyType")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$151, DW_AT_decl_column(0x1c)
$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$152, DW_AT_name("watermark")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$152, DW_AT_decl_column(0x1d)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$153, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$153, DW_AT_decl_column(0x1d)
$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$154, DW_AT_name("cbContext")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$154, DW_AT_decl_column(0x1d)
$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$155, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$155, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$143

	.dwattr $C$DW$T$143, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$143, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$T$143, DW_AT_decl_column(0x10)
$C$DW$T$376	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_NotifyParams")
	.dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$376, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$376, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$T$376, DW_AT_decl_column(0x03)

$C$DW$T$135	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$135, DW_AT_name("FrameQ_NotifyType_Tag")
	.dwattr $C$DW$T$135, DW_AT_byte_size(0x01)
$C$DW$156	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$156, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$156, DW_AT_decl_column(0x05)
$C$DW$157	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$157, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x141)
	.dwattr $C$DW$157, DW_AT_decl_column(0x05)
$C$DW$158	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$158, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x143)
	.dwattr $C$DW$158, DW_AT_decl_column(0x05)
$C$DW$159	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$159, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x148)
	.dwattr $C$DW$159, DW_AT_decl_column(0x05)
$C$DW$160	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$160, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$160, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$135

	.dwattr $C$DW$T$135, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$135, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$T$135, DW_AT_decl_column(0x0e)
$C$DW$T$136	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_NotifyType")
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$136, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$136, DW_AT_decl_line(0x152)
	.dwattr $C$DW$T$136, DW_AT_decl_column(0x03)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("FrameQ_Object")
	.dwattr $C$DW$T$21, DW_AT_declaration
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x134)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$137	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$137, DW_AT_address_class(0x20)
$C$DW$T$138	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Handle")
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$138, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$138, DW_AT_decl_line(0x134)
	.dwattr $C$DW$T$138, DW_AT_decl_column(0x20)

$C$DW$T$377	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$377, DW_AT_name("FrameQ_OpenMode_Tag")
	.dwattr $C$DW$T$377, DW_AT_byte_size(0x01)
$C$DW$161	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$161, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x158)
	.dwattr $C$DW$161, DW_AT_decl_column(0x05)
$C$DW$162	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_WRITER"), DW_AT_const_value(0x01)
	.dwattr $C$DW$162, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$162, DW_AT_decl_column(0x05)
$C$DW$163	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_READER"), DW_AT_const_value(0x02)
	.dwattr $C$DW$163, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$163, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$377

	.dwattr $C$DW$T$377, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$377, DW_AT_decl_line(0x157)
	.dwattr $C$DW$T$377, DW_AT_decl_column(0x0e)
$C$DW$T$378	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_OpenMode")
	.dwattr $C$DW$T$378, DW_AT_type(*$C$DW$T$377)
	.dwattr $C$DW$T$378, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$378, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$378, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$T$378, DW_AT_decl_column(0x03)

$C$DW$T$145	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$145, DW_AT_name("FrameQ_Params")
	.dwattr $C$DW$T$145, DW_AT_byte_size(0x18)
$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$164, DW_AT_name("commonCreateParams")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("commonCreateParams")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$164, DW_AT_decl_column(0x1b)
$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$165, DW_AT_name("impParams")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("impParams")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$165, DW_AT_decl_column(0x09)
$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$166, DW_AT_name("impParamsSize")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("impParamsSize")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$166, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$145

	.dwattr $C$DW$T$145, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x10)
$C$DW$T$379	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Params")
	.dwattr $C$DW$T$379, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$T$379, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$379, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$379, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$T$379, DW_AT_decl_column(0x03)

$C$DW$T$146	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$146, DW_AT_name("Frame_FrameBufInfo_tag")
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x20)
$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$167, DW_AT_name("bufPtr")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("bufPtr")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x55)
	.dwattr $C$DW$167, DW_AT_decl_column(0x0c)
$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$168, DW_AT_name("bufSize")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("bufSize")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x57)
	.dwattr $C$DW$168, DW_AT_decl_column(0x0c)
$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$169, DW_AT_name("startOffset")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("startOffset")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x59)
	.dwattr $C$DW$169, DW_AT_decl_column(0x0c)
$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$170, DW_AT_name("validSize")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("validSize")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$170, DW_AT_decl_column(0x0c)
$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$171, DW_AT_name("pixelFormat")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$171, DW_AT_decl_column(0x0c)
$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$172, DW_AT_name("height")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$172, DW_AT_decl_column(0x0c)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$173, DW_AT_name("width")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$173, DW_AT_decl_column(0x0c)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$174, DW_AT_name("stride")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("stride")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x60)
	.dwattr $C$DW$174, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$146

	.dwattr $C$DW$T$146, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x54)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x10)
$C$DW$T$147	.dwtag  DW_TAG_typedef, DW_AT_name("Frame_FrameBufInfo")
	.dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$147, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x62)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x02)

$C$DW$T$148	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$148, DW_AT_byte_size(0x20)
$C$DW$175	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$175, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$148


$C$DW$T$149	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$149, DW_AT_name("Frame_FrameHeader_Tag")
	.dwattr $C$DW$T$149, DW_AT_byte_size(0x38)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$176, DW_AT_name("reserved0")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("reserved0")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$176, DW_AT_decl_column(0x0d)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$177, DW_AT_name("reserved1")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("reserved1")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$177, DW_AT_decl_column(0x0d)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$178, DW_AT_name("baseHeaderSize")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("baseHeaderSize")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$178, DW_AT_decl_column(0x0d)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$179, DW_AT_name("headerSize")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("headerSize")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x70)
	.dwattr $C$DW$179, DW_AT_decl_column(0x0d)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$180, DW_AT_name("frmAllocaterId")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("frmAllocaterId")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x74)
	.dwattr $C$DW$180, DW_AT_decl_column(0x0d)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$181, DW_AT_name("frameBufType")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("frameBufType")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x76)
	.dwattr $C$DW$181, DW_AT_decl_column(0x0c)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$182, DW_AT_name("freeFrmQueueNo")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("freeFrmQueueNo")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x78)
	.dwattr $C$DW$182, DW_AT_decl_column(0x0d)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$183, DW_AT_name("numFrameBuffers")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("numFrameBuffers")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$183, DW_AT_decl_column(0x0d)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$148)
	.dwattr $C$DW$184, DW_AT_name("frameBufInfo")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("frameBufInfo")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$184, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$149

	.dwattr $C$DW$T$149, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$T$149, DW_AT_decl_line(0x69)
	.dwattr $C$DW$T$149, DW_AT_decl_column(0x11)
$C$DW$T$380	.dwtag  DW_TAG_typedef, DW_AT_name("Frame_FrameHeader")
	.dwattr $C$DW$T$380, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$T$380, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$380, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$T$380, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$380, DW_AT_decl_column(0x03)
$C$DW$T$381	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$381, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$T$381, DW_AT_address_class(0x20)
$C$DW$T$382	.dwtag  DW_TAG_typedef, DW_AT_name("Frame")
	.dwattr $C$DW$T$382, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$T$382, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$382, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQDefs.h")
	.dwattr $C$DW$T$382, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$382, DW_AT_decl_column(0x1d)
$C$DW$T$383	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Frame")
	.dwattr $C$DW$T$383, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$T$383, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$383, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$383, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$383, DW_AT_decl_column(0x29)
$C$DW$T$384	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Frame")
	.dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$T$384, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$384, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$384, DW_AT_decl_line(0x109)
	.dwattr $C$DW$T$384, DW_AT_decl_column(0x23)

$C$DW$T$150	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$150, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$150, DW_AT_byte_size(0x01)
$C$DW$185	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$185, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$185, DW_AT_decl_column(0x05)
$C$DW$186	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_INTERRUPT"), DW_AT_const_value(0x01)
	.dwattr $C$DW$186, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$186, DW_AT_decl_column(0x05)
$C$DW$187	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_TASKLET"), DW_AT_const_value(0x02)
	.dwattr $C$DW$187, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0xce)
	.dwattr $C$DW$187, DW_AT_decl_column(0x05)
$C$DW$188	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_THREAD"), DW_AT_const_value(0x03)
	.dwattr $C$DW$188, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$188, DW_AT_decl_column(0x05)
$C$DW$189	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_PROCESS"), DW_AT_const_value(0x04)
	.dwattr $C$DW$189, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$189, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$150

	.dwattr $C$DW$T$150, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$150, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$150, DW_AT_decl_column(0x0e)
$C$DW$T$151	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
	.dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$151, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x03)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("GateMP_Object")
	.dwattr $C$DW$T$22, DW_AT_declaration
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
$C$DW$T$99	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$99, DW_AT_address_class(0x20)
$C$DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Handle")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$100, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x1f)

$C$DW$T$154	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$154, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$154, DW_AT_byte_size(0x10)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$190, DW_AT_name("name")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x101)
	.dwattr $C$DW$190, DW_AT_decl_column(0x0c)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$191, DW_AT_name("regionId")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$191, DW_AT_decl_column(0x0c)
$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$192, DW_AT_name("sharedAddr")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x117)
	.dwattr $C$DW$192, DW_AT_decl_column(0x09)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$193, DW_AT_name("localProtect")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0x125)
	.dwattr $C$DW$193, DW_AT_decl_column(0x19)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$194, DW_AT_name("remoteProtect")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$194, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$154

	.dwattr $C$DW$T$154, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x10)
$C$DW$T$385	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$154)
	.dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$385, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$385, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$385, DW_AT_decl_column(0x03)

$C$DW$T$152	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$152, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$152, DW_AT_byte_size(0x01)
$C$DW$195	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$195, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$195, DW_AT_decl_column(0x05)
$C$DW$196	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_SYSTEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$196, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0xed)
	.dwattr $C$DW$196, DW_AT_decl_column(0x05)
$C$DW$197	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM1"), DW_AT_const_value(0x02)
	.dwattr $C$DW$197, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$197, DW_AT_decl_column(0x05)
$C$DW$198	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM2"), DW_AT_const_value(0x03)
	.dwattr $C$DW$198, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$198, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$152

	.dwattr $C$DW$T$152, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$152, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$152, DW_AT_decl_column(0x0e)
$C$DW$T$153	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$153, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$153, DW_AT_decl_line(0xf6)
