;******************************************************************************
;* TMS470 C/C++ Codegen                                           Unix v4.9.5 *
;* Date/Time created: Wed Apr  3 11:43:11 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=2 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../../ClientNotifyMgr.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS470 C/C++ Codegen Unix v4.9.5 Copyright (c) 1996-2012 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/sksung/work/udx/ch2/ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/cgt470_4_9_5/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$1169, DW_AT_decl_column(0x05)
$C$DW$1170	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1170, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1170, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1170, DW_AT_decl_column(0x05)
$C$DW$1171	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1171, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1171, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1171, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1207

	.dwattr $C$DW$T$1207, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1207, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1207, DW_AT_decl_column(0x0e)
$C$DW$T$1208	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1208, DW_AT_type(*$C$DW$T$1207)
	.dwattr $C$DW$T$1208, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1208, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1208, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1208, DW_AT_decl_column(0x03)

$C$DW$T$1209	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1209, DW_AT_byte_size(0x04)
$C$DW$1172	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1172, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1172, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1172, DW_AT_decl_column(0x05)
$C$DW$1173	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1173, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1173, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1173, DW_AT_decl_column(0x05)
$C$DW$1174	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$1174, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1174, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1174, DW_AT_decl_column(0x05)
$C$DW$1175	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1175, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1175, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1175, DW_AT_decl_column(0x05)
$C$DW$1176	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$1176, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1176, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1176, DW_AT_decl_column(0x05)
$C$DW$1177	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$1177, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1177, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1177, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1209

	.dwattr $C$DW$T$1209, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1209, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1209, DW_AT_decl_column(0x0e)
$C$DW$T$1210	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1210, DW_AT_type(*$C$DW$T$1209)
	.dwattr $C$DW$T$1210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1210, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1210, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1210, DW_AT_decl_column(0x03)

$C$DW$T$1211	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1211, DW_AT_byte_size(0x01)
$C$DW$1178	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1178, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1178, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1178, DW_AT_decl_column(0x05)
$C$DW$1179	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1179, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1179, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1179, DW_AT_decl_column(0x05)
$C$DW$1180	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1180, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1180, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1180, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1211

	.dwattr $C$DW$T$1211, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1211, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1211, DW_AT_decl_column(0x0e)
$C$DW$T$1212	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1212, DW_AT_type(*$C$DW$T$1211)
	.dwattr $C$DW$T$1212, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1212, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1212, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1212, DW_AT_decl_column(0x03)

$C$DW$T$288	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$288, DW_AT_byte_size(0x08)
$C$DW$1181	.dwtag  DW_TAG_member
	.dwattr $C$DW$1181, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1181, DW_AT_name("length")
	.dwattr $C$DW$1181, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1181, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1181, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1181, DW_AT_decl_column(0x16)
$C$DW$1182	.dwtag  DW_TAG_member
	.dwattr $C$DW$1182, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$1182, DW_AT_name("elem")
	.dwattr $C$DW$1182, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1182, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1182, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1182, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$288

	.dwattr $C$DW$T$288, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$288, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$288, DW_AT_decl_column(0x10)
$C$DW$T$1213	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1213, DW_AT_type(*$C$DW$T$288)
	.dwattr $C$DW$T$1213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1213, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1213, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1213, DW_AT_decl_column(0x43)
$C$DW$T$1214	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1214, DW_AT_type(*$C$DW$T$1213)
	.dwattr $C$DW$T$1214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1214, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1214, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1214, DW_AT_decl_column(0x30)
$C$DW$T$1215	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1215, DW_AT_type(*$C$DW$T$1214)
	.dwattr $C$DW$T$1215, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1215, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1215, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1215, DW_AT_decl_column(0x2c)

$C$DW$T$289	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$289, DW_AT_byte_size(0x08)
$C$DW$1183	.dwtag  DW_TAG_member
	.dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1183, DW_AT_name("length")
	.dwattr $C$DW$1183, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1183, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1183, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1183, DW_AT_decl_column(0x16)
$C$DW$1184	.dwtag  DW_TAG_member
	.dwattr $C$DW$1184, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$1184, DW_AT_name("elem")
	.dwattr $C$DW$1184, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1184, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1184, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1184, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$289

	.dwattr $C$DW$T$289, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$289, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$289, DW_AT_decl_column(0x10)
$C$DW$T$1216	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1216, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$T$1216, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1216, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1216, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1216, DW_AT_decl_column(0x43)
$C$DW$T$1217	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1217, DW_AT_type(*$C$DW$T$1216)
	.dwattr $C$DW$T$1217, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1217, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1217, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1217, DW_AT_decl_column(0x2f)
$C$DW$T$1218	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1218, DW_AT_type(*$C$DW$T$1217)
	.dwattr $C$DW$T$1218, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1218, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1218, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1218, DW_AT_decl_column(0x2b)

$C$DW$T$292	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$292, DW_AT_byte_size(0x08)
$C$DW$1185	.dwtag  DW_TAG_member
	.dwattr $C$DW$1185, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1185, DW_AT_name("length")
	.dwattr $C$DW$1185, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1185, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1185, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1185, DW_AT_decl_column(0x16)
$C$DW$1186	.dwtag  DW_TAG_member
	.dwattr $C$DW$1186, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$1186, DW_AT_name("elem")
	.dwattr $C$DW$1186, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1186, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1186, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1186, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$292

	.dwattr $C$DW$T$292, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$292, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$292, DW_AT_decl_column(0x10)
$C$DW$T$1219	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1219, DW_AT_type(*$C$DW$T$292)
	.dwattr $C$DW$T$1219, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1219, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1219, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$1219, DW_AT_decl_column(0x42)
$C$DW$T$1220	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1220, DW_AT_type(*$C$DW$T$1219)
	.dwattr $C$DW$T$1220, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1220, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1220, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$1220, DW_AT_decl_column(0x2b)
$C$DW$T$1221	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1221, DW_AT_type(*$C$DW$T$1220)
	.dwattr $C$DW$T$1221, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1221, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1221, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$1221, DW_AT_decl_column(0x27)

$C$DW$T$296	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$296, DW_AT_byte_size(0x08)
$C$DW$1187	.dwtag  DW_TAG_member
	.dwattr $C$DW$1187, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1187, DW_AT_name("length")
	.dwattr $C$DW$1187, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1187, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$1187, DW_AT_decl_line(0x24d)
	.dwattr $C$DW$1187, DW_AT_decl_column(0x16)
$C$DW$1188	.dwtag  DW_TAG_member
	.dwattr $C$DW$1188, DW_AT_type(*$C$DW$T$295)
	.dwattr $C$DW$1188, DW_AT_name("elem")
	.dwattr $C$DW$1188, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1188, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$1188, DW_AT_decl_line(0x24d)
	.dwattr $C$DW$1188, DW_AT_decl_column(0x44)
	.dwendtag $C$DW$T$296

	.dwattr $C$DW$T$296, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$296, DW_AT_decl_line(0x24d)
	.dwattr $C$DW$T$296, DW_AT_decl_column(0x10)
$C$DW$T$1222	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1222, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$T$1222, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1222, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1222, DW_AT_decl_line(0x24d)
	.dwattr $C$DW$T$1222, DW_AT_decl_column(0x4c)
$C$DW$T$1223	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1223, DW_AT_type(*$C$DW$T$1222)
	.dwattr $C$DW$T$1223, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1223, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1223, DW_AT_decl_line(0x24e)
	.dwattr $C$DW$T$1223, DW_AT_decl_column(0x35)
$C$DW$T$1224	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1224, DW_AT_type(*$C$DW$T$1223)
	.dwattr $C$DW$T$1224, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1224, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1224, DW_AT_decl_line(0x24f)
	.dwattr $C$DW$T$1224, DW_AT_decl_column(0x31)

$C$DW$T$299	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$299, DW_AT_byte_size(0x08)
$C$DW$1189	.dwtag  DW_TAG_member
	.dwattr $C$DW$1189, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1189, DW_AT_name("length")
	.dwattr $C$DW$1189, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1189, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1189, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1189, DW_AT_decl_column(0x16)
$C$DW$1190	.dwtag  DW_TAG_member
	.dwattr $C$DW$1190, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$1190, DW_AT_name("elem")
	.dwattr $C$DW$1190, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1190, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1190, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1190, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$299

	.dwattr $C$DW$T$299, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$299, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$299, DW_AT_decl_column(0x10)
$C$DW$T$1225	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1225, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$T$1225, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1225, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1225, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$1225, DW_AT_decl_column(0x43)
$C$DW$T$1226	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1226, DW_AT_type(*$C$DW$T$1225)
	.dwattr $C$DW$T$1226, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1226, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1226, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$1226, DW_AT_decl_column(0x2c)
$C$DW$T$1227	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1227, DW_AT_type(*$C$DW$T$1226)
	.dwattr $C$DW$T$1227, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1227, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1227, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$1227, DW_AT_decl_column(0x28)

$C$DW$T$310	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$310, DW_AT_name("ClientNotifyMgr_Attrs_Tag")
	.dwattr $C$DW$T$310, DW_AT_byte_size(0x24)
$C$DW$1191	.dwtag  DW_TAG_member
	.dwattr $C$DW$1191, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1191, DW_AT_name("status")
	.dwattr $C$DW$1191, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1191, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1191, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$1191, DW_AT_decl_column(0x17)
$C$DW$1192	.dwtag  DW_TAG_member
	.dwattr $C$DW$1192, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1192, DW_AT_name("version")
	.dwattr $C$DW$1192, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1192, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1192, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$1192, DW_AT_decl_column(0x17)
$C$DW$1193	.dwtag  DW_TAG_member
	.dwattr $C$DW$1193, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1193, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1193, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1193, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x17)
$C$DW$1194	.dwtag  DW_TAG_member
	.dwattr $C$DW$1194, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1194, DW_AT_name("eventNo")
	.dwattr $C$DW$1194, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1194, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x17)
$C$DW$1195	.dwtag  DW_TAG_member
	.dwattr $C$DW$1195, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1195, DW_AT_name("maxClients")
	.dwattr $C$DW$1195, DW_AT_TI_symbol_name("maxClients")
	.dwattr $C$DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1195, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x17)
$C$DW$1196	.dwtag  DW_TAG_member
	.dwattr $C$DW$1196, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1196, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1196, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1196, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x17)
$C$DW$1197	.dwtag  DW_TAG_member
	.dwattr $C$DW$1197, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1197, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1197, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1197, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x17)
$C$DW$1198	.dwtag  DW_TAG_member
	.dwattr $C$DW$1198, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1198, DW_AT_name("numActClients")
	.dwattr $C$DW$1198, DW_AT_TI_symbol_name("numActClients")
	.dwattr $C$DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1198, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x17)
$C$DW$1199	.dwtag  DW_TAG_member
	.dwattr $C$DW$1199, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1199, DW_AT_name("entryId")
	.dwattr $C$DW$1199, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1199, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$310

	.dwattr $C$DW$T$310, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$310, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$310, DW_AT_decl_column(0x10)
$C$DW$T$351	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Attrs")
	.dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$T$351, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$351, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$351, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$T$351, DW_AT_decl_column(0x03)
$C$DW$T$352	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$352, DW_AT_type(*$C$DW$T$351)
$C$DW$T$353	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$T$353, DW_AT_address_class(0x20)

$C$DW$T$1229	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1229, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1229, DW_AT_byte_size(0x01)
$C$DW$1200	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1200, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1229

	.dwattr $C$DW$T$1229, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1229, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1229, DW_AT_decl_column(0x0e)
$C$DW$T$1230	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1230, DW_AT_type(*$C$DW$T$1229)
	.dwattr $C$DW$T$1230, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1230, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1230, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1230, DW_AT_decl_column(0x03)

$C$DW$T$315	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$315, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$315, DW_AT_byte_size(0x10)
$C$DW$1201	.dwtag  DW_TAG_member
	.dwattr $C$DW$1201, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1201, DW_AT_name("gate")
	.dwattr $C$DW$1201, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1201, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x1b)
$C$DW$1202	.dwtag  DW_TAG_member
	.dwattr $C$DW$1202, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1202, DW_AT_name("numProcessors")
	.dwattr $C$DW$1202, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1202, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x0f)
$C$DW$1203	.dwtag  DW_TAG_member
	.dwattr $C$DW$1203, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1203, DW_AT_name("procIds")
	.dwattr $C$DW$1203, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1203, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1203, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x0f)
$C$DW$1204	.dwtag  DW_TAG_member
	.dwattr $C$DW$1204, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1204, DW_AT_name("drvHandles")
	.dwattr $C$DW$1204, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1204, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$315

	.dwattr $C$DW$T$315, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$315, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$315, DW_AT_decl_column(0x10)
$C$DW$T$330	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$330, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$330, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$330, DW_AT_decl_column(0x03)
$C$DW$T$1231	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1231, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$T$1231, DW_AT_address_class(0x20)

$C$DW$T$339	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$339, DW_AT_name("ClientNotifyMgr_ModuleObject_Tag")
	.dwattr $C$DW$T$339, DW_AT_byte_size(0x2ea64)
$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1205, DW_AT_name("refCount")
	.dwattr $C$DW$1205, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1205, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x20)
$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1206, DW_AT_name("gate")
	.dwattr $C$DW$1206, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1206, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x21)
$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1207, DW_AT_name("numProcessors")
	.dwattr $C$DW$1207, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1207, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x21)
$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1208, DW_AT_name("nameServer")
	.dwattr $C$DW$1208, DW_AT_TI_symbol_name("nameServer")
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1208, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x21)
$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1209, DW_AT_name("nameServerType")
	.dwattr $C$DW$1209, DW_AT_TI_symbol_name("nameServerType")
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1209, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x21)
$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1210, DW_AT_name("usrGate")
	.dwattr $C$DW$1210, DW_AT_TI_symbol_name("usrGate")
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1210, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x21)
$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$321)
	.dwattr $C$DW$1211, DW_AT_name("instRefCount")
	.dwattr $C$DW$1211, DW_AT_TI_symbol_name("instRefCount")
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1211, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x21)
$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1212, DW_AT_name("isEventRegistered")
	.dwattr $C$DW$1212, DW_AT_TI_symbol_name("isEventRegistered")
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2818]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1212, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x21)
$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$1213, DW_AT_name("objList")
	.dwattr $C$DW$1213, DW_AT_TI_symbol_name("objList")
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0xf018]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1213, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x21)
$C$DW$1214	.dwtag  DW_TAG_member
	.dwattr $C$DW$1214, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1214, DW_AT_name("eventListenerList")
	.dwattr $C$DW$1214, DW_AT_TI_symbol_name("eventListenerList")
	.dwattr $C$DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0xf01c]
	.dwattr $C$DW$1214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1214, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1214, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x21)
$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1215, DW_AT_name("listLock")
	.dwattr $C$DW$1215, DW_AT_TI_symbol_name("listLock")
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1181c]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1215, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x21)
$C$DW$1216	.dwtag  DW_TAG_member
	.dwattr $C$DW$1216, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1216, DW_AT_name("cfg")
	.dwattr $C$DW$1216, DW_AT_TI_symbol_name("cfg")
	.dwattr $C$DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x11820]
	.dwattr $C$DW$1216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1216, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1216, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1216, DW_AT_decl_column(0x21)
$C$DW$1217	.dwtag  DW_TAG_member
	.dwattr $C$DW$1217, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1217, DW_AT_name("defaultCfg")
	.dwattr $C$DW$1217, DW_AT_TI_symbol_name("defaultCfg")
	.dwattr $C$DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x11830]
	.dwattr $C$DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1217, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1217, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1217, DW_AT_decl_column(0x21)
$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$1218, DW_AT_name("callBackCtxPtrs")
	.dwattr $C$DW$1218, DW_AT_TI_symbol_name("callBackCtxPtrs")
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x11840]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1218, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x09)
$C$DW$1219	.dwtag  DW_TAG_member
	.dwattr $C$DW$1219, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1219, DW_AT_name("isInstNoValid")
	.dwattr $C$DW$1219, DW_AT_TI_symbol_name("isInstNoValid")
	.dwattr $C$DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a840]
	.dwattr $C$DW$1219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1219, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1219, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x0b)
$C$DW$1220	.dwtag  DW_TAG_member
	.dwattr $C$DW$1220, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$1220, DW_AT_name("swiPostInfo")
	.dwattr $C$DW$1220, DW_AT_TI_symbol_name("swiPostInfo")
	.dwattr $C$DW$1220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2aa40]
	.dwattr $C$DW$1220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1220, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1220, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x2a)
$C$DW$1221	.dwtag  DW_TAG_member
	.dwattr $C$DW$1221, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$1221, DW_AT_name("notifyPaloadEntry")
	.dwattr $C$DW$1221, DW_AT_TI_symbol_name("notifyPaloadEntry")
	.dwattr $C$DW$1221, DW_AT_data_member_location[DW_OP_plus_uconst 0x2aa50]
	.dwattr $C$DW$1221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1221, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1221, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x2a)
$C$DW$1222	.dwtag  DW_TAG_member
	.dwattr $C$DW$1222, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$1222, DW_AT_name("taskPostInfo")
	.dwattr $C$DW$1222, DW_AT_TI_symbol_name("taskPostInfo")
	.dwattr $C$DW$1222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ca50]
	.dwattr $C$DW$1222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1222, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1222, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x2b)
$C$DW$1223	.dwtag  DW_TAG_member
	.dwattr $C$DW$1223, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$1223, DW_AT_name("cliTsknotifyPaloadEntry")
	.dwattr $C$DW$1223, DW_AT_TI_symbol_name("cliTsknotifyPaloadEntry")
	.dwattr $C$DW$1223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ca64]
	.dwattr $C$DW$1223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1223, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1223, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x2a)
	.dwendtag $C$DW$T$339

	.dwattr $C$DW$T$339, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x10)
$C$DW$T$1232	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_ModuleObject")
	.dwattr $C$DW$T$1232, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$T$1232, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1232, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$1232, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$T$1232, DW_AT_decl_column(0x03)
$C$DW$T$1233	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1233, DW_AT_type(*$C$DW$T$1232)
	.dwattr $C$DW$T$1233, DW_AT_address_class(0x20)

$C$DW$T$347	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$347, DW_AT_name("ClientNotifyMgr_NotifyParamInfo_Tag")
	.dwattr $C$DW$T$347, DW_AT_byte_size(0x9c)
$C$DW$1224	.dwtag  DW_TAG_member
	.dwattr $C$DW$1224, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1224, DW_AT_name("clientHandle")
	.dwattr $C$DW$1224, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1224, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x15)
$C$DW$1225	.dwtag  DW_TAG_member
	.dwattr $C$DW$1225, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1225, DW_AT_name("waterMarkCond1")
	.dwattr $C$DW$1225, DW_AT_TI_symbol_name("waterMarkCond1")
	.dwattr $C$DW$1225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1225, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x15)
$C$DW$1226	.dwtag  DW_TAG_member
	.dwattr $C$DW$1226, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1226, DW_AT_name("waterMarkCond2")
	.dwattr $C$DW$1226, DW_AT_TI_symbol_name("waterMarkCond2")
	.dwattr $C$DW$1226, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1226, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x15)
$C$DW$1227	.dwtag  DW_TAG_member
	.dwattr $C$DW$1227, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$1227, DW_AT_name("bitFlag_notifySubEntries")
	.dwattr $C$DW$1227, DW_AT_TI_symbol_name("bitFlag_notifySubEntries")
	.dwattr $C$DW$1227, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1227, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x15)
$C$DW$1228	.dwtag  DW_TAG_member
	.dwattr $C$DW$1228, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1228, DW_AT_name("procId")
	.dwattr $C$DW$1228, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1228, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0xba)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x15)
$C$DW$1229	.dwtag  DW_TAG_member
	.dwattr $C$DW$1229, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1229, DW_AT_name("notifyType")
	.dwattr $C$DW$1229, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1229, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1229, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x15)
$C$DW$1230	.dwtag  DW_TAG_member
	.dwattr $C$DW$1230, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1230, DW_AT_name("isValid")
	.dwattr $C$DW$1230, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$1230, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1230, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x15)
$C$DW$1231	.dwtag  DW_TAG_member
	.dwattr $C$DW$1231, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$1231, DW_AT_name("waitOnMultiNotifyFlags")
	.dwattr $C$DW$1231, DW_AT_TI_symbol_name("waitOnMultiNotifyFlags")
	.dwattr $C$DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1231, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x15)
$C$DW$1232	.dwtag  DW_TAG_member
	.dwattr $C$DW$1232, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1232, DW_AT_name("notifyFlag")
	.dwattr $C$DW$1232, DW_AT_TI_symbol_name("notifyFlag")
	.dwattr $C$DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$1232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1232, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x15)
$C$DW$1233	.dwtag  DW_TAG_member
	.dwattr $C$DW$1233, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1233, DW_AT_name("eventCount")
	.dwattr $C$DW$1233, DW_AT_TI_symbol_name("eventCount")
	.dwattr $C$DW$1233, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
	.dwattr $C$DW$1233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1233, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x15)
$C$DW$1234	.dwtag  DW_TAG_member
	.dwattr $C$DW$1234, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$1234, DW_AT_name("forceNotify")
	.dwattr $C$DW$1234, DW_AT_TI_symbol_name("forceNotify")
	.dwattr $C$DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x9b]
	.dwattr $C$DW$1234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1234, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0xce)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$347

	.dwattr $C$DW$T$347, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$347, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$T$347, DW_AT_decl_column(0x10)
$C$DW$T$354	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyParamInfo")
	.dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$T$354, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$354, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x04)
$C$DW$T$355	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$354)
$C$DW$T$356	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$T$356, DW_AT_address_class(0x20)
$C$DW$T$357	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$T$357, DW_AT_address_class(0x20)

$C$DW$T$1235	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1235, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1235, DW_AT_byte_size(0x01)
$C$DW$1235	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1235, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x05)
$C$DW$1236	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1236, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x05)
$C$DW$1237	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1237, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x05)
$C$DW$1238	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1238, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x05)
$C$DW$1239	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1239, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1235

	.dwattr $C$DW$T$1235, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1235, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1235, DW_AT_decl_column(0x0e)
$C$DW$T$1236	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1236, DW_AT_type(*$C$DW$T$1235)
	.dwattr $C$DW$T$1236, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1236, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1236, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1236, DW_AT_decl_column(0x03)

$C$DW$T$359	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$359, DW_AT_name("ClientNotifyMgr_Obj_Tag")
	.dwattr $C$DW$T$359, DW_AT_byte_size(0x60)
$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$1240, DW_AT_name("listElem")
	.dwattr $C$DW$1240, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1240, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x30)
$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1241, DW_AT_name("type")
	.dwattr $C$DW$1241, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1241, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x30)
$C$DW$1242	.dwtag  DW_TAG_member
	.dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$1242, DW_AT_name("gate")
	.dwattr $C$DW$1242, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1242, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1242, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x30)
$C$DW$1243	.dwtag  DW_TAG_member
	.dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1243, DW_AT_name("regionId")
	.dwattr $C$DW$1243, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1243, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1243, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1243, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x30)
$C$DW$1244	.dwtag  DW_TAG_member
	.dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1244, DW_AT_name("attrs")
	.dwattr $C$DW$1244, DW_AT_TI_symbol_name("attrs")
	.dwattr $C$DW$1244, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1244, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1244, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x30)
$C$DW$1245	.dwtag  DW_TAG_member
	.dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1245, DW_AT_name("notifyInfoObj")
	.dwattr $C$DW$1245, DW_AT_TI_symbol_name("notifyInfoObj")
	.dwattr $C$DW$1245, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1245, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1245, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x30)
$C$DW$1246	.dwtag  DW_TAG_member
	.dwattr $C$DW$1246, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1246, DW_AT_name("cacheEnabled")
	.dwattr $C$DW$1246, DW_AT_TI_symbol_name("cacheEnabled")
	.dwattr $C$DW$1246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1246, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1246, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x30)
$C$DW$1247	.dwtag  DW_TAG_member
	.dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1247, DW_AT_name("minAlign")
	.dwattr $C$DW$1247, DW_AT_TI_symbol_name("minAlign")
	.dwattr $C$DW$1247, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1247, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1247, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x30)
$C$DW$1248	.dwtag  DW_TAG_member
	.dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1248, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1248, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1248, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1248, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x30)
$C$DW$1249	.dwtag  DW_TAG_member
	.dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1249, DW_AT_name("top")
	.dwattr $C$DW$1249, DW_AT_TI_symbol_name("top")
	.dwattr $C$DW$1249, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1249, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1249, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x30)
$C$DW$1250	.dwtag  DW_TAG_member
	.dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$1250, DW_AT_name("params")
	.dwattr $C$DW$1250, DW_AT_TI_symbol_name("params")
	.dwattr $C$DW$1250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1250, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1250, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x30)
$C$DW$1251	.dwtag  DW_TAG_member
	.dwattr $C$DW$1251, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1251, DW_AT_name("Id")
	.dwattr $C$DW$1251, DW_AT_TI_symbol_name("Id")
	.dwattr $C$DW$1251, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$1251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1251, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1251, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1251, DW_AT_decl_column(0x30)
$C$DW$1252	.dwtag  DW_TAG_member
	.dwattr $C$DW$1252, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1252, DW_AT_name("nsKey")
	.dwattr $C$DW$1252, DW_AT_TI_symbol_name("nsKey")
	.dwattr $C$DW$1252, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$1252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1252, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1252, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1252, DW_AT_decl_column(0x30)
	.dwendtag $C$DW$T$359

	.dwattr $C$DW$T$359, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$359, DW_AT_decl_line(0xce)
	.dwattr $C$DW$T$359, DW_AT_decl_column(0x10)
$C$DW$T$1237	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Obj")
	.dwattr $C$DW$T$1237, DW_AT_type(*$C$DW$T$359)
	.dwattr $C$DW$T$1237, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1237, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$1237, DW_AT_decl_line(0xed)
	.dwattr $C$DW$T$1237, DW_AT_decl_column(0x03)
$C$DW$T$1238	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1238, DW_AT_type(*$C$DW$T$1237)
	.dwattr $C$DW$T$1238, DW_AT_address_class(0x20)

$C$DW$T$360	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$360, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$360, DW_AT_byte_size(0x04)
$C$DW$1253	.dwtag  DW_TAG_member
	.dwattr $C$DW$1253, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1253, DW_AT_name("obj")
	.dwattr $C$DW$1253, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$1253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1253, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1253, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1253, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$360

	.dwattr $C$DW$T$360, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$360, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$360, DW_AT_decl_column(0x08)
$C$DW$T$1239	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1239, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$T$1239, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1239, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1239, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1239, DW_AT_decl_column(0x27)
$C$DW$T$1240	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1240, DW_AT_type(*$C$DW$T$1239)
	.dwattr $C$DW$T$1240, DW_AT_address_class(0x20)
$C$DW$T$1241	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1241, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$T$1241, DW_AT_address_class(0x20)
$C$DW$T$1242	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$1242, DW_AT_type(*$C$DW$T$1241)
	.dwattr $C$DW$T$1242, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1242, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1242, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$1242, DW_AT_decl_column(0x29)
$C$DW$T$1245	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1245, DW_AT_type(*$C$DW$T$1242)
	.dwattr $C$DW$T$1245, DW_AT_address_class(0x20)

$C$DW$T$365	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$365, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$365, DW_AT_byte_size(0x2c)
$C$DW$1254	.dwtag  DW_TAG_member
	.dwattr $C$DW$1254, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$1254, DW_AT_name("name")
	.dwattr $C$DW$1254, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1254, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1254, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1254, DW_AT_decl_column(0x14)
$C$DW$1255	.dwtag  DW_TAG_member
	.dwattr $C$DW$1255, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1255, DW_AT_name("eventNo")
	.dwattr $C$DW$1255, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1255, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1255, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1255, DW_AT_decl_column(0x14)
$C$DW$1256	.dwtag  DW_TAG_member
	.dwattr $C$DW$1256, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1256, DW_AT_name("openFlag")
	.dwattr $C$DW$1256, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1256, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1256, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1256, DW_AT_decl_column(0x14)
$C$DW$1257	.dwtag  DW_TAG_member
	.dwattr $C$DW$1257, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1257, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1257, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1257, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1257, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1257, DW_AT_decl_column(0x14)
$C$DW$1258	.dwtag  DW_TAG_member
	.dwattr $C$DW$1258, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1258, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1258, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1258, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1258, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1258, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1258, DW_AT_decl_column(0x14)
$C$DW$1259	.dwtag  DW_TAG_member
	.dwattr $C$DW$1259, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1259, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1259, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1259, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1259, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x14)
$C$DW$1260	.dwtag  DW_TAG_member
	.dwattr $C$DW$1260, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$1260, DW_AT_name("gate")
	.dwattr $C$DW$1260, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1260, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1260, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x14)
$C$DW$1261	.dwtag  DW_TAG_member
	.dwattr $C$DW$1261, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1261, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1261, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1261, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1261, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x14)
$C$DW$1262	.dwtag  DW_TAG_member
	.dwattr $C$DW$1262, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1262, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1262, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1262, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1262, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x14)
$C$DW$1263	.dwtag  DW_TAG_member
	.dwattr $C$DW$1263, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1263, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1263, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1263, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1263, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1263, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1263, DW_AT_decl_column(0x14)
$C$DW$1264	.dwtag  DW_TAG_member
	.dwattr $C$DW$1264, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1264, DW_AT_name("regionId")
	.dwattr $C$DW$1264, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1264, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1264, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1264, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1264, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$365

	.dwattr $C$DW$T$365, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$365, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$365, DW_AT_decl_column(0x10)
$C$DW$T$358	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$365)
	.dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$358, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$358, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$358, DW_AT_decl_column(0x03)
$C$DW$T$1248	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1248, DW_AT_type(*$C$DW$T$358)
$C$DW$T$1249	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1249, DW_AT_type(*$C$DW$T$1248)
	.dwattr $C$DW$T$1249, DW_AT_address_class(0x20)
$C$DW$T$1243	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1243, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$T$1243, DW_AT_address_class(0x20)

$C$DW$T$366	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$366, DW_AT_name("ClientNotifyMgr_TaskPostInfo_tag")
	.dwattr $C$DW$T$366, DW_AT_byte_size(0x14)
$C$DW$1265	.dwtag  DW_TAG_member
	.dwattr $C$DW$1265, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1265, DW_AT_name("tskHandle")
	.dwattr $C$DW$1265, DW_AT_TI_symbol_name("tskHandle")
	.dwattr $C$DW$1265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1265, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1265, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1265, DW_AT_decl_column(0x25)
$C$DW$1266	.dwtag  DW_TAG_member
	.dwattr $C$DW$1266, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1266, DW_AT_name("semHandle")
	.dwattr $C$DW$1266, DW_AT_TI_symbol_name("semHandle")
	.dwattr $C$DW$1266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1266, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1266, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1266, DW_AT_decl_column(0x25)
$C$DW$1267	.dwtag  DW_TAG_member
	.dwattr $C$DW$1267, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1267, DW_AT_name("notifyCnt")
	.dwattr $C$DW$1267, DW_AT_TI_symbol_name("notifyCnt")
	.dwattr $C$DW$1267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1267, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1267, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1267, DW_AT_decl_column(0x25)
$C$DW$1268	.dwtag  DW_TAG_member
	.dwattr $C$DW$1268, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1268, DW_AT_name("readIndex")
	.dwattr $C$DW$1268, DW_AT_TI_symbol_name("readIndex")
	.dwattr $C$DW$1268, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1268, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1268, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1268, DW_AT_decl_column(0x25)
$C$DW$1269	.dwtag  DW_TAG_member
	.dwattr $C$DW$1269, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1269, DW_AT_name("writeIndex")
	.dwattr $C$DW$1269, DW_AT_TI_symbol_name("writeIndex")
	.dwattr $C$DW$1269, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1269, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1269, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1269, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$366

	.dwattr $C$DW$T$366, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$366, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$366, DW_AT_decl_column(0x10)
$C$DW$T$338	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_TaskPostInfo")
	.dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$366)
	.dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$338, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x02)

$C$DW$T$368	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$368, DW_AT_name("ClientNotifyMgr_callbackCtx_tag")
	.dwattr $C$DW$T$368, DW_AT_byte_size(0x18)
$C$DW$1270	.dwtag  DW_TAG_member
	.dwattr $C$DW$1270, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$1270, DW_AT_name("gate")
	.dwattr $C$DW$1270, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1270, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1270, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1270, DW_AT_decl_column(0x26)
$C$DW$1271	.dwtag  DW_TAG_member
	.dwattr $C$DW$1271, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1271, DW_AT_name("attrs")
	.dwattr $C$DW$1271, DW_AT_TI_symbol_name("attrs")
	.dwattr $C$DW$1271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1271, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1271, DW_AT_decl_line(0x110)
	.dwattr $C$DW$1271, DW_AT_decl_column(0x26)
$C$DW$1272	.dwtag  DW_TAG_member
	.dwattr $C$DW$1272, DW_AT_type(*$C$DW$T$367)
	.dwattr $C$DW$1272, DW_AT_name("notifyInfoObjBaseAddr")
	.dwattr $C$DW$1272, DW_AT_TI_symbol_name("notifyInfoObjBaseAddr")
	.dwattr $C$DW$1272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1272, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1272, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1272, DW_AT_decl_column(0x23)
$C$DW$1273	.dwtag  DW_TAG_member
	.dwattr $C$DW$1273, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1273, DW_AT_name("minAlign")
	.dwattr $C$DW$1273, DW_AT_TI_symbol_name("minAlign")
	.dwattr $C$DW$1273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1273, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1273, DW_AT_decl_line(0x114)
	.dwattr $C$DW$1273, DW_AT_decl_column(0x23)
$C$DW$1274	.dwtag  DW_TAG_member
	.dwattr $C$DW$1274, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1274, DW_AT_name("cacheEnabled")
	.dwattr $C$DW$1274, DW_AT_TI_symbol_name("cacheEnabled")
	.dwattr $C$DW$1274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1274, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1274, DW_AT_decl_line(0x115)
	.dwattr $C$DW$1274, DW_AT_decl_column(0x24)
$C$DW$1275	.dwtag  DW_TAG_member
	.dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1275, DW_AT_name("instId")
	.dwattr $C$DW$1275, DW_AT_TI_symbol_name("instId")
	.dwattr $C$DW$1275, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1275, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1275, DW_AT_decl_line(0x119)
	.dwattr $C$DW$1275, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$368

	.dwattr $C$DW$T$368, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$368, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$368, DW_AT_decl_column(0x10)
$C$DW$T$1250	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_callbackCtx")
	.dwattr $C$DW$T$1250, DW_AT_type(*$C$DW$T$368)
	.dwattr $C$DW$T$1250, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1250, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$1250, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$T$1250, DW_AT_decl_column(0x02)
$C$DW$T$1251	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1251, DW_AT_type(*$C$DW$T$1250)
	.dwattr $C$DW$T$1251, DW_AT_address_class(0x20)

$C$DW$T$372	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$372, DW_AT_name("ClientNotifyMgr_eventListenerInfo_tag")
	.dwattr $C$DW$T$372, DW_AT_byte_size(0x14)
$C$DW$1276	.dwtag  DW_TAG_member
	.dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$1276, DW_AT_name("listElem")
	.dwattr $C$DW$1276, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1276, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1276, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1276, DW_AT_decl_column(0x1d)
$C$DW$1277	.dwtag  DW_TAG_member
	.dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$371)
	.dwattr $C$DW$1277, DW_AT_name("cbckFxn")
	.dwattr $C$DW$1277, DW_AT_TI_symbol_name("cbckFxn")
	.dwattr $C$DW$1277, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1277, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1277, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1277, DW_AT_decl_column(0x1d)
$C$DW$1278	.dwtag  DW_TAG_member
	.dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1278, DW_AT_name("notifyId")
	.dwattr $C$DW$1278, DW_AT_TI_symbol_name("notifyId")
	.dwattr $C$DW$1278, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1278, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1278, DW_AT_decl_line(0x101)
	.dwattr $C$DW$1278, DW_AT_decl_column(0x1d)
$C$DW$1279	.dwtag  DW_TAG_member
	.dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1279, DW_AT_name("cbContext")
	.dwattr $C$DW$1279, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1279, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1279, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1279, DW_AT_decl_line(0x106)
	.dwattr $C$DW$1279, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$372

	.dwattr $C$DW$T$372, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$372, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$372, DW_AT_decl_column(0x10)
$C$DW$T$1252	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_eventListenerInfo")
	.dwattr $C$DW$T$1252, DW_AT_type(*$C$DW$T$372)
	.dwattr $C$DW$T$1252, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1252, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$1252, DW_AT_decl_line(0x108)
	.dwattr $C$DW$T$1252, DW_AT_decl_column(0x02)
$C$DW$T$1253	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1253, DW_AT_type(*$C$DW$T$1252)
	.dwattr $C$DW$T$1253, DW_AT_address_class(0x20)

$C$DW$T$373	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$373, DW_AT_name("ClientNotifyMgr_notifyPayloadInfo_tag")
	.dwattr $C$DW$T$373, DW_AT_byte_size(0x08)
$C$DW$1280	.dwtag  DW_TAG_member
	.dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1280, DW_AT_name("cliCallbackCtx")
	.dwattr $C$DW$1280, DW_AT_TI_symbol_name("cliCallbackCtx")
	.dwattr $C$DW$1280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1280, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1280, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$1280, DW_AT_decl_column(0x25)
$C$DW$1281	.dwtag  DW_TAG_member
	.dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1281, DW_AT_name("notifyPayload")
	.dwattr $C$DW$1281, DW_AT_TI_symbol_name("notifyPayload")
	.dwattr $C$DW$1281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1281, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1281, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1281, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$373

	.dwattr $C$DW$T$373, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$373, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$T$373, DW_AT_decl_column(0x10)
$C$DW$T$336	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_notifyPayloadInfo")
	.dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$373)
	.dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$336, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$336, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$T$336, DW_AT_decl_column(0x02)

$C$DW$T$337	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$337, DW_AT_byte_size(0x2000)
$C$DW$1282	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1282, DW_AT_upper_bound(0x3ff)
	.dwendtag $C$DW$T$337


$C$DW$T$374	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$374, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$374, DW_AT_byte_size(0x1c)
$C$DW$1283	.dwtag  DW_TAG_member
	.dwattr $C$DW$1283, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1283, DW_AT_name("clientHandle")
	.dwattr $C$DW$1283, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1283, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1283, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1283, DW_AT_decl_column(0x12)
$C$DW$1284	.dwtag  DW_TAG_member
	.dwattr $C$DW$1284, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1284, DW_AT_name("procId")
	.dwattr $C$DW$1284, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1284, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1284, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1284, DW_AT_decl_column(0x12)
$C$DW$1285	.dwtag  DW_TAG_member
	.dwattr $C$DW$1285, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1285, DW_AT_name("notifyType")
	.dwattr $C$DW$1285, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1285, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1285, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1285, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1285, DW_AT_decl_column(0x12)
$C$DW$1286	.dwtag  DW_TAG_member
	.dwattr $C$DW$1286, DW_AT_type(*$C$DW$T$371)
	.dwattr $C$DW$1286, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1286, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1286, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1286, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1286, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1286, DW_AT_decl_column(0x1d)
$C$DW$1287	.dwtag  DW_TAG_member
	.dwattr $C$DW$1287, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1287, DW_AT_name("cbContext")
	.dwattr $C$DW$1287, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1287, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1287, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1287, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1287, DW_AT_decl_column(0x12)
$C$DW$1288	.dwtag  DW_TAG_member
	.dwattr $C$DW$1288, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1288, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1288, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1288, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1288, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1288, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1288, DW_AT_decl_column(0x12)
$C$DW$1289	.dwtag  DW_TAG_member
	.dwattr $C$DW$1289, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1289, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1289, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1289, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1289, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1289, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1289, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$374

	.dwattr $C$DW$T$374, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$374, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$374, DW_AT_decl_column(0x10)
$C$DW$T$1256	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1256, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$T$1256, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1256, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1256, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1256, DW_AT_decl_column(0x03)
$C$DW$T$1257	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1257, DW_AT_type(*$C$DW$T$1256)
	.dwattr $C$DW$T$1257, DW_AT_address_class(0x20)

$C$DW$T$375	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$375, DW_AT_name("ClientNotifyMgr_swiPostInfo_tag")
	.dwattr $C$DW$T$375, DW_AT_byte_size(0x10)
$C$DW$1290	.dwtag  DW_TAG_member
	.dwattr $C$DW$1290, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1290, DW_AT_name("swiHandle")
	.dwattr $C$DW$1290, DW_AT_TI_symbol_name("swiHandle")
	.dwattr $C$DW$1290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1290, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1290, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$1290, DW_AT_decl_column(0x25)
$C$DW$1291	.dwtag  DW_TAG_member
	.dwattr $C$DW$1291, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1291, DW_AT_name("notifyCnt")
	.dwattr $C$DW$1291, DW_AT_TI_symbol_name("notifyCnt")
	.dwattr $C$DW$1291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1291, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1291, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1291, DW_AT_decl_column(0x25)
$C$DW$1292	.dwtag  DW_TAG_member
	.dwattr $C$DW$1292, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1292, DW_AT_name("readIndex")
	.dwattr $C$DW$1292, DW_AT_TI_symbol_name("readIndex")
	.dwattr $C$DW$1292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1292, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1292, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$1292, DW_AT_decl_column(0x25)
$C$DW$1293	.dwtag  DW_TAG_member
	.dwattr $C$DW$1293, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1293, DW_AT_name("writeIndex")
	.dwattr $C$DW$1293, DW_AT_TI_symbol_name("writeIndex")
	.dwattr $C$DW$1293, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1293, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1293, DW_AT_decl_line(0x120)
	.dwattr $C$DW$1293, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$375

	.dwattr $C$DW$T$375, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$375, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$T$375, DW_AT_decl_column(0x10)
$C$DW$T$335	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_swiPostInfo")
	.dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$335, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x02)

$C$DW$T$376	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$376, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$376, DW_AT_byte_size(0x01)
$C$DW$1294	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1294, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1294, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$1294, DW_AT_decl_column(0x05)
$C$DW$1295	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_INTERRUPT"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1295, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1295, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1295, DW_AT_decl_column(0x05)
$C$DW$1296	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_TASKLET"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1296, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1296, DW_AT_decl_line(0xce)
	.dwattr $C$DW$1296, DW_AT_decl_column(0x05)
$C$DW$1297	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_THREAD"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1297, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1297, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1297, DW_AT_decl_column(0x05)
$C$DW$1298	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_PROCESS"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1298, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1298, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1298, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$376

	.dwattr $C$DW$T$376, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$376, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$376, DW_AT_decl_column(0x0e)
$C$DW$T$377	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$377, DW_AT_type(*$C$DW$T$376)
	.dwattr $C$DW$T$377, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$377, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$377, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$T$377, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("GateMP_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$349	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$349, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$349, DW_AT_address_class(0x20)
$C$DW$T$350	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Handle")
	.dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$350, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$350, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$T$350, DW_AT_decl_column(0x1f)

$C$DW$T$380	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$380, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$380, DW_AT_byte_size(0x10)
$C$DW$1299	.dwtag  DW_TAG_member
	.dwattr $C$DW$1299, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$1299, DW_AT_name("name")
	.dwattr $C$DW$1299, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1299, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1299, DW_AT_decl_line(0x101)
	.dwattr $C$DW$1299, DW_AT_decl_column(0x0c)
$C$DW$1300	.dwtag  DW_TAG_member
	.dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1300, DW_AT_name("regionId")
	.dwattr $C$DW$1300, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1300, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1300, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1300, DW_AT_decl_column(0x0c)
$C$DW$1301	.dwtag  DW_TAG_member
	.dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1301, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1301, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1301, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1301, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1301, DW_AT_decl_line(0x117)
	.dwattr $C$DW$1301, DW_AT_decl_column(0x09)
$C$DW$1302	.dwtag  DW_TAG_member
	.dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$377)
	.dwattr $C$DW$1302, DW_AT_name("localProtect")
	.dwattr $C$DW$1302, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1302, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1302, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1302, DW_AT_decl_column(0x19)
$C$DW$1303	.dwtag  DW_TAG_member
	.dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$379)
	.dwattr $C$DW$1303, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1303, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1303, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1303, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1303, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$1303, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$380

	.dwattr $C$DW$T$380, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$380, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$380, DW_AT_decl_column(0x10)
$C$DW$T$1261	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$1261, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$T$1261, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1261, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$1261, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$1261, DW_AT_decl_column(0x03)

$C$DW$T$378	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$378, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$378, DW_AT_byte_size(0x01)
$C$DW$1304	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1304, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1304, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1304, DW_AT_decl_column(0x05)
$C$DW$1305	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_SYSTEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1305, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1305, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1305, DW_AT_decl_column(0x05)
$C$DW$1306	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM1"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1306, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1306, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1306, DW_AT_decl_column(0x05)
$C$DW$1307	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM2"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1307, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1307, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1307, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$378

	.dwattr $C$DW$T$378, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$378, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$378, DW_AT_decl_column(0x0e)
$C$DW$T$379	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$379, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$T$379, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$379, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$379, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$T$379, DW_AT_decl_column(0x03)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("NameServer_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$316	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$316, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$316, DW_AT_address_class(0x20)
$C$DW$T$317	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Handle")
	.dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$T$317, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$317, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$317, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$317, DW_AT_decl_column(0x23)
$C$DW$T$1267	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1267, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$T$1267, DW_AT_address_class(0x20)

$C$DW$T$383	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$383, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$383, DW_AT_byte_size(0x14)
$C$DW$1308	.dwtag  DW_TAG_member
	.dwattr $C$DW$1308, DW_AT_type(*$C$DW$T$382)
	.dwattr $C$DW$1308, DW_AT_name("maxRuntimeEntries")
	.dwattr $C$DW$1308, DW_AT_TI_symbol_name("maxRuntimeEntries")
	.dwattr $C$DW$1308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1308, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1308, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1308, DW_AT_decl_column(0x0a)
$C$DW$1309	.dwtag  DW_TAG_member
	.dwattr $C$DW$1309, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1309, DW_AT_name("tableHeap")
	.dwattr $C$DW$1309, DW_AT_TI_symbol_name("tableHeap")
	.dwattr $C$DW$1309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1309, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1309, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1309, DW_AT_decl_column(0x0a)
$C$DW$1310	.dwtag  DW_TAG_member
	.dwattr $C$DW$1310, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1310, DW_AT_name("checkExisting")
	.dwattr $C$DW$1310, DW_AT_TI_symbol_name("checkExisting")
	.dwattr $C$DW$1310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1310, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1310, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1310, DW_AT_decl_column(0x0a)
$C$DW$1311	.dwtag  DW_TAG_member
	.dwattr $C$DW$1311, DW_AT_type(*$C$DW$T$382)
	.dwattr $C$DW$1311, DW_AT_name("maxValueLen")
	.dwattr $C$DW$1311, DW_AT_TI_symbol_name("maxValueLen")
	.dwattr $C$DW$1311, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1311, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1311, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1311, DW_AT_decl_column(0x0a)
$C$DW$1312	.dwtag  DW_TAG_member
	.dwattr $C$DW$1312, DW_AT_type(*$C$DW$T$382)
	.dwattr $C$DW$1312, DW_AT_name("maxNameLen")
	.dwattr $C$DW$1312, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$1312, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1312, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1312, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1312, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$383

	.dwattr $C$DW$T$383, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
