;******************************************************************************
;* TMS470 C/C++ Codegen                                           Unix v4.9.5 *
;* Date/Time created: Wed Apr  3 11:43:13 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=2 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../../RingIOShm.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS470 C/C++ Codegen Unix v4.9.5 Copyright (c) 1996-2012 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/sksung/work/udx/ch2/ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/cgt470_4_9_5/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)
$C$DW$3	.dwtag  DW_TAG_formal_parameter

	.dwattr $C$DW$1095, DW_AT_decl_column(0x05)
$C$DW$1096	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1096, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1096, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1096, DW_AT_decl_column(0x05)
$C$DW$1097	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1097, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1097, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1097, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1037

	.dwattr $C$DW$T$1037, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1037, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1037, DW_AT_decl_column(0x0e)
$C$DW$T$1038	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1038, DW_AT_type(*$C$DW$T$1037)
	.dwattr $C$DW$T$1038, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1038, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1038, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1038, DW_AT_decl_column(0x03)

$C$DW$T$1039	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1039, DW_AT_byte_size(0x04)
$C$DW$1098	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1098, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1098, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1098, DW_AT_decl_column(0x05)
$C$DW$1099	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1099, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1099, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1099, DW_AT_decl_column(0x05)
$C$DW$1100	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$1100, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1100, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1100, DW_AT_decl_column(0x05)
$C$DW$1101	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1101, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1101, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1101, DW_AT_decl_column(0x05)
$C$DW$1102	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$1102, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1102, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1102, DW_AT_decl_column(0x05)
$C$DW$1103	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$1103, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1103, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1103, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1039

	.dwattr $C$DW$T$1039, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1039, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1039, DW_AT_decl_column(0x0e)
$C$DW$T$1040	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1040, DW_AT_type(*$C$DW$T$1039)
	.dwattr $C$DW$T$1040, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1040, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1040, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1040, DW_AT_decl_column(0x03)

$C$DW$T$1041	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1041, DW_AT_byte_size(0x01)
$C$DW$1104	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1104, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1104, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1104, DW_AT_decl_column(0x05)
$C$DW$1105	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1105, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1105, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1105, DW_AT_decl_column(0x05)
$C$DW$1106	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1106, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1106, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1106, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1041

	.dwattr $C$DW$T$1041, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1041, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1041, DW_AT_decl_column(0x0e)
$C$DW$T$1042	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1042, DW_AT_type(*$C$DW$T$1041)
	.dwattr $C$DW$T$1042, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1042, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1042, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1042, DW_AT_decl_column(0x03)

$C$DW$T$287	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$287, DW_AT_byte_size(0x08)
$C$DW$1107	.dwtag  DW_TAG_member
	.dwattr $C$DW$1107, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1107, DW_AT_name("length")
	.dwattr $C$DW$1107, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1107, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1107, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1107, DW_AT_decl_column(0x16)
$C$DW$1108	.dwtag  DW_TAG_member
	.dwattr $C$DW$1108, DW_AT_type(*$C$DW$T$286)
	.dwattr $C$DW$1108, DW_AT_name("elem")
	.dwattr $C$DW$1108, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1108, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1108, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1108, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$287

	.dwattr $C$DW$T$287, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$287, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$287, DW_AT_decl_column(0x10)
$C$DW$T$1043	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1043, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$T$1043, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1043, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1043, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1043, DW_AT_decl_column(0x43)
$C$DW$T$1044	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1044, DW_AT_type(*$C$DW$T$1043)
	.dwattr $C$DW$T$1044, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1044, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1044, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1044, DW_AT_decl_column(0x30)
$C$DW$T$1045	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1045, DW_AT_type(*$C$DW$T$1044)
	.dwattr $C$DW$T$1045, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1045, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1045, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1045, DW_AT_decl_column(0x2c)

$C$DW$T$288	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$288, DW_AT_byte_size(0x08)
$C$DW$1109	.dwtag  DW_TAG_member
	.dwattr $C$DW$1109, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1109, DW_AT_name("length")
	.dwattr $C$DW$1109, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1109, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1109, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1109, DW_AT_decl_column(0x16)
$C$DW$1110	.dwtag  DW_TAG_member
	.dwattr $C$DW$1110, DW_AT_type(*$C$DW$T$286)
	.dwattr $C$DW$1110, DW_AT_name("elem")
	.dwattr $C$DW$1110, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1110, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1110, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1110, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$288

	.dwattr $C$DW$T$288, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$288, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$288, DW_AT_decl_column(0x10)
$C$DW$T$1046	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1046, DW_AT_type(*$C$DW$T$288)
	.dwattr $C$DW$T$1046, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1046, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1046, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1046, DW_AT_decl_column(0x43)
$C$DW$T$1047	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1047, DW_AT_type(*$C$DW$T$1046)
	.dwattr $C$DW$T$1047, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1047, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1047, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1047, DW_AT_decl_column(0x2f)
$C$DW$T$1048	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1048, DW_AT_type(*$C$DW$T$1047)
	.dwattr $C$DW$T$1048, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1048, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1048, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1048, DW_AT_decl_column(0x2b)

$C$DW$T$291	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$291, DW_AT_byte_size(0x08)
$C$DW$1111	.dwtag  DW_TAG_member
	.dwattr $C$DW$1111, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1111, DW_AT_name("length")
	.dwattr $C$DW$1111, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1111, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1111, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1111, DW_AT_decl_column(0x16)
$C$DW$1112	.dwtag  DW_TAG_member
	.dwattr $C$DW$1112, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$1112, DW_AT_name("elem")
	.dwattr $C$DW$1112, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1112, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1112, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1112, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$291

	.dwattr $C$DW$T$291, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$291, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$291, DW_AT_decl_column(0x10)
$C$DW$T$1049	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1049, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$T$1049, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1049, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1049, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$1049, DW_AT_decl_column(0x42)
$C$DW$T$1050	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1050, DW_AT_type(*$C$DW$T$1049)
	.dwattr $C$DW$T$1050, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1050, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1050, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$1050, DW_AT_decl_column(0x2b)
$C$DW$T$1051	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1051, DW_AT_type(*$C$DW$T$1050)
	.dwattr $C$DW$T$1051, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1051, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1051, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$1051, DW_AT_decl_column(0x27)

$C$DW$T$294	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$294, DW_AT_byte_size(0x08)
$C$DW$1113	.dwtag  DW_TAG_member
	.dwattr $C$DW$1113, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1113, DW_AT_name("length")
	.dwattr $C$DW$1113, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1113, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1113, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1113, DW_AT_decl_column(0x16)
$C$DW$1114	.dwtag  DW_TAG_member
	.dwattr $C$DW$1114, DW_AT_type(*$C$DW$T$293)
	.dwattr $C$DW$1114, DW_AT_name("elem")
	.dwattr $C$DW$1114, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1114, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1114, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1114, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$294

	.dwattr $C$DW$T$294, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$294, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$294, DW_AT_decl_column(0x10)
$C$DW$T$1052	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1052, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$T$1052, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1052, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1052, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$1052, DW_AT_decl_column(0x43)
$C$DW$T$1053	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1053, DW_AT_type(*$C$DW$T$1052)
	.dwattr $C$DW$T$1053, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1053, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1053, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$1053, DW_AT_decl_column(0x2c)
$C$DW$T$1054	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1054, DW_AT_type(*$C$DW$T$1053)
	.dwattr $C$DW$T$1054, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1054, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1054, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$1054, DW_AT_decl_column(0x28)

$C$DW$T$1055	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1055, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1055, DW_AT_byte_size(0x01)
$C$DW$1115	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1115, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1115, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1115, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1055

	.dwattr $C$DW$T$1055, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1055, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1055, DW_AT_decl_column(0x0e)
$C$DW$T$1056	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1056, DW_AT_type(*$C$DW$T$1055)
	.dwattr $C$DW$T$1056, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1056, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1056, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1056, DW_AT_decl_column(0x03)

$C$DW$T$303	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$303, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$303, DW_AT_byte_size(0x10)
$C$DW$1116	.dwtag  DW_TAG_member
	.dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$1116, DW_AT_name("gate")
	.dwattr $C$DW$1116, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1116, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1116, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1116, DW_AT_decl_column(0x1b)
$C$DW$1117	.dwtag  DW_TAG_member
	.dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1117, DW_AT_name("numProcessors")
	.dwattr $C$DW$1117, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1117, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1117, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1117, DW_AT_decl_column(0x0f)
$C$DW$1118	.dwtag  DW_TAG_member
	.dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1118, DW_AT_name("procIds")
	.dwattr $C$DW$1118, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1118, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1118, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1118, DW_AT_decl_column(0x0f)
$C$DW$1119	.dwtag  DW_TAG_member
	.dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1119, DW_AT_name("drvHandles")
	.dwattr $C$DW$1119, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1119, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1119, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1119, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$303

	.dwattr $C$DW$T$303, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$303, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$303, DW_AT_decl_column(0x10)
$C$DW$T$1057	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1057, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$T$1057, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1057, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1057, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1057, DW_AT_decl_column(0x03)

$C$DW$T$1058	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1058, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1058, DW_AT_byte_size(0x01)
$C$DW$1120	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1120, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1120, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1120, DW_AT_decl_column(0x05)
$C$DW$1121	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1121, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1121, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1121, DW_AT_decl_column(0x05)
$C$DW$1122	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1122, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1122, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1122, DW_AT_decl_column(0x05)
$C$DW$1123	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1123, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1123, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1123, DW_AT_decl_column(0x05)
$C$DW$1124	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1124, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1124, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1124, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1058

	.dwattr $C$DW$T$1058, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1058, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1058, DW_AT_decl_column(0x0e)
$C$DW$T$1059	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1059, DW_AT_type(*$C$DW$T$1058)
	.dwattr $C$DW$T$1059, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1059, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1059, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1059, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$1060	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1060, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1060, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1060, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1060, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1060, DW_AT_decl_column(0x27)
$C$DW$T$410	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$410, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$410, DW_AT_address_class(0x20)
$C$DW$T$411	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$411, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$T$411, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$411, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$411, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$411, DW_AT_decl_column(0x29)
$C$DW$T$1067	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1067, DW_AT_type(*$C$DW$T$411)
	.dwattr $C$DW$T$1067, DW_AT_address_class(0x20)

$C$DW$T$316	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$316, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$316, DW_AT_byte_size(0x2c)
$C$DW$1125	.dwtag  DW_TAG_member
	.dwattr $C$DW$1125, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1125, DW_AT_name("name")
	.dwattr $C$DW$1125, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1125, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1125, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1125, DW_AT_decl_column(0x14)
$C$DW$1126	.dwtag  DW_TAG_member
	.dwattr $C$DW$1126, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1126, DW_AT_name("eventNo")
	.dwattr $C$DW$1126, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1126, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1126, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1126, DW_AT_decl_column(0x14)
$C$DW$1127	.dwtag  DW_TAG_member
	.dwattr $C$DW$1127, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1127, DW_AT_name("openFlag")
	.dwattr $C$DW$1127, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1127, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1127, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1127, DW_AT_decl_column(0x14)
$C$DW$1128	.dwtag  DW_TAG_member
	.dwattr $C$DW$1128, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1128, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1128, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1128, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1128, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1128, DW_AT_decl_column(0x14)
$C$DW$1129	.dwtag  DW_TAG_member
	.dwattr $C$DW$1129, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1129, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1129, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1129, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1129, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1129, DW_AT_decl_column(0x14)
$C$DW$1130	.dwtag  DW_TAG_member
	.dwattr $C$DW$1130, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1130, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1130, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1130, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1130, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1130, DW_AT_decl_column(0x14)
$C$DW$1131	.dwtag  DW_TAG_member
	.dwattr $C$DW$1131, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1131, DW_AT_name("gate")
	.dwattr $C$DW$1131, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1131, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1131, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1131, DW_AT_decl_column(0x14)
$C$DW$1132	.dwtag  DW_TAG_member
	.dwattr $C$DW$1132, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1132, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1132, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1132, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1132, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1132, DW_AT_decl_column(0x14)
$C$DW$1133	.dwtag  DW_TAG_member
	.dwattr $C$DW$1133, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1133, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1133, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1133, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1133, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1133, DW_AT_decl_column(0x14)
$C$DW$1134	.dwtag  DW_TAG_member
	.dwattr $C$DW$1134, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1134, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1134, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1134, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1134, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1134, DW_AT_decl_column(0x14)
$C$DW$1135	.dwtag  DW_TAG_member
	.dwattr $C$DW$1135, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1135, DW_AT_name("regionId")
	.dwattr $C$DW$1135, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1135, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1135, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1135, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$316

	.dwattr $C$DW$T$316, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$316, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$316, DW_AT_decl_column(0x10)
$C$DW$T$1063	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1063, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$T$1063, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1063, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1063, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1063, DW_AT_decl_column(0x03)
$C$DW$T$1068	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$1063)
$C$DW$T$1069	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$1068)
	.dwattr $C$DW$T$1069, DW_AT_address_class(0x20)
$C$DW$T$1064	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$1063)
	.dwattr $C$DW$T$1064, DW_AT_address_class(0x20)

$C$DW$T$320	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$320, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$320, DW_AT_byte_size(0x1c)
$C$DW$1136	.dwtag  DW_TAG_member
	.dwattr $C$DW$1136, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1136, DW_AT_name("clientHandle")
	.dwattr $C$DW$1136, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1136, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1136, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1136, DW_AT_decl_column(0x12)
$C$DW$1137	.dwtag  DW_TAG_member
	.dwattr $C$DW$1137, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1137, DW_AT_name("procId")
	.dwattr $C$DW$1137, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1137, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1137, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1137, DW_AT_decl_column(0x12)
$C$DW$1138	.dwtag  DW_TAG_member
	.dwattr $C$DW$1138, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1138, DW_AT_name("notifyType")
	.dwattr $C$DW$1138, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1138, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1138, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1138, DW_AT_decl_column(0x12)
$C$DW$1139	.dwtag  DW_TAG_member
	.dwattr $C$DW$1139, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1139, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1139, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1139, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1139, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1139, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1139, DW_AT_decl_column(0x1d)
$C$DW$1140	.dwtag  DW_TAG_member
	.dwattr $C$DW$1140, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1140, DW_AT_name("cbContext")
	.dwattr $C$DW$1140, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1140, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1140, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1140, DW_AT_decl_column(0x12)
$C$DW$1141	.dwtag  DW_TAG_member
	.dwattr $C$DW$1141, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1141, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1141, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1141, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1141, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1141, DW_AT_decl_column(0x12)
$C$DW$1142	.dwtag  DW_TAG_member
	.dwattr $C$DW$1142, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1142, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1142, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1142, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1142, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1142, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$320

	.dwattr $C$DW$T$320, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$320, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$320, DW_AT_decl_column(0x10)
$C$DW$T$1070	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1070, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$T$1070, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1070, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1070, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1070, DW_AT_decl_column(0x03)
$C$DW$T$1071	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1071, DW_AT_type(*$C$DW$T$1070)
	.dwattr $C$DW$T$1071, DW_AT_address_class(0x20)

$C$DW$T$321	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$321, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$321, DW_AT_byte_size(0x01)
$C$DW$1143	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1143, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1143, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$1143, DW_AT_decl_column(0x05)
$C$DW$1144	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_INTERRUPT"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1144, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1144, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1144, DW_AT_decl_column(0x05)
$C$DW$1145	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_TASKLET"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1145, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1145, DW_AT_decl_line(0xce)
	.dwattr $C$DW$1145, DW_AT_decl_column(0x05)
$C$DW$1146	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_THREAD"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1146, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1146, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1146, DW_AT_decl_column(0x05)
$C$DW$1147	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_PROCESS"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1147, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1147, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1147, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$321

	.dwattr $C$DW$T$321, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$321, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$321, DW_AT_decl_column(0x0e)
$C$DW$T$322	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$321)
	.dwattr $C$DW$T$322, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$322, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$322, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$T$322, DW_AT_decl_column(0x03)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("GateMP_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$310	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$310, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$310, DW_AT_address_class(0x20)
$C$DW$T$311	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Handle")
	.dwattr $C$DW$T$311, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$T$311, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$311, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$311, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$T$311, DW_AT_decl_column(0x1f)
$C$DW$T$1073	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1073, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$T$1073, DW_AT_address_class(0x20)

$C$DW$T$325	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$325, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$325, DW_AT_byte_size(0x10)
$C$DW$1148	.dwtag  DW_TAG_member
	.dwattr $C$DW$1148, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1148, DW_AT_name("name")
	.dwattr $C$DW$1148, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1148, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1148, DW_AT_decl_line(0x101)
	.dwattr $C$DW$1148, DW_AT_decl_column(0x0c)
$C$DW$1149	.dwtag  DW_TAG_member
	.dwattr $C$DW$1149, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1149, DW_AT_name("regionId")
	.dwattr $C$DW$1149, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1149, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1149, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1149, DW_AT_decl_column(0x0c)
$C$DW$1150	.dwtag  DW_TAG_member
	.dwattr $C$DW$1150, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1150, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1150, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1150, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1150, DW_AT_decl_line(0x117)
	.dwattr $C$DW$1150, DW_AT_decl_column(0x09)
$C$DW$1151	.dwtag  DW_TAG_member
	.dwattr $C$DW$1151, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1151, DW_AT_name("localProtect")
	.dwattr $C$DW$1151, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1151, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1151, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1151, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1151, DW_AT_decl_column(0x19)
$C$DW$1152	.dwtag  DW_TAG_member
	.dwattr $C$DW$1152, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1152, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1152, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1152, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1152, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1152, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$1152, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$325

	.dwattr $C$DW$T$325, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x10)
$C$DW$T$1076	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$1076, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$T$1076, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1076, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$1076, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$1076, DW_AT_decl_column(0x03)

$C$DW$T$323	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$323, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$323, DW_AT_byte_size(0x01)
$C$DW$1153	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1153, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1153, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1153, DW_AT_decl_column(0x05)
$C$DW$1154	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_SYSTEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1154, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1154, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1154, DW_AT_decl_column(0x05)
$C$DW$1155	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM1"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1155, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1155, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1155, DW_AT_decl_column(0x05)
$C$DW$1156	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM2"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1156, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1156, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1156, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$323

	.dwattr $C$DW$T$323, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$323, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$323, DW_AT_decl_column(0x0e)
$C$DW$T$324	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$324, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$324, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$T$324, DW_AT_decl_column(0x03)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("IRingIO_Object")
	.dwattr $C$DW$T$21, DW_AT_declaration
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$329	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$329, DW_AT_address_class(0x20)
$C$DW$T$330	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Handle")
	.dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$330, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$330, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$330, DW_AT_decl_column(0x21)
$C$DW$T$331	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$T$331, DW_AT_address_class(0x20)

$C$DW$T$402	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$402, DW_AT_name("IRingIO_Object_tag")
	.dwattr $C$DW$T$402, DW_AT_byte_size(0x90)
$C$DW$1157	.dwtag  DW_TAG_member
	.dwattr $C$DW$1157, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1157, DW_AT_name("listElem")
	.dwattr $C$DW$1157, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1157, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1157, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1157, DW_AT_decl_column(0x27)
$C$DW$1158	.dwtag  DW_TAG_member
	.dwattr $C$DW$1158, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1158, DW_AT_name("ownerProcId")
	.dwattr $C$DW$1158, DW_AT_TI_symbol_name("ownerProcId")
	.dwattr $C$DW$1158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1158, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1158, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1158, DW_AT_decl_column(0x27)
$C$DW$1159	.dwtag  DW_TAG_member
	.dwattr $C$DW$1159, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1159, DW_AT_name("name")
	.dwattr $C$DW$1159, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1159, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1159, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1159, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1159, DW_AT_decl_column(0x27)
$C$DW$1160	.dwtag  DW_TAG_member
	.dwattr $C$DW$1160, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1160, DW_AT_name("ctrlSharedAddr")
	.dwattr $C$DW$1160, DW_AT_TI_symbol_name("ctrlSharedAddr")
	.dwattr $C$DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1160, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1160, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1160, DW_AT_decl_column(0x27)
$C$DW$1161	.dwtag  DW_TAG_member
	.dwattr $C$DW$1161, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1161, DW_AT_name("ctrlRegionId")
	.dwattr $C$DW$1161, DW_AT_TI_symbol_name("ctrlRegionId")
	.dwattr $C$DW$1161, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1161, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1161, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1161, DW_AT_decl_column(0x27)
$C$DW$1162	.dwtag  DW_TAG_member
	.dwattr $C$DW$1162, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1162, DW_AT_name("remoteProcId")
	.dwattr $C$DW$1162, DW_AT_TI_symbol_name("remoteProcId")
	.dwattr $C$DW$1162, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1162, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1162, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1162, DW_AT_decl_column(0x27)
$C$DW$1163	.dwtag  DW_TAG_member
	.dwattr $C$DW$1163, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1163, DW_AT_name("top")
	.dwattr $C$DW$1163, DW_AT_TI_symbol_name("top")
	.dwattr $C$DW$1163, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1163, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1163, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$1163, DW_AT_decl_column(0x27)
$C$DW$1164	.dwtag  DW_TAG_member
	.dwattr $C$DW$1164, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1164, DW_AT_name("nsKey")
	.dwattr $C$DW$1164, DW_AT_TI_symbol_name("nsKey")
	.dwattr $C$DW$1164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1164, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1164, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$1164, DW_AT_decl_column(0x27)
$C$DW$1165	.dwtag  DW_TAG_member
	.dwattr $C$DW$1165, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1165, DW_AT_name("created")
	.dwattr $C$DW$1165, DW_AT_TI_symbol_name("created")
	.dwattr $C$DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1165, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1165, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1165, DW_AT_decl_column(0x27)
$C$DW$1166	.dwtag  DW_TAG_member
	.dwattr $C$DW$1166, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1166, DW_AT_name("deleteFn")
	.dwattr $C$DW$1166, DW_AT_TI_symbol_name("deleteFn")
	.dwattr $C$DW$1166, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1166, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1166, DW_AT_decl_line(0x100)
	.dwattr $C$DW$1166, DW_AT_decl_column(0x27)
$C$DW$1167	.dwtag  DW_TAG_member
	.dwattr $C$DW$1167, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$1167, DW_AT_name("close")
	.dwattr $C$DW$1167, DW_AT_TI_symbol_name("close")
	.dwattr $C$DW$1167, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1167, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1167, DW_AT_decl_line(0x102)
	.dwattr $C$DW$1167, DW_AT_decl_column(0x27)
$C$DW$1168	.dwtag  DW_TAG_member
	.dwattr $C$DW$1168, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1168, DW_AT_name("registerNotifier")
	.dwattr $C$DW$1168, DW_AT_TI_symbol_name("registerNotifier")
	.dwattr $C$DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1168, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1168, DW_AT_decl_line(0x104)
	.dwattr $C$DW$1168, DW_AT_decl_column(0x27)
$C$DW$1169	.dwtag  DW_TAG_member
	.dwattr $C$DW$1169, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$1169, DW_AT_name("unregisterNotifier")
	.dwattr $C$DW$1169, DW_AT_TI_symbol_name("unregisterNotifier")
	.dwattr $C$DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1169, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1169, DW_AT_decl_line(0x106)
	.dwattr $C$DW$1169, DW_AT_decl_column(0x27)
$C$DW$1170	.dwtag  DW_TAG_member
	.dwattr $C$DW$1170, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$1170, DW_AT_name("setWaterMark")
	.dwattr $C$DW$1170, DW_AT_TI_symbol_name("setWaterMark")
	.dwattr $C$DW$1170, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1170, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1170, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1170, DW_AT_decl_column(0x27)
$C$DW$1171	.dwtag  DW_TAG_member
	.dwattr $C$DW$1171, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$1171, DW_AT_name("setNotifyType")
	.dwattr $C$DW$1171, DW_AT_TI_symbol_name("setNotifyType")
	.dwattr $C$DW$1171, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1171, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1171, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1171, DW_AT_decl_column(0x27)
$C$DW$1172	.dwtag  DW_TAG_member
	.dwattr $C$DW$1172, DW_AT_type(*$C$DW$T$361)
	.dwattr $C$DW$1172, DW_AT_name("acquire")
	.dwattr $C$DW$1172, DW_AT_TI_symbol_name("acquire")
	.dwattr $C$DW$1172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1172, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1172, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1172, DW_AT_decl_column(0x27)
$C$DW$1173	.dwtag  DW_TAG_member
	.dwattr $C$DW$1173, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$1173, DW_AT_name("release")
	.dwattr $C$DW$1173, DW_AT_TI_symbol_name("release")
	.dwattr $C$DW$1173, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1173, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1173, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1173, DW_AT_decl_column(0x27)
$C$DW$1174	.dwtag  DW_TAG_member
	.dwattr $C$DW$1174, DW_AT_type(*$C$DW$T$363)
	.dwattr $C$DW$1174, DW_AT_name("cancel")
	.dwattr $C$DW$1174, DW_AT_TI_symbol_name("cancel")
	.dwattr $C$DW$1174, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1174, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1174, DW_AT_decl_line(0x110)
	.dwattr $C$DW$1174, DW_AT_decl_column(0x27)
$C$DW$1175	.dwtag  DW_TAG_member
	.dwattr $C$DW$1175, DW_AT_type(*$C$DW$T$367)
	.dwattr $C$DW$1175, DW_AT_name("getvAttribute")
	.dwattr $C$DW$1175, DW_AT_TI_symbol_name("getvAttribute")
	.dwattr $C$DW$1175, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1175, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1175, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1175, DW_AT_decl_column(0x27)
$C$DW$1176	.dwtag  DW_TAG_member
	.dwattr $C$DW$1176, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1176, DW_AT_name("setvAttribute")
	.dwattr $C$DW$1176, DW_AT_TI_symbol_name("setvAttribute")
	.dwattr $C$DW$1176, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1176, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1176, DW_AT_decl_line(0x114)
	.dwattr $C$DW$1176, DW_AT_decl_column(0x27)
$C$DW$1177	.dwtag  DW_TAG_member
	.dwattr $C$DW$1177, DW_AT_type(*$C$DW$T$373)
	.dwattr $C$DW$1177, DW_AT_name("getAttribute")
	.dwattr $C$DW$1177, DW_AT_TI_symbol_name("getAttribute")
	.dwattr $C$DW$1177, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1177, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1177, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1177, DW_AT_decl_column(0x27)
$C$DW$1178	.dwtag  DW_TAG_member
	.dwattr $C$DW$1178, DW_AT_type(*$C$DW$T$376)
	.dwattr $C$DW$1178, DW_AT_name("setAttribute")
	.dwattr $C$DW$1178, DW_AT_TI_symbol_name("setAttribute")
	.dwattr $C$DW$1178, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$1178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1178, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1178, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1178, DW_AT_decl_column(0x27)
$C$DW$1179	.dwtag  DW_TAG_member
	.dwattr $C$DW$1179, DW_AT_type(*$C$DW$T$379)
	.dwattr $C$DW$1179, DW_AT_name("flush")
	.dwattr $C$DW$1179, DW_AT_TI_symbol_name("flush")
	.dwattr $C$DW$1179, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$1179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1179, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1179, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1179, DW_AT_decl_column(0x27)
$C$DW$1180	.dwtag  DW_TAG_member
	.dwattr $C$DW$1180, DW_AT_type(*$C$DW$T$382)
	.dwattr $C$DW$1180, DW_AT_name("notify")
	.dwattr $C$DW$1180, DW_AT_TI_symbol_name("notify")
	.dwattr $C$DW$1180, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$1180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1180, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1180, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1180, DW_AT_decl_column(0x2b)
$C$DW$1181	.dwtag  DW_TAG_member
	.dwattr $C$DW$1181, DW_AT_type(*$C$DW$T$387)
	.dwattr $C$DW$1181, DW_AT_name("getValidSize")
	.dwattr $C$DW$1181, DW_AT_TI_symbol_name("getValidSize")
	.dwattr $C$DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1181, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1181, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1181, DW_AT_decl_column(0x27)
$C$DW$1182	.dwtag  DW_TAG_member
	.dwattr $C$DW$1182, DW_AT_type(*$C$DW$T$388)
	.dwattr $C$DW$1182, DW_AT_name("getEmptySize")
	.dwattr $C$DW$1182, DW_AT_TI_symbol_name("getEmptySize")
	.dwattr $C$DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$1182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1182, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1182, DW_AT_decl_line(0x120)
	.dwattr $C$DW$1182, DW_AT_decl_column(0x27)
$C$DW$1183	.dwtag  DW_TAG_member
	.dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$389)
	.dwattr $C$DW$1183, DW_AT_name("getValidAttrSize")
	.dwattr $C$DW$1183, DW_AT_TI_symbol_name("getValidAttrSize")
	.dwattr $C$DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1183, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1183, DW_AT_decl_line(0x122)
	.dwattr $C$DW$1183, DW_AT_decl_column(0x27)
$C$DW$1184	.dwtag  DW_TAG_member
	.dwattr $C$DW$1184, DW_AT_type(*$C$DW$T$390)
	.dwattr $C$DW$1184, DW_AT_name("getEmptyAttrSize")
	.dwattr $C$DW$1184, DW_AT_TI_symbol_name("getEmptyAttrSize")
	.dwattr $C$DW$1184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1184, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1184, DW_AT_decl_line(0x124)
	.dwattr $C$DW$1184, DW_AT_decl_column(0x27)
$C$DW$1185	.dwtag  DW_TAG_member
	.dwattr $C$DW$1185, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$1185, DW_AT_name("getAcquiredOffset")
	.dwattr $C$DW$1185, DW_AT_TI_symbol_name("getAcquiredOffset")
	.dwattr $C$DW$1185, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1185, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1185, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1185, DW_AT_decl_column(0x27)
$C$DW$1186	.dwtag  DW_TAG_member
	.dwattr $C$DW$1186, DW_AT_type(*$C$DW$T$392)
	.dwattr $C$DW$1186, DW_AT_name("getAcquiredSize")
	.dwattr $C$DW$1186, DW_AT_TI_symbol_name("getAcquiredSize")
	.dwattr $C$DW$1186, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$1186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1186, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1186, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1186, DW_AT_decl_column(0x27)
$C$DW$1187	.dwtag  DW_TAG_member
	.dwattr $C$DW$1187, DW_AT_type(*$C$DW$T$393)
	.dwattr $C$DW$1187, DW_AT_name("getWaterMark")
	.dwattr $C$DW$1187, DW_AT_TI_symbol_name("getWaterMark")
	.dwattr $C$DW$1187, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$1187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1187, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1187, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1187, DW_AT_decl_column(0x27)
$C$DW$1188	.dwtag  DW_TAG_member
	.dwattr $C$DW$1188, DW_AT_type(*$C$DW$T$396)
	.dwattr $C$DW$1188, DW_AT_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$1188, DW_AT_TI_symbol_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$1188, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$1188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1188, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1188, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$1188, DW_AT_decl_column(0x27)
$C$DW$1189	.dwtag  DW_TAG_member
	.dwattr $C$DW$1189, DW_AT_type(*$C$DW$T$397)
	.dwattr $C$DW$1189, DW_AT_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$1189, DW_AT_TI_symbol_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1189, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1189, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1189, DW_AT_decl_column(0x2a)
$C$DW$1190	.dwtag  DW_TAG_member
	.dwattr $C$DW$1190, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$1190, DW_AT_name("setNotifyId")
	.dwattr $C$DW$1190, DW_AT_TI_symbol_name("setNotifyId")
	.dwattr $C$DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$1190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1190, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1190, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1190, DW_AT_decl_column(0x28)
$C$DW$1191	.dwtag  DW_TAG_member
	.dwattr $C$DW$1191, DW_AT_type(*$C$DW$T$401)
	.dwattr $C$DW$1191, DW_AT_name("resetNotifyId")
	.dwattr $C$DW$1191, DW_AT_TI_symbol_name("resetNotifyId")
	.dwattr $C$DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1191, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1191, DW_AT_decl_line(0x132)
	.dwattr $C$DW$1191, DW_AT_decl_column(0x28)
$C$DW$1192	.dwtag  DW_TAG_member
	.dwattr $C$DW$1192, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1192, DW_AT_name("obj")
	.dwattr $C$DW$1192, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$1192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1192, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1192, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1192, DW_AT_decl_column(0x28)
	.dwendtag $C$DW$T$402

	.dwattr $C$DW$T$402, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$402, DW_AT_decl_line(0xed)
	.dwattr $C$DW$T$402, DW_AT_decl_column(0x08)
$C$DW$T$1077	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Object")
	.dwattr $C$DW$T$1077, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$T$1077, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1077, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$1077, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$1077, DW_AT_decl_column(0x23)
$C$DW$T$1078	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1078, DW_AT_type(*$C$DW$T$1077)
	.dwattr $C$DW$T$1078, DW_AT_address_class(0x20)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("NameServer_Object")
	.dwattr $C$DW$T$22, DW_AT_declaration
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
$C$DW$T$1079	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1079, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$1079, DW_AT_address_class(0x20)
$C$DW$T$1080	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Handle")
	.dwattr $C$DW$T$1080, DW_AT_type(*$C$DW$T$1079)
	.dwattr $C$DW$T$1080, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1080, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$1080, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$1080, DW_AT_decl_column(0x23)

$C$DW$T$403	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$403, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$403, DW_AT_byte_size(0x14)
$C$DW$1193	.dwtag  DW_TAG_member
	.dwattr $C$DW$1193, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$1193, DW_AT_name("maxRuntimeEntries")
	.dwattr $C$DW$1193, DW_AT_TI_symbol_name("maxRuntimeEntries")
	.dwattr $C$DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1193, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x0a)
$C$DW$1194	.dwtag  DW_TAG_member
	.dwattr $C$DW$1194, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1194, DW_AT_name("tableHeap")
	.dwattr $C$DW$1194, DW_AT_TI_symbol_name("tableHeap")
	.dwattr $C$DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1194, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x0a)
$C$DW$1195	.dwtag  DW_TAG_member
	.dwattr $C$DW$1195, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1195, DW_AT_name("checkExisting")
	.dwattr $C$DW$1195, DW_AT_TI_symbol_name("checkExisting")
	.dwattr $C$DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1195, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x0a)
$C$DW$1196	.dwtag  DW_TAG_member
	.dwattr $C$DW$1196, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$1196, DW_AT_name("maxValueLen")
	.dwattr $C$DW$1196, DW_AT_TI_symbol_name("maxValueLen")
	.dwattr $C$DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1196, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x0a)
$C$DW$1197	.dwtag  DW_TAG_member
	.dwattr $C$DW$1197, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$1197, DW_AT_name("maxNameLen")
	.dwattr $C$DW$1197, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1197, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$403

	.dwattr $C$DW$T$403, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$403, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$403, DW_AT_decl_column(0x10)
$C$DW$T$1081	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$1081, DW_AT_type(*$C$DW$T$403)
	.dwattr $C$DW$T$1081, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1081, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$1081, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$1081, DW_AT_decl_column(0x03)

$C$DW$T$408	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$408, DW_AT_name("RingIOShm_Attr_tag")
	.dwattr $C$DW$T$408, DW_AT_byte_size(0x10)
$C$DW$1198	.dwtag  DW_TAG_member
	.dwattr $C$DW$1198, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1198, DW_AT_name("offset")
	.dwattr $C$DW$1198, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1198, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x0f)
$C$DW$1199	.dwtag  DW_TAG_member
	.dwattr $C$DW$1199, DW_AT_type(*$C$DW$T$407)
	.dwattr $C$DW$1199, DW_AT_name("prevoffset")
	.dwattr $C$DW$1199, DW_AT_TI_symbol_name("prevoffset")
	.dwattr $C$DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1199, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x0f)
$C$DW$1200	.dwtag  DW_TAG_member
	.dwattr $C$DW$1200, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1200, DW_AT_name("type")
	.dwattr $C$DW$1200, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1200, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1200, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x0f)
$C$DW$1201	.dwtag  DW_TAG_member
	.dwattr $C$DW$1201, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1201, DW_AT_name("size")
	.dwattr $C$DW$1201, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1201, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1201, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x0f)
$C$DW$1202	.dwtag  DW_TAG_member
	.dwattr $C$DW$1202, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1202, DW_AT_name("param")
	.dwattr $C$DW$1202, DW_AT_TI_symbol_name("param")
	.dwattr $C$DW$1202, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1202, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$408

	.dwattr $C$DW$T$408, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$408, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$T$408, DW_AT_decl_column(0x10)
$C$DW$T$1082	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Attr")
	.dwattr $C$DW$T$1082, DW_AT_type(*$C$DW$T$408)
	.dwattr $C$DW$T$1082, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1082, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$1082, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1082, DW_AT_decl_column(0x03)
$C$DW$T$1083	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1083, DW_AT_type(*$C$DW$T$1082)
	.dwattr $C$DW$T$1083, DW_AT_address_class(0x20)

$C$DW$T$412	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$412, DW_AT_name("RingIOShm_Client_tag")
	.dwattr $C$DW$T$412, DW_AT_byte_size(0x40)
$C$DW$1203	.dwtag  DW_TAG_member
	.dwattr $C$DW$1203, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$1203, DW_AT_name("pDataStart")
	.dwattr $C$DW$1203, DW_AT_TI_symbol_name("pDataStart")
	.dwattr $C$DW$1203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1203, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x1c)
$C$DW$1204	.dwtag  DW_TAG_member
	.dwattr $C$DW$1204, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$1204, DW_AT_name("pAttrStart")
	.dwattr $C$DW$1204, DW_AT_TI_symbol_name("pAttrStart")
	.dwattr $C$DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1204, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0xca)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x1c)
$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1205, DW_AT_name("acqStart")
	.dwattr $C$DW$1205, DW_AT_TI_symbol_name("acqStart")
	.dwattr $C$DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1205, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x1c)
$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1206, DW_AT_name("acqSize")
	.dwattr $C$DW$1206, DW_AT_TI_symbol_name("acqSize")
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1206, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x1c)
$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1207, DW_AT_name("acqAttrStart")
	.dwattr $C$DW$1207, DW_AT_TI_symbol_name("acqAttrStart")
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1207, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x1c)
$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1208, DW_AT_name("acqAttrSize")
	.dwattr $C$DW$1208, DW_AT_TI_symbol_name("acqAttrSize")
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1208, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x1c)
$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1209, DW_AT_name("notifyType")
	.dwattr $C$DW$1209, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1209, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x1c)
$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$1210, DW_AT_name("notifyParam")
	.dwattr $C$DW$1210, DW_AT_TI_symbol_name("notifyParam")
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1210, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x1c)
$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1211, DW_AT_name("notifyWaterMark")
	.dwattr $C$DW$1211, DW_AT_TI_symbol_name("notifyWaterMark")
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1211, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x1c)
$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1212, DW_AT_name("flags")
	.dwattr $C$DW$1212, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1212, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x1c)
$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1213, DW_AT_name("isValid")
	.dwattr $C$DW$1213, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1213, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x1c)
$C$DW$1214	.dwtag  DW_TAG_member
	.dwattr $C$DW$1214, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1214, DW_AT_name("refCount")
	.dwattr $C$DW$1214, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1214, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1214, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x1c)
$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1215, DW_AT_name("notifyId")
	.dwattr $C$DW$1215, DW_AT_TI_symbol_name("notifyId")
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1215, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x1c)
$C$DW$1216	.dwtag  DW_TAG_member
	.dwattr $C$DW$1216, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1216, DW_AT_name("isRegistered")
	.dwattr $C$DW$1216, DW_AT_TI_symbol_name("isRegistered")
	.dwattr $C$DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1216, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1216, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1216, DW_AT_decl_column(0x1c)
$C$DW$1217	.dwtag  DW_TAG_member
	.dwattr $C$DW$1217, DW_AT_type(*$C$DW$T$411)
	.dwattr $C$DW$1217, DW_AT_name("clientNotifyMgrHandle")
	.dwattr $C$DW$1217, DW_AT_TI_symbol_name("clientNotifyMgrHandle")
	.dwattr $C$DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1217, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1217, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1217, DW_AT_decl_column(0x1c)
$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1218, DW_AT_name("clientNotifyMgrGate")
	.dwattr $C$DW$1218, DW_AT_TI_symbol_name("clientNotifyMgrGate")
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1218, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$412

	.dwattr $C$DW$T$412, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$412, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$412, DW_AT_decl_column(0x10)
$C$DW$T$424	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Client")
	.dwattr $C$DW$T$424, DW_AT_type(*$C$DW$T$412)
	.dwattr $C$DW$T$424, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$424, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$424, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$424, DW_AT_decl_column(0x03)
$C$DW$T$1088	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1088, DW_AT_type(*$C$DW$T$424)
$C$DW$T$1089	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1089, DW_AT_type(*$C$DW$T$1088)
	.dwattr $C$DW$T$1089, DW_AT_address_class(0x20)
$C$DW$T$425	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$425, DW_AT_type(*$C$DW$T$424)
	.dwattr $C$DW$T$425, DW_AT_address_class(0x20)
$C$DW$T$426	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ClientHandle")
	.dwattr $C$DW$T$426, DW_AT_type(*$C$DW$T$425)
	.dwattr $C$DW$T$426, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$426, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$426, DW_AT_decl_line(0x146)
	.dwattr $C$DW$T$426, DW_AT_decl_column(0x22)

$C$DW$T$413	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$413, DW_AT_name("RingIOShm_Config_Tag")
	.dwattr $C$DW$T$413, DW_AT_byte_size(0x04)
$C$DW$1219	.dwtag  DW_TAG_member
	.dwattr $C$DW$1219, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1219, DW_AT_name("notifyEventNo")
	.dwattr $C$DW$1219, DW_AT_TI_symbol_name("notifyEventNo")
	.dwattr $C$DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1219, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$1219, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$413

	.dwattr $C$DW$T$413, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$T$413, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$413, DW_AT_decl_column(0x10)
$C$DW$T$1090	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Config")
	.dwattr $C$DW$T$1090, DW_AT_type(*$C$DW$T$413)
	.dwattr $C$DW$T$1090, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1090, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$T$1090, DW_AT_decl_line(0x114)
	.dwattr $C$DW$T$1090, DW_AT_decl_column(0x03)
$C$DW$T$1091	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$1090)
$C$DW$T$1092	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1092, DW_AT_type(*$C$DW$T$1091)
	.dwattr $C$DW$T$1092, DW_AT_address_class(0x20)
$C$DW$T$1093	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1093, DW_AT_type(*$C$DW$T$1090)
	.dwattr $C$DW$T$1093, DW_AT_address_class(0x20)

$C$DW$T$418	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$418, DW_AT_name("RingIOShm_ControlStruct_tag")
	.dwattr $C$DW$T$418, DW_AT_byte_size(0x44)
$C$DW$1220	.dwtag  DW_TAG_member
	.dwattr $C$DW$1220, DW_AT_type(*$C$DW$T$414)
	.dwattr $C$DW$1220, DW_AT_name("interfaceAttrs")
	.dwattr $C$DW$1220, DW_AT_TI_symbol_name("interfaceAttrs")
	.dwattr $C$DW$1220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1220, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1220, DW_AT_decl_line(0x107)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x1d)
$C$DW$1221	.dwtag  DW_TAG_member
	.dwattr $C$DW$1221, DW_AT_type(*$C$DW$T$417)
	.dwattr $C$DW$1221, DW_AT_name("srPtrBufStart")
	.dwattr $C$DW$1221, DW_AT_TI_symbol_name("srPtrBufStart")
	.dwattr $C$DW$1221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1221, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1221, DW_AT_decl_line(0x109)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x1c)
$C$DW$1222	.dwtag  DW_TAG_member
	.dwattr $C$DW$1222, DW_AT_type(*$C$DW$T$417)
	.dwattr $C$DW$1222, DW_AT_name("srPtrBufEnd")
	.dwattr $C$DW$1222, DW_AT_TI_symbol_name("srPtrBufEnd")
	.dwattr $C$DW$1222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1222, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1222, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x1c)
$C$DW$1223	.dwtag  DW_TAG_member
	.dwattr $C$DW$1223, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1223, DW_AT_name("curBufEnd")
	.dwattr $C$DW$1223, DW_AT_TI_symbol_name("curBufEnd")
	.dwattr $C$DW$1223, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1223, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x1b)
$C$DW$1224	.dwtag  DW_TAG_member
	.dwattr $C$DW$1224, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1224, DW_AT_name("dataBufEnd")
	.dwattr $C$DW$1224, DW_AT_TI_symbol_name("dataBufEnd")
	.dwattr $C$DW$1224, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1224, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x1b)
$C$DW$1225	.dwtag  DW_TAG_member
	.dwattr $C$DW$1225, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1225, DW_AT_name("dataSharedAddrSize")
	.dwattr $C$DW$1225, DW_AT_TI_symbol_name("dataSharedAddrSize")
	.dwattr $C$DW$1225, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1225, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x1b)
$C$DW$1226	.dwtag  DW_TAG_member
	.dwattr $C$DW$1226, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1226, DW_AT_name("footBufSize")
	.dwattr $C$DW$1226, DW_AT_TI_symbol_name("footBufSize")
	.dwattr $C$DW$1226, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1226, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0x115)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x1b)
$C$DW$1227	.dwtag  DW_TAG_member
	.dwattr $C$DW$1227, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1227, DW_AT_name("validSize")
	.dwattr $C$DW$1227, DW_AT_TI_symbol_name("validSize")
	.dwattr $C$DW$1227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1227, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0x117)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x1b)
$C$DW$1228	.dwtag  DW_TAG_member
	.dwattr $C$DW$1228, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1228, DW_AT_name("emptySize")
	.dwattr $C$DW$1228, DW_AT_TI_symbol_name("emptySize")
	.dwattr $C$DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1228, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x1b)
$C$DW$1229	.dwtag  DW_TAG_member
	.dwattr $C$DW$1229, DW_AT_type(*$C$DW$T$417)
	.dwattr $C$DW$1229, DW_AT_name("srPtrAttrBufStart")
	.dwattr $C$DW$1229, DW_AT_TI_symbol_name("srPtrAttrBufStart")
	.dwattr $C$DW$1229, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1229, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0x121)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x1b)
$C$DW$1230	.dwtag  DW_TAG_member
	.dwattr $C$DW$1230, DW_AT_type(*$C$DW$T$417)
	.dwattr $C$DW$1230, DW_AT_name("srPtrAttrBufEnd")
	.dwattr $C$DW$1230, DW_AT_TI_symbol_name("srPtrAttrBufEnd")
	.dwattr $C$DW$1230, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1230, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0x123)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x1b)
$C$DW$1231	.dwtag  DW_TAG_member
	.dwattr $C$DW$1231, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1231, DW_AT_name("curAttrBufEnd")
	.dwattr $C$DW$1231, DW_AT_TI_symbol_name("curAttrBufEnd")
	.dwattr $C$DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1231, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x1b)
$C$DW$1232	.dwtag  DW_TAG_member
	.dwattr $C$DW$1232, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1232, DW_AT_name("validAttrSize")
	.dwattr $C$DW$1232, DW_AT_TI_symbol_name("validAttrSize")
	.dwattr $C$DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1232, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x1b)
$C$DW$1233	.dwtag  DW_TAG_member
	.dwattr $C$DW$1233, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1233, DW_AT_name("emptyAttrSize")
	.dwattr $C$DW$1233, DW_AT_TI_symbol_name("emptyAttrSize")
	.dwattr $C$DW$1233, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1233, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x1b)
$C$DW$1234	.dwtag  DW_TAG_member
	.dwattr $C$DW$1234, DW_AT_type(*$C$DW$T$407)
	.dwattr $C$DW$1234, DW_AT_name("prevAttrOffset")
	.dwattr $C$DW$1234, DW_AT_TI_symbol_name("prevAttrOffset")
	.dwattr $C$DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1234, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0x132)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x1b)
$C$DW$1235	.dwtag  DW_TAG_member
	.dwattr $C$DW$1235, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1235, DW_AT_name("procId")
	.dwattr $C$DW$1235, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1235, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1235, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x1b)
$C$DW$1236	.dwtag  DW_TAG_member
	.dwattr $C$DW$1236, DW_AT_type(*$C$DW$T$417)
	.dwattr $C$DW$1236, DW_AT_name("gateMPSharedAddr")
	.dwattr $C$DW$1236, DW_AT_TI_symbol_name("gateMPSharedAddr")
	.dwattr $C$DW$1236, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1236, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0x136)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$418

	.dwattr $C$DW$T$418, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$418, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$418, DW_AT_decl_column(0x10)
$C$DW$T$421	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ControlStruct")
	.dwattr $C$DW$T$421, DW_AT_type(*$C$DW$T$418)
	.dwattr $C$DW$T$421, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$421, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$421, DW_AT_decl_line(0x138)
	.dwattr $C$DW$T$421, DW_AT_decl_column(0x03)
$C$DW$T$1094	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$421)
$C$DW$T$1095	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$1094)
	.dwattr $C$DW$T$1095, DW_AT_address_class(0x20)
$C$DW$T$422	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$422, DW_AT_type(*$C$DW$T$421)
	.dwattr $C$DW$T$422, DW_AT_address_class(0x20)
$C$DW$T$423	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ControlHandle")
	.dwattr $C$DW$T$423, DW_AT_type(*$C$DW$T$422)
	.dwattr $C$DW$T$423, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$423, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$423, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$423, DW_AT_decl_column(0x23)

$C$DW$T$420	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$420, DW_AT_name("RingIOShm_ModuleObject")
	.dwattr $C$DW$T$420, DW_AT_byte_size(0x38)
$C$DW$1237	.dwtag  DW_TAG_member
	.dwattr $C$DW$1237, DW_AT_type(*$C$DW$T$419)
	.dwattr $C$DW$1237, DW_AT_name("defaultInstParams")
	.dwattr $C$DW$1237, DW_AT_TI_symbol_name("defaultInstParams")
	.dwattr $C$DW$1237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1237, DW_AT_decl_file("../../RingIOShm.c")
	.dwattr $C$DW$1237, DW_AT_decl_line(0x78)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x1c)
$C$DW$1238	.dwtag  DW_TAG_member
	.dwattr $C$DW$1238, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$1238, DW_AT_name("refCount")
	.dwattr $C$DW$1238, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$1238, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
