;******************************************************************************
;* TMS470 C/C++ Codegen                                           Unix v4.9.5 *
;* Date/Time created: Wed Apr  3 11:43:19 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=2 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("shMem/FrameQBufMgr_ShMem.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS470 C/C++ Codegen Unix v4.9.5 Copyright (c) 1996-2012 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/sksung/work/udx/ch2/ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/cgt470_4_9_5/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$1413, DW_AT_decl_column(0x05)
$C$DW$1414	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1414, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1414, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1414, DW_AT_decl_column(0x05)
$C$DW$1415	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1415, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1415, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1415, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1127

	.dwattr $C$DW$T$1127, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1127, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1127, DW_AT_decl_column(0x0e)
$C$DW$T$1128	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1128, DW_AT_type(*$C$DW$T$1127)
	.dwattr $C$DW$T$1128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1128, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1128, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1128, DW_AT_decl_column(0x03)

$C$DW$T$1129	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1129, DW_AT_byte_size(0x04)
$C$DW$1416	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1416, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1416, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1416, DW_AT_decl_column(0x05)
$C$DW$1417	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1417, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1417, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1417, DW_AT_decl_column(0x05)
$C$DW$1418	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$1418, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1418, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1418, DW_AT_decl_column(0x05)
$C$DW$1419	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1419, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1419, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1419, DW_AT_decl_column(0x05)
$C$DW$1420	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$1420, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1420, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1420, DW_AT_decl_column(0x05)
$C$DW$1421	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$1421, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1421, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1421, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1129

	.dwattr $C$DW$T$1129, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1129, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1129, DW_AT_decl_column(0x0e)
$C$DW$T$1130	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1130, DW_AT_type(*$C$DW$T$1129)
	.dwattr $C$DW$T$1130, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1130, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1130, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1130, DW_AT_decl_column(0x03)

$C$DW$T$1131	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1131, DW_AT_byte_size(0x01)
$C$DW$1422	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1422, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1422, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1422, DW_AT_decl_column(0x05)
$C$DW$1423	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1423, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1423, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1423, DW_AT_decl_column(0x05)
$C$DW$1424	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1424, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1424, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1424, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1131

	.dwattr $C$DW$T$1131, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1131, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1131, DW_AT_decl_column(0x0e)
$C$DW$T$1132	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1132, DW_AT_type(*$C$DW$T$1131)
	.dwattr $C$DW$T$1132, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1132, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1132, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1132, DW_AT_decl_column(0x03)

$C$DW$T$290	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$290, DW_AT_byte_size(0x04)
$C$DW$1425	.dwtag  DW_TAG_member
	.dwattr $C$DW$1425, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1425, DW_AT_name("width")
	.dwattr $C$DW$1425, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1425, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1425, DW_AT_decl_line(0x75)
	.dwattr $C$DW$1425, DW_AT_decl_column(0x14)
$C$DW$1426	.dwtag  DW_TAG_member
	.dwattr $C$DW$1426, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1426, DW_AT_name("height")
	.dwattr $C$DW$1426, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1426, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1426, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1426, DW_AT_decl_line(0x76)
	.dwattr $C$DW$1426, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$290

	.dwattr $C$DW$T$290, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$T$290, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$290, DW_AT_decl_column(0x10)

$C$DW$T$295	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$295, DW_AT_byte_size(0x08)
$C$DW$1427	.dwtag  DW_TAG_member
	.dwattr $C$DW$1427, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1427, DW_AT_name("length")
	.dwattr $C$DW$1427, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1427, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1427, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1427, DW_AT_decl_column(0x16)
$C$DW$1428	.dwtag  DW_TAG_member
	.dwattr $C$DW$1428, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$1428, DW_AT_name("elem")
	.dwattr $C$DW$1428, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1428, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1428, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1428, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$295

	.dwattr $C$DW$T$295, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$295, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$295, DW_AT_decl_column(0x10)
$C$DW$T$1133	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1133, DW_AT_type(*$C$DW$T$295)
	.dwattr $C$DW$T$1133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1133, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1133, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1133, DW_AT_decl_column(0x43)
$C$DW$T$1134	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1134, DW_AT_type(*$C$DW$T$1133)
	.dwattr $C$DW$T$1134, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1134, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1134, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1134, DW_AT_decl_column(0x30)
$C$DW$T$1135	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1135, DW_AT_type(*$C$DW$T$1134)
	.dwattr $C$DW$T$1135, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1135, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1135, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1135, DW_AT_decl_column(0x2c)

$C$DW$T$296	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$296, DW_AT_byte_size(0x08)
$C$DW$1429	.dwtag  DW_TAG_member
	.dwattr $C$DW$1429, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1429, DW_AT_name("length")
	.dwattr $C$DW$1429, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1429, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1429, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1429, DW_AT_decl_column(0x16)
$C$DW$1430	.dwtag  DW_TAG_member
	.dwattr $C$DW$1430, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$1430, DW_AT_name("elem")
	.dwattr $C$DW$1430, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1430, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1430, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1430, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1430, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$296

	.dwattr $C$DW$T$296, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$296, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$296, DW_AT_decl_column(0x10)
$C$DW$T$1136	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1136, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$T$1136, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1136, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1136, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1136, DW_AT_decl_column(0x43)
$C$DW$T$1137	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1137, DW_AT_type(*$C$DW$T$1136)
	.dwattr $C$DW$T$1137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1137, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1137, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1137, DW_AT_decl_column(0x2f)
$C$DW$T$1138	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1138, DW_AT_type(*$C$DW$T$1137)
	.dwattr $C$DW$T$1138, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1138, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1138, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1138, DW_AT_decl_column(0x2b)

$C$DW$T$299	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$299, DW_AT_byte_size(0x08)
$C$DW$1431	.dwtag  DW_TAG_member
	.dwattr $C$DW$1431, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1431, DW_AT_name("length")
	.dwattr $C$DW$1431, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1431, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1431, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1431, DW_AT_decl_column(0x16)
$C$DW$1432	.dwtag  DW_TAG_member
	.dwattr $C$DW$1432, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$1432, DW_AT_name("elem")
	.dwattr $C$DW$1432, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1432, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1432, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1432, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1432, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$299

	.dwattr $C$DW$T$299, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$299, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$299, DW_AT_decl_column(0x10)
$C$DW$T$1139	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1139, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$T$1139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1139, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1139, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$1139, DW_AT_decl_column(0x42)
$C$DW$T$1140	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1140, DW_AT_type(*$C$DW$T$1139)
	.dwattr $C$DW$T$1140, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1140, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1140, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$1140, DW_AT_decl_column(0x2b)
$C$DW$T$1141	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1141, DW_AT_type(*$C$DW$T$1140)
	.dwattr $C$DW$T$1141, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1141, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1141, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$1141, DW_AT_decl_column(0x27)

$C$DW$T$302	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$302, DW_AT_byte_size(0x08)
$C$DW$1433	.dwtag  DW_TAG_member
	.dwattr $C$DW$1433, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1433, DW_AT_name("length")
	.dwattr $C$DW$1433, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1433, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1433, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1433, DW_AT_decl_column(0x16)
$C$DW$1434	.dwtag  DW_TAG_member
	.dwattr $C$DW$1434, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$1434, DW_AT_name("elem")
	.dwattr $C$DW$1434, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1434, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1434, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1434, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$302

	.dwattr $C$DW$T$302, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$302, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$302, DW_AT_decl_column(0x10)
$C$DW$T$1142	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1142, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$1142, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1142, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1142, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$1142, DW_AT_decl_column(0x43)
$C$DW$T$1143	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1143, DW_AT_type(*$C$DW$T$1142)
	.dwattr $C$DW$T$1143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1143, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1143, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$1143, DW_AT_decl_column(0x2c)
$C$DW$T$1144	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1144, DW_AT_type(*$C$DW$T$1143)
	.dwattr $C$DW$T$1144, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1144, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1144, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$1144, DW_AT_decl_column(0x28)

$C$DW$T$303	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$303, DW_AT_byte_size(0x04)
$C$DW$1435	.dwtag  DW_TAG_member
	.dwattr $C$DW$1435, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$1435, DW_AT_name("area")
	.dwattr $C$DW$1435, DW_AT_TI_symbol_name("area")
	.dwattr $C$DW$1435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1435, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1435, DW_AT_decl_line(0x77)
	.dwattr $C$DW$1435, DW_AT_decl_column(0x0b)
$C$DW$1436	.dwtag  DW_TAG_member
	.dwattr $C$DW$1436, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1436, DW_AT_name("len")
	.dwattr $C$DW$1436, DW_AT_TI_symbol_name("len")
	.dwattr $C$DW$1436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1436, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1436, DW_AT_decl_line(0x78)
	.dwattr $C$DW$1436, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$303

	.dwattr $C$DW$T$303, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$T$303, DW_AT_decl_line(0x73)
	.dwattr $C$DW$T$303, DW_AT_decl_column(0x0b)

$C$DW$T$305	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$305, DW_AT_byte_size(0x14)
$C$DW$1437	.dwtag  DW_TAG_member
	.dwattr $C$DW$1437, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1437, DW_AT_name("shMemParams")
	.dwattr $C$DW$1437, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$1437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1437, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1437, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1437, DW_AT_decl_column(0x37)
	.dwendtag $C$DW$T$305

	.dwattr $C$DW$T$305, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$305, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$305, DW_AT_decl_column(0x08)

$C$DW$T$1145	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1145, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1145, DW_AT_byte_size(0x01)
$C$DW$1438	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1438, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1438, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1438, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1145

	.dwattr $C$DW$T$1145, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1145, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1145, DW_AT_decl_column(0x0e)
$C$DW$T$1146	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1146, DW_AT_type(*$C$DW$T$1145)
	.dwattr $C$DW$T$1146, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1146, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1146, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1146, DW_AT_decl_column(0x03)

$C$DW$T$314	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$314, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$314, DW_AT_byte_size(0x10)
$C$DW$1439	.dwtag  DW_TAG_member
	.dwattr $C$DW$1439, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1439, DW_AT_name("gate")
	.dwattr $C$DW$1439, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1439, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1439, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1439, DW_AT_decl_column(0x1b)
$C$DW$1440	.dwtag  DW_TAG_member
	.dwattr $C$DW$1440, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1440, DW_AT_name("numProcessors")
	.dwattr $C$DW$1440, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1440, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1440, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1440, DW_AT_decl_column(0x0f)
$C$DW$1441	.dwtag  DW_TAG_member
	.dwattr $C$DW$1441, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1441, DW_AT_name("procIds")
	.dwattr $C$DW$1441, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1441, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1441, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1441, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1441, DW_AT_decl_column(0x0f)
$C$DW$1442	.dwtag  DW_TAG_member
	.dwattr $C$DW$1442, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1442, DW_AT_name("drvHandles")
	.dwattr $C$DW$1442, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1442, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1442, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1442, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1442, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$314

	.dwattr $C$DW$T$314, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$314, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$314, DW_AT_decl_column(0x10)
$C$DW$T$1147	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1147, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$T$1147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1147, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1147, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1147, DW_AT_decl_column(0x03)

$C$DW$T$1148	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1148, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1148, DW_AT_byte_size(0x01)
$C$DW$1443	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1443, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1443, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1443, DW_AT_decl_column(0x05)
$C$DW$1444	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1444, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1444, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1444, DW_AT_decl_column(0x05)
$C$DW$1445	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1445, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1445, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1445, DW_AT_decl_column(0x05)
$C$DW$1446	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1446, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1446, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1446, DW_AT_decl_column(0x05)
$C$DW$1447	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1447, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1447, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1447, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1148

	.dwattr $C$DW$T$1148, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1148, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1148, DW_AT_decl_column(0x0e)
$C$DW$T$1149	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1149, DW_AT_type(*$C$DW$T$1148)
	.dwattr $C$DW$T$1149, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1149, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1149, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1149, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$1150	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1150, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1150, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1150, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1150, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1150, DW_AT_decl_column(0x27)
$C$DW$T$391	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$391, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$391, DW_AT_address_class(0x20)
$C$DW$T$392	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$392, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$T$392, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$392, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$392, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$392, DW_AT_decl_column(0x29)
$C$DW$T$1155	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1155, DW_AT_type(*$C$DW$T$392)
	.dwattr $C$DW$T$1155, DW_AT_address_class(0x20)

$C$DW$T$323	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$323, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$323, DW_AT_byte_size(0x2c)
$C$DW$1448	.dwtag  DW_TAG_member
	.dwattr $C$DW$1448, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1448, DW_AT_name("name")
	.dwattr $C$DW$1448, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1448, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1448, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1448, DW_AT_decl_column(0x14)
$C$DW$1449	.dwtag  DW_TAG_member
	.dwattr $C$DW$1449, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1449, DW_AT_name("eventNo")
	.dwattr $C$DW$1449, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1449, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1449, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1449, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1449, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1449, DW_AT_decl_column(0x14)
$C$DW$1450	.dwtag  DW_TAG_member
	.dwattr $C$DW$1450, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1450, DW_AT_name("openFlag")
	.dwattr $C$DW$1450, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1450, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1450, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1450, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1450, DW_AT_decl_column(0x14)
$C$DW$1451	.dwtag  DW_TAG_member
	.dwattr $C$DW$1451, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1451, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1451, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1451, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1451, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1451, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1451, DW_AT_decl_column(0x14)
$C$DW$1452	.dwtag  DW_TAG_member
	.dwattr $C$DW$1452, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1452, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1452, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1452, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1452, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1452, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1452, DW_AT_decl_column(0x14)
$C$DW$1453	.dwtag  DW_TAG_member
	.dwattr $C$DW$1453, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1453, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1453, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1453, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1453, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1453, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1453, DW_AT_decl_column(0x14)
$C$DW$1454	.dwtag  DW_TAG_member
	.dwattr $C$DW$1454, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1454, DW_AT_name("gate")
	.dwattr $C$DW$1454, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1454, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1454, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1454, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1454, DW_AT_decl_column(0x14)
$C$DW$1455	.dwtag  DW_TAG_member
	.dwattr $C$DW$1455, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1455, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1455, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1455, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1455, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1455, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1455, DW_AT_decl_column(0x14)
$C$DW$1456	.dwtag  DW_TAG_member
	.dwattr $C$DW$1456, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1456, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1456, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1456, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1456, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1456, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1456, DW_AT_decl_column(0x14)
$C$DW$1457	.dwtag  DW_TAG_member
	.dwattr $C$DW$1457, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1457, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1457, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1457, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1457, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1457, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1457, DW_AT_decl_column(0x14)
$C$DW$1458	.dwtag  DW_TAG_member
	.dwattr $C$DW$1458, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1458, DW_AT_name("regionId")
	.dwattr $C$DW$1458, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1458, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1458, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1458, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1458, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$323

	.dwattr $C$DW$T$323, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$323, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$323, DW_AT_decl_column(0x10)
$C$DW$T$1151	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1151, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$T$1151, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1151, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1151, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1151, DW_AT_decl_column(0x03)
$C$DW$T$1156	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1156, DW_AT_type(*$C$DW$T$1151)
$C$DW$T$1157	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1157, DW_AT_type(*$C$DW$T$1156)
	.dwattr $C$DW$T$1157, DW_AT_address_class(0x20)
$C$DW$T$1152	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1152, DW_AT_type(*$C$DW$T$1151)
	.dwattr $C$DW$T$1152, DW_AT_address_class(0x20)

$C$DW$T$327	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$327, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$327, DW_AT_byte_size(0x1c)
$C$DW$1459	.dwtag  DW_TAG_member
	.dwattr $C$DW$1459, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1459, DW_AT_name("clientHandle")
	.dwattr $C$DW$1459, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1459, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1459, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1459, DW_AT_decl_column(0x12)
$C$DW$1460	.dwtag  DW_TAG_member
	.dwattr $C$DW$1460, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1460, DW_AT_name("procId")
	.dwattr $C$DW$1460, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1460, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1460, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1460, DW_AT_decl_column(0x12)
$C$DW$1461	.dwtag  DW_TAG_member
	.dwattr $C$DW$1461, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1461, DW_AT_name("notifyType")
	.dwattr $C$DW$1461, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1461, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1461, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1461, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1461, DW_AT_decl_column(0x12)
$C$DW$1462	.dwtag  DW_TAG_member
	.dwattr $C$DW$1462, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1462, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1462, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1462, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1462, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1462, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1462, DW_AT_decl_column(0x1d)
$C$DW$1463	.dwtag  DW_TAG_member
	.dwattr $C$DW$1463, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1463, DW_AT_name("cbContext")
	.dwattr $C$DW$1463, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1463, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1463, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1463, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1463, DW_AT_decl_column(0x12)
$C$DW$1464	.dwtag  DW_TAG_member
	.dwattr $C$DW$1464, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1464, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1464, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1464, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1464, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1464, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1464, DW_AT_decl_column(0x12)
$C$DW$1465	.dwtag  DW_TAG_member
	.dwattr $C$DW$1465, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1465, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1465, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1465, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1465, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1465, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1465, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$327

	.dwattr $C$DW$T$327, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$327, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$327, DW_AT_decl_column(0x10)
$C$DW$T$1158	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1158, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$T$1158, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1158, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1158, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1158, DW_AT_decl_column(0x03)
$C$DW$T$1159	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1159, DW_AT_type(*$C$DW$T$1158)
	.dwattr $C$DW$T$1159, DW_AT_address_class(0x20)

$C$DW$T$482	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$482, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$482, DW_AT_byte_size(0x01)
$C$DW$1466	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1466, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1466, DW_AT_decl_line(0x162)
	.dwattr $C$DW$1466, DW_AT_decl_column(0x05)
$C$DW$1467	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1467, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1467, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1467, DW_AT_decl_column(0x05)
$C$DW$1468	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1468, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1468, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$1468, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$482

	.dwattr $C$DW$T$482, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$482, DW_AT_decl_line(0x161)
	.dwattr $C$DW$T$482, DW_AT_decl_column(0x0e)
$C$DW$T$483	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$483, DW_AT_type(*$C$DW$T$482)
	.dwattr $C$DW$T$483, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$483, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$483, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$T$483, DW_AT_decl_column(0x02)

$C$DW$T$333	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$333, DW_AT_name("FrameQBufMgr_Attrs_Tag")
	.dwattr $C$DW$T$333, DW_AT_byte_size(0x48)
$C$DW$1469	.dwtag  DW_TAG_member
	.dwattr $C$DW$1469, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1469, DW_AT_name("status")
	.dwattr $C$DW$1469, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$1469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1469, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1469, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1469, DW_AT_decl_column(0x1a)
$C$DW$1470	.dwtag  DW_TAG_member
	.dwattr $C$DW$1470, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1470, DW_AT_name("version")
	.dwattr $C$DW$1470, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1470, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1470, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1470, DW_AT_decl_column(0x1a)
$C$DW$1471	.dwtag  DW_TAG_member
	.dwattr $C$DW$1471, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1471, DW_AT_name("localProtect")
	.dwattr $C$DW$1471, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1471, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1471, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1471, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$1471, DW_AT_decl_column(0x1a)
$C$DW$1472	.dwtag  DW_TAG_member
	.dwattr $C$DW$1472, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1472, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1472, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1472, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1472, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1472, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1472, DW_AT_decl_column(0x1a)
$C$DW$1473	.dwtag  DW_TAG_member
	.dwattr $C$DW$1473, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1473, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$1473, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$1473, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1473, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1473, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1473, DW_AT_decl_column(0x1a)
$C$DW$1474	.dwtag  DW_TAG_member
	.dwattr $C$DW$1474, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1474, DW_AT_name("name")
	.dwattr $C$DW$1474, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1474, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1474, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1474, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1474, DW_AT_decl_column(0x1a)
$C$DW$1475	.dwtag  DW_TAG_member
	.dwattr $C$DW$1475, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1475, DW_AT_name("sharedDataBufAddr")
	.dwattr $C$DW$1475, DW_AT_TI_symbol_name("sharedDataBufAddr")
	.dwattr $C$DW$1475, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1475, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1475, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1475, DW_AT_decl_column(0x17)
$C$DW$1476	.dwtag  DW_TAG_member
	.dwattr $C$DW$1476, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1476, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1476, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1476, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1476, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1476, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1476, DW_AT_decl_column(0x18)
$C$DW$1477	.dwtag  DW_TAG_member
	.dwattr $C$DW$1477, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1477, DW_AT_name("numFreeFramePools")
	.dwattr $C$DW$1477, DW_AT_TI_symbol_name("numFreeFramePools")
	.dwattr $C$DW$1477, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1477, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1477, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1477, DW_AT_decl_column(0x17)
$C$DW$1478	.dwtag  DW_TAG_member
	.dwattr $C$DW$1478, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1478, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1478, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1478, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1478, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1478, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1478, DW_AT_decl_column(0x1a)
$C$DW$1479	.dwtag  DW_TAG_member
	.dwattr $C$DW$1479, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1479, DW_AT_name("entryId")
	.dwattr $C$DW$1479, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$1479, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1479, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1479, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1479, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$333

	.dwattr $C$DW$T$333, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x10)
$C$DW$T$382	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Attrs")
	.dwattr $C$DW$T$382, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$T$382, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$382, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$382, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$382, DW_AT_decl_column(0x03)
$C$DW$T$383	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Attrs")
	.dwattr $C$DW$T$383, DW_AT_type(*$C$DW$T$382)
	.dwattr $C$DW$T$383, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$383, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$383, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$383, DW_AT_decl_column(0x27)
$C$DW$T$384	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$383)
$C$DW$T$385	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$T$385, DW_AT_address_class(0x20)

$C$DW$T$484	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$484, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$484, DW_AT_byte_size(0x01)
$C$DW$1480	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1480, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1480, DW_AT_decl_line(0x156)
	.dwattr $C$DW$1480, DW_AT_decl_column(0x05)
$C$DW$1481	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1481, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1481, DW_AT_decl_line(0x158)
	.dwattr $C$DW$1481, DW_AT_decl_column(0x05)
$C$DW$1482	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1482, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1482, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$1482, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$484

	.dwattr $C$DW$T$484, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$484, DW_AT_decl_line(0x155)
	.dwattr $C$DW$T$484, DW_AT_decl_column(0x0e)
$C$DW$T$485	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$485, DW_AT_type(*$C$DW$T$484)
	.dwattr $C$DW$T$485, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$485, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$485, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$T$485, DW_AT_decl_column(0x02)

$C$DW$T$334	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$334, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$334, DW_AT_byte_size(0x0c)
$C$DW$1483	.dwtag  DW_TAG_member
	.dwattr $C$DW$1483, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1483, DW_AT_name("name")
	.dwattr $C$DW$1483, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1483, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1483, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$1483, DW_AT_decl_column(0x11)
$C$DW$1484	.dwtag  DW_TAG_member
	.dwattr $C$DW$1484, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1484, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$1484, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$1484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1484, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1484, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$1484, DW_AT_decl_column(0x11)
$C$DW$1485	.dwtag  DW_TAG_member
	.dwattr $C$DW$1485, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1485, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1485, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1485, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1485, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1485, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$1485, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$334

	.dwattr $C$DW$T$334, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$334, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$T$334, DW_AT_decl_column(0x10)
$C$DW$T$364	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$364, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$364, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$T$364, DW_AT_decl_column(0x03)

$C$DW$T$335	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$335, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$335, DW_AT_byte_size(0x0c)
$C$DW$1486	.dwtag  DW_TAG_member
	.dwattr $C$DW$1486, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1486, DW_AT_name("eventNo")
	.dwattr $C$DW$1486, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1486, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1486, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$1486, DW_AT_decl_column(0x0c)
$C$DW$1487	.dwtag  DW_TAG_member
	.dwattr $C$DW$1487, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1487, DW_AT_name("maxInstances")
	.dwattr $C$DW$1487, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$1487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1487, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1487, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1487, DW_AT_decl_column(0x0c)
$C$DW$1488	.dwtag  DW_TAG_member
	.dwattr $C$DW$1488, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1488, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$1488, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$1488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1488, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1488, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1488, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$335

	.dwattr $C$DW$T$335, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x10)
$C$DW$T$374	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$374, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$374, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$T$374, DW_AT_decl_column(0x03)
$C$DW$T$1161	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Config")
	.dwattr $C$DW$T$1161, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$T$1161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1161, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1161, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$1161, DW_AT_decl_column(0x27)
$C$DW$T$1162	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1162, DW_AT_type(*$C$DW$T$1161)
	.dwattr $C$DW$T$1162, DW_AT_address_class(0x20)
$C$DW$T$1163	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1163, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$T$1163, DW_AT_address_class(0x20)

$C$DW$T$1164	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1164, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$1164, DW_AT_byte_size(0x04)
$C$DW$1489	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1489, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1489, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1489, DW_AT_decl_column(0x09)
$C$DW$1490	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1490, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1490, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1490, DW_AT_decl_column(0x09)
$C$DW$1491	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1491, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1491, DW_AT_decl_line(0x138)
	.dwattr $C$DW$1491, DW_AT_decl_column(0x09)
$C$DW$1492	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$1492, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1492, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$1492, DW_AT_decl_column(0x09)
$C$DW$1493	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$1493, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1493, DW_AT_decl_line(0x140)
	.dwattr $C$DW$1493, DW_AT_decl_column(0x09)
$C$DW$1494	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$1494, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1494, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1494, DW_AT_decl_column(0x09)
$C$DW$1495	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$1495, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1495, DW_AT_decl_line(0x148)
	.dwattr $C$DW$1495, DW_AT_decl_column(0x09)
$C$DW$1496	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$1496, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1496, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$1496, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$1164

	.dwattr $C$DW$T$1164, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1164, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$T$1164, DW_AT_decl_column(0x0e)
$C$DW$T$1165	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$1165, DW_AT_type(*$C$DW$T$1164)
	.dwattr $C$DW$T$1165, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1165, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1165, DW_AT_decl_line(0x150)
	.dwattr $C$DW$T$1165, DW_AT_decl_column(0x03)

$C$DW$T$338	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$338, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$338, DW_AT_byte_size(0x10)
$C$DW$1497	.dwtag  DW_TAG_member
	.dwattr $C$DW$1497, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1497, DW_AT_name("size")
	.dwattr $C$DW$1497, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1497, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1497, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$1497, DW_AT_decl_column(0x0c)
$C$DW$1498	.dwtag  DW_TAG_member
	.dwattr $C$DW$1498, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$1498, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1498, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1498, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1498, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1498, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$1498, DW_AT_decl_column(0x1c)
$C$DW$1499	.dwtag  DW_TAG_member
	.dwattr $C$DW$1499, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1499, DW_AT_name("name")
	.dwattr $C$DW$1499, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1499, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1499, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1499, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$1499, DW_AT_decl_column(0x0c)
$C$DW$1500	.dwtag  DW_TAG_member
	.dwattr $C$DW$1500, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1500, DW_AT_name("openFlag")
	.dwattr $C$DW$1500, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1500, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1500, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1500, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1500, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$338

	.dwattr $C$DW$T$338, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x10)
$C$DW$T$366	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$366, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$T$366, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$366, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$366, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$366, DW_AT_decl_column(0x03)

$C$DW$T$339	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$339, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$339, DW_AT_byte_size(0x14)
$C$DW$1501	.dwtag  DW_TAG_member
	.dwattr $C$DW$1501, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1501, DW_AT_name("size")
	.dwattr $C$DW$1501, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1501, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1501, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$1501, DW_AT_decl_column(0x0c)
$C$DW$1502	.dwtag  DW_TAG_member
	.dwattr $C$DW$1502, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1502, DW_AT_name("pixelFormat")
	.dwattr $C$DW$1502, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$1502, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1502, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1502, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$1502, DW_AT_decl_column(0x0c)
$C$DW$1503	.dwtag  DW_TAG_member
	.dwattr $C$DW$1503, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1503, DW_AT_name("height")
	.dwattr $C$DW$1503, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1503, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1503, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1503, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1503, DW_AT_decl_column(0x0c)
$C$DW$1504	.dwtag  DW_TAG_member
	.dwattr $C$DW$1504, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1504, DW_AT_name("width")
	.dwattr $C$DW$1504, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1504, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1504, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1504, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1504, DW_AT_decl_column(0x0c)
$C$DW$1505	.dwtag  DW_TAG_member
	.dwattr $C$DW$1505, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1505, DW_AT_name("align")
	.dwattr $C$DW$1505, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$1505, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1505, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1505, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$1505, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$339

	.dwattr $C$DW$T$339, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x10)
$C$DW$T$409	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$409, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$T$409, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$409, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$409, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$T$409, DW_AT_decl_column(0x02)
$C$DW$T$410	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$410, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$T$410, DW_AT_address_class(0x20)

$C$DW$T$411	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$411, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$T$411, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$411, DW_AT_byte_size(0x100)
$C$DW$1506	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1506, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$411


$C$DW$T$1173	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1173, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$1173, DW_AT_byte_size(0x01)
$C$DW$1507	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1507, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1507, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$1507, DW_AT_decl_column(0x05)
$C$DW$1508	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1508, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1508, DW_AT_decl_line(0x190)
	.dwattr $C$DW$1508, DW_AT_decl_column(0x05)
$C$DW$1509	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1509, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1509, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1509, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1173

	.dwattr $C$DW$T$1173, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1173, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$1173, DW_AT_decl_column(0x0e)
$C$DW$T$1174	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$1174, DW_AT_type(*$C$DW$T$1173)
	.dwattr $C$DW$T$1174, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1174, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1174, DW_AT_decl_line(0x194)
	.dwattr $C$DW$T$1174, DW_AT_decl_column(0x03)

$C$DW$T$1175	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1175, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$1175, DW_AT_byte_size(0x01)
$C$DW$1510	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1510, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1510, DW_AT_decl_line(0x180)
	.dwattr $C$DW$1510, DW_AT_decl_column(0x05)
$C$DW$1511	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1511, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1511, DW_AT_decl_line(0x184)
	.dwattr $C$DW$1511, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1175

	.dwattr $C$DW$T$1175, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1175, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$1175, DW_AT_decl_column(0x0e)
$C$DW$T$1176	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$1176, DW_AT_type(*$C$DW$T$1175)
	.dwattr $C$DW$T$1176, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1176, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1176, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$1176, DW_AT_decl_column(0x03)

$C$DW$T$354	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$354, DW_AT_name("FrameQBufMgr_FreeFramePoolObj_Tag")
	.dwattr $C$DW$T$354, DW_AT_byte_size(0x2b4)
$C$DW$1512	.dwtag  DW_TAG_member
	.dwattr $C$DW$1512, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1512, DW_AT_name("numFrms")
	.dwattr $C$DW$1512, DW_AT_TI_symbol_name("numFrms")
	.dwattr $C$DW$1512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1512, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1512, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1512, DW_AT_decl_column(0x15)
$C$DW$1513	.dwtag  DW_TAG_member
	.dwattr $C$DW$1513, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1513, DW_AT_name("freeFrms")
	.dwattr $C$DW$1513, DW_AT_TI_symbol_name("freeFrms")
	.dwattr $C$DW$1513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1513, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1513, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1513, DW_AT_decl_column(0x15)
$C$DW$1514	.dwtag  DW_TAG_member
	.dwattr $C$DW$1514, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1514, DW_AT_name("numFrmHdrBufs")
	.dwattr $C$DW$1514, DW_AT_TI_symbol_name("numFrmHdrBufs")
	.dwattr $C$DW$1514, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1514, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1514, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1514, DW_AT_decl_column(0x15)
$C$DW$1515	.dwtag  DW_TAG_member
	.dwattr $C$DW$1515, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1515, DW_AT_name("freeFrmHdrBufs")
	.dwattr $C$DW$1515, DW_AT_TI_symbol_name("freeFrmHdrBufs")
	.dwattr $C$DW$1515, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1515, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1515, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1515, DW_AT_decl_column(0x15)
$C$DW$1516	.dwtag  DW_TAG_member
	.dwattr $C$DW$1516, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1516, DW_AT_name("frmHdrBufSize")
	.dwattr $C$DW$1516, DW_AT_TI_symbol_name("frmHdrBufSize")
	.dwattr $C$DW$1516, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1516, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1516, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1516, DW_AT_decl_column(0x15)
$C$DW$1517	.dwtag  DW_TAG_member
	.dwattr $C$DW$1517, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1517, DW_AT_name("numBufsInFrame")
	.dwattr $C$DW$1517, DW_AT_TI_symbol_name("numBufsInFrame")
	.dwattr $C$DW$1517, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1517, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1517, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1517, DW_AT_decl_column(0x15)
$C$DW$1518	.dwtag  DW_TAG_member
	.dwattr $C$DW$1518, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1518, DW_AT_name("numDynamicHdrBufs")
	.dwattr $C$DW$1518, DW_AT_TI_symbol_name("numDynamicHdrBufs")
	.dwattr $C$DW$1518, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1518, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1518, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1518, DW_AT_decl_column(0x15)
$C$DW$1519	.dwtag  DW_TAG_member
	.dwattr $C$DW$1519, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1519, DW_AT_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1519, DW_AT_TI_symbol_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1519, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1519, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1519, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1519, DW_AT_decl_column(0x15)
$C$DW$1520	.dwtag  DW_TAG_member
	.dwattr $C$DW$1520, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1520, DW_AT_name("numDynamicFrames")
	.dwattr $C$DW$1520, DW_AT_TI_symbol_name("numDynamicFrames")
	.dwattr $C$DW$1520, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1520, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1520, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1520, DW_AT_decl_column(0x15)
$C$DW$1521	.dwtag  DW_TAG_member
	.dwattr $C$DW$1521, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1521, DW_AT_name("freeDynamicFrames")
	.dwattr $C$DW$1521, DW_AT_TI_symbol_name("freeDynamicFrames")
	.dwattr $C$DW$1521, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1521, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1521, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1521, DW_AT_decl_column(0x15)
$C$DW$1522	.dwtag  DW_TAG_member
	.dwattr $C$DW$1522, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1522, DW_AT_name("frmStartAddrp")
	.dwattr $C$DW$1522, DW_AT_TI_symbol_name("frmStartAddrp")
	.dwattr $C$DW$1522, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1522, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1522, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1522, DW_AT_decl_column(0x15)
$C$DW$1523	.dwtag  DW_TAG_member
	.dwattr $C$DW$1523, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1523, DW_AT_name("frmEndAddrp")
	.dwattr $C$DW$1523, DW_AT_TI_symbol_name("frmEndAddrp")
	.dwattr $C$DW$1523, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1523, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1523, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1523, DW_AT_decl_column(0x15)
$C$DW$1524	.dwtag  DW_TAG_member
	.dwattr $C$DW$1524, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1524, DW_AT_name("hdrBufStartAddrp")
	.dwattr $C$DW$1524, DW_AT_TI_symbol_name("hdrBufStartAddrp")
	.dwattr $C$DW$1524, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1524, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1524, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$1524, DW_AT_decl_column(0x15)
$C$DW$1525	.dwtag  DW_TAG_member
	.dwattr $C$DW$1525, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1525, DW_AT_name("hdrBufEndAddrp")
	.dwattr $C$DW$1525, DW_AT_TI_symbol_name("hdrBufEndAddrp")
	.dwattr $C$DW$1525, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1525, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1525, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1525, DW_AT_decl_column(0x15)
$C$DW$1526	.dwtag  DW_TAG_member
	.dwattr $C$DW$1526, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1526, DW_AT_name("frmBufsStartAddrp")
	.dwattr $C$DW$1526, DW_AT_TI_symbol_name("frmBufsStartAddrp")
	.dwattr $C$DW$1526, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1526, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1526, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1526, DW_AT_decl_column(0x15)
$C$DW$1527	.dwtag  DW_TAG_member
	.dwattr $C$DW$1527, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1527, DW_AT_name("frmBufsEndAddrp")
	.dwattr $C$DW$1527, DW_AT_TI_symbol_name("frmBufsEndAddrp")
	.dwattr $C$DW$1527, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1527, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1527, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1527, DW_AT_decl_column(0x15)
$C$DW$1528	.dwtag  DW_TAG_member
	.dwattr $C$DW$1528, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$1528, DW_AT_name("frmBufSize")
	.dwattr $C$DW$1528, DW_AT_TI_symbol_name("frmBufSize")
	.dwattr $C$DW$1528, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1528, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1528, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1528, DW_AT_decl_column(0x15)
$C$DW$1529	.dwtag  DW_TAG_member
	.dwattr $C$DW$1529, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$1529, DW_AT_name("frmRefCnt")
	.dwattr $C$DW$1529, DW_AT_TI_symbol_name("frmRefCnt")
	.dwattr $C$DW$1529, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1529, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1529, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1529, DW_AT_decl_column(0x15)
$C$DW$1530	.dwtag  DW_TAG_member
	.dwattr $C$DW$1530, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1530, DW_AT_name("dynFrame")
	.dwattr $C$DW$1530, DW_AT_TI_symbol_name("dynFrame")
	.dwattr $C$DW$1530, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$1530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1530, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1530, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1530, DW_AT_decl_column(0x15)
$C$DW$1531	.dwtag  DW_TAG_member
	.dwattr $C$DW$1531, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1531, DW_AT_name("dynFrmRefCnt")
	.dwattr $C$DW$1531, DW_AT_TI_symbol_name("dynFrmRefCnt")
	.dwattr $C$DW$1531, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$1531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1531, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1531, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1531, DW_AT_decl_column(0x15)
$C$DW$1532	.dwtag  DW_TAG_member
	.dwattr $C$DW$1532, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1532, DW_AT_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1532, DW_AT_TI_symbol_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1532, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$1532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1532, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1532, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1532, DW_AT_decl_column(0x15)
$C$DW$1533	.dwtag  DW_TAG_member
	.dwattr $C$DW$1533, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1533, DW_AT_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1533, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1533, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr $C$DW$1533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1533, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1533, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1533, DW_AT_decl_column(0x15)
$C$DW$1534	.dwtag  DW_TAG_member
	.dwattr $C$DW$1534, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1534, DW_AT_name("dynHdrBufs")
	.dwattr $C$DW$1534, DW_AT_TI_symbol_name("dynHdrBufs")
	.dwattr $C$DW$1534, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr $C$DW$1534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1534, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1534, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1534, DW_AT_decl_column(0x15)
$C$DW$1535	.dwtag  DW_TAG_member
	.dwattr $C$DW$1535, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$1535, DW_AT_name("hdrBufIsUsed")
	.dwattr $C$DW$1535, DW_AT_TI_symbol_name("hdrBufIsUsed")
	.dwattr $C$DW$1535, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr $C$DW$1535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1535, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1535, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1535, DW_AT_decl_column(0x15)
$C$DW$1536	.dwtag  DW_TAG_member
	.dwattr $C$DW$1536, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1536, DW_AT_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1536, DW_AT_TI_symbol_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1536, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$1536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1536, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1536, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1536, DW_AT_decl_column(0x15)
$C$DW$1537	.dwtag  DW_TAG_member
	.dwattr $C$DW$1537, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$1537, DW_AT_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1537, DW_AT_TI_symbol_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1537, DW_AT_data_member_location[DW_OP_plus_uconst 0x272]
	.dwattr $C$DW$1537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1537, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1537, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1537, DW_AT_decl_column(0x15)
$C$DW$1538	.dwtag  DW_TAG_member
	.dwattr $C$DW$1538, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1538, DW_AT_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1538, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1538, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b2]
	.dwattr $C$DW$1538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1538, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1538, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1538, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$354

	.dwattr $C$DW$T$354, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x10)
$C$DW$T$386	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FreeFramePoolObj")
	.dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$386, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$386, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$386, DW_AT_decl_column(0x03)
$C$DW$T$387	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_FreeFramePoolObj")
	.dwattr $C$DW$T$387, DW_AT_type(*$C$DW$T$386)
	.dwattr $C$DW$T$387, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$387, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$387, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$387, DW_AT_decl_column(0x27)
$C$DW$T$388	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$388, DW_AT_type(*$C$DW$T$387)
$C$DW$T$389	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$389, DW_AT_type(*$C$DW$T$388)
	.dwattr $C$DW$T$389, DW_AT_address_class(0x20)
$C$DW$T$390	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$390, DW_AT_type(*$C$DW$T$389)
	.dwattr $C$DW$T$390, DW_AT_address_class(0x20)
$C$DW$T$1177	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1177, DW_AT_type(*$C$DW$T$387)
	.dwattr $C$DW$T$1177, DW_AT_address_class(0x20)

$C$DW$T$336	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$336, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$336, DW_AT_byte_size(0x01)
$C$DW$1539	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1539, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1539, DW_AT_decl_line(0x174)
	.dwattr $C$DW$1539, DW_AT_decl_column(0x05)
$C$DW$1540	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1540, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1540, DW_AT_decl_line(0x178)
	.dwattr $C$DW$1540, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$336

	.dwattr $C$DW$T$336, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$336, DW_AT_decl_line(0x173)
	.dwattr $C$DW$T$336, DW_AT_decl_column(0x0e)
$C$DW$T$337	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$337, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0x179)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x03)

$C$DW$T$355	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$355, DW_AT_name("FrameQBufMgr_NameServerEntry_tag")
	.dwattr $C$DW$T$355, DW_AT_byte_size(0x20)
$C$DW$1541	.dwtag  DW_TAG_member
	.dwattr $C$DW$1541, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1541, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1541, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1541, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1541, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1541, DW_AT_decl_column(0x0f)
$C$DW$1542	.dwtag  DW_TAG_member
	.dwattr $C$DW$1542, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1542, DW_AT_name("headerInterfaceType")
	.dwattr $C$DW$1542, DW_AT_TI_symbol_name("headerInterfaceType")
	.dwattr $C$DW$1542, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1542, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1542, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1542, DW_AT_decl_column(0x0f)
$C$DW$1543	.dwtag  DW_TAG_member
	.dwattr $C$DW$1543, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1543, DW_AT_name("bufInterfaceType")
	.dwattr $C$DW$1543, DW_AT_TI_symbol_name("bufInterfaceType")
	.dwattr $C$DW$1543, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1543, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1543, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1543, DW_AT_decl_column(0x0f)
$C$DW$1544	.dwtag  DW_TAG_member
	.dwattr $C$DW$1544, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1544, DW_AT_name("instParams")
	.dwattr $C$DW$1544, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$1544, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1544, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1544, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1544, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$355

	.dwattr $C$DW$T$355, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$355, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$355, DW_AT_decl_column(0x10)
$C$DW$T$1179	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NameServerEntry")
	.dwattr $C$DW$T$1179, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$T$1179, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1179, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1179, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1179, DW_AT_decl_column(0x02)
$C$DW$T$1180	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1180, DW_AT_type(*$C$DW$T$1179)
	.dwattr $C$DW$T$1180, DW_AT_address_class(0x20)

$C$DW$T$363	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$363, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$363, DW_AT_byte_size(0x14)
$C$DW$1545	.dwtag  DW_TAG_member
	.dwattr $C$DW$1545, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1545, DW_AT_name("notifyType")
	.dwattr $C$DW$1545, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1545, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1545, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$1545, DW_AT_decl_column(0x1d)
$C$DW$1546	.dwtag  DW_TAG_member
	.dwattr $C$DW$1546, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1546, DW_AT_name("watermark")
	.dwattr $C$DW$1546, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$1546, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1546, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1546, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$1546, DW_AT_decl_column(0x1d)
$C$DW$1547	.dwtag  DW_TAG_member
	.dwattr $C$DW$1547, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$1547, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$1547, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$1547, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1547, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1547, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$1547, DW_AT_decl_column(0x1d)
$C$DW$1548	.dwtag  DW_TAG_member
	.dwattr $C$DW$1548, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1548, DW_AT_name("cbContext")
	.dwattr $C$DW$1548, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1548, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1548, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1548, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$1548, DW_AT_decl_column(0x1d)
$C$DW$1549	.dwtag  DW_TAG_member
	.dwattr $C$DW$1549, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1549, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$1549, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$1549, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1549, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1549, DW_AT_decl_line(0x201)
	.dwattr $C$DW$1549, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$363

	.dwattr $C$DW$T$363, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$363, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$T$363, DW_AT_decl_column(0x10)
$C$DW$T$464	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$464, DW_AT_type(*$C$DW$T$363)
	.dwattr $C$DW$T$464, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$464, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$464, DW_AT_decl_line(0x204)
	.dwattr $C$DW$T$464, DW_AT_decl_column(0x03)
$C$DW$T$1181	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_NotifyParams")
	.dwattr $C$DW$T$1181, DW_AT_type(*$C$DW$T$464)
	.dwattr $C$DW$T$1181, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1181, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1181, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1181, DW_AT_decl_column(0x27)
$C$DW$T$1182	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1182, DW_AT_type(*$C$DW$T$1181)
	.dwattr $C$DW$T$1182, DW_AT_address_class(0x20)
$C$DW$T$465	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$465, DW_AT_type(*$C$DW$T$464)
	.dwattr $C$DW$T$465, DW_AT_address_class(0x20)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("FrameQBufMgr_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$358	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$358, DW_AT_address_class(0x20)
$C$DW$T$359	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Handle")
	.dwattr $C$DW$T$359, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$T$359, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$359, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$359, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$T$359, DW_AT_decl_column(0x25)

$C$DW$T$365	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$365, DW_AT_name("FrameQBufMgr_OpenParams_tag")
	.dwattr $C$DW$T$365, DW_AT_byte_size(0x0c)
$C$DW$1550	.dwtag  DW_TAG_member
	.dwattr $C$DW$1550, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$1550, DW_AT_name("commonOpenParams")
	.dwattr $C$DW$1550, DW_AT_TI_symbol_name("commonOpenParams")
	.dwattr $C$DW$1550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1550, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1550, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1550, DW_AT_decl_column(0x27)
	.dwendtag $C$DW$T$365

	.dwattr $C$DW$T$365, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$365, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$365, DW_AT_decl_column(0x10)
$C$DW$T$1183	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_OpenParams")
	.dwattr $C$DW$T$1183, DW_AT_type(*$C$DW$T$365)
	.dwattr $C$DW$T$1183, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1183, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
