;******************************************************************************
;* TMS470 C/C++ Codegen                                           Unix v4.9.5 *
;* Date/Time created: Wed Apr  3 11:43:27 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=2 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("shMem/FrameQBufMgr_ShMem.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS470 C/C++ Codegen Unix v4.9.5 Copyright (c) 1996-2012 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/sksung/work/udx/ch2/ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/cgt470_4_9_5/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$1527, DW_AT_decl_column(0x05)
$C$DW$1528	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1528, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1528, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1528, DW_AT_decl_column(0x05)
$C$DW$1529	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1529, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1529, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1529, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1127

	.dwattr $C$DW$T$1127, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1127, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1127, DW_AT_decl_column(0x0e)
$C$DW$T$1128	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1128, DW_AT_type(*$C$DW$T$1127)
	.dwattr $C$DW$T$1128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1128, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1128, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1128, DW_AT_decl_column(0x03)

$C$DW$T$1129	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1129, DW_AT_byte_size(0x04)
$C$DW$1530	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1530, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1530, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1530, DW_AT_decl_column(0x05)
$C$DW$1531	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1531, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1531, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1531, DW_AT_decl_column(0x05)
$C$DW$1532	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$1532, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1532, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1532, DW_AT_decl_column(0x05)
$C$DW$1533	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1533, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1533, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1533, DW_AT_decl_column(0x05)
$C$DW$1534	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$1534, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1534, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1534, DW_AT_decl_column(0x05)
$C$DW$1535	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$1535, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1535, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1535, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1129

	.dwattr $C$DW$T$1129, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1129, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1129, DW_AT_decl_column(0x0e)
$C$DW$T$1130	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1130, DW_AT_type(*$C$DW$T$1129)
	.dwattr $C$DW$T$1130, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1130, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1130, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1130, DW_AT_decl_column(0x03)

$C$DW$T$1131	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1131, DW_AT_byte_size(0x01)
$C$DW$1536	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1536, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1536, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1536, DW_AT_decl_column(0x05)
$C$DW$1537	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1537, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1537, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1537, DW_AT_decl_column(0x05)
$C$DW$1538	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1538, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1538, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1538, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1131

	.dwattr $C$DW$T$1131, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1131, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1131, DW_AT_decl_column(0x0e)
$C$DW$T$1132	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1132, DW_AT_type(*$C$DW$T$1131)
	.dwattr $C$DW$T$1132, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1132, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1132, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1132, DW_AT_decl_column(0x03)

$C$DW$T$290	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$290, DW_AT_byte_size(0x04)
$C$DW$1539	.dwtag  DW_TAG_member
	.dwattr $C$DW$1539, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1539, DW_AT_name("width")
	.dwattr $C$DW$1539, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1539, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1539, DW_AT_decl_line(0x75)
	.dwattr $C$DW$1539, DW_AT_decl_column(0x14)
$C$DW$1540	.dwtag  DW_TAG_member
	.dwattr $C$DW$1540, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1540, DW_AT_name("height")
	.dwattr $C$DW$1540, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1540, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1540, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1540, DW_AT_decl_line(0x76)
	.dwattr $C$DW$1540, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$290

	.dwattr $C$DW$T$290, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$T$290, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$290, DW_AT_decl_column(0x10)

$C$DW$T$295	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$295, DW_AT_byte_size(0x08)
$C$DW$1541	.dwtag  DW_TAG_member
	.dwattr $C$DW$1541, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1541, DW_AT_name("length")
	.dwattr $C$DW$1541, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1541, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1541, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1541, DW_AT_decl_column(0x16)
$C$DW$1542	.dwtag  DW_TAG_member
	.dwattr $C$DW$1542, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$1542, DW_AT_name("elem")
	.dwattr $C$DW$1542, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1542, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1542, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1542, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1542, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$295

	.dwattr $C$DW$T$295, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$295, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$295, DW_AT_decl_column(0x10)
$C$DW$T$1133	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1133, DW_AT_type(*$C$DW$T$295)
	.dwattr $C$DW$T$1133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1133, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1133, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1133, DW_AT_decl_column(0x43)
$C$DW$T$1134	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1134, DW_AT_type(*$C$DW$T$1133)
	.dwattr $C$DW$T$1134, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1134, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1134, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1134, DW_AT_decl_column(0x30)
$C$DW$T$1135	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1135, DW_AT_type(*$C$DW$T$1134)
	.dwattr $C$DW$T$1135, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1135, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1135, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1135, DW_AT_decl_column(0x2c)

$C$DW$T$296	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$296, DW_AT_byte_size(0x08)
$C$DW$1543	.dwtag  DW_TAG_member
	.dwattr $C$DW$1543, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1543, DW_AT_name("length")
	.dwattr $C$DW$1543, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1543, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1543, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1543, DW_AT_decl_column(0x16)
$C$DW$1544	.dwtag  DW_TAG_member
	.dwattr $C$DW$1544, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$1544, DW_AT_name("elem")
	.dwattr $C$DW$1544, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1544, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1544, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1544, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1544, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$296

	.dwattr $C$DW$T$296, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$296, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$296, DW_AT_decl_column(0x10)
$C$DW$T$1136	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1136, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$T$1136, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1136, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1136, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1136, DW_AT_decl_column(0x43)
$C$DW$T$1137	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1137, DW_AT_type(*$C$DW$T$1136)
	.dwattr $C$DW$T$1137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1137, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1137, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1137, DW_AT_decl_column(0x2f)
$C$DW$T$1138	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1138, DW_AT_type(*$C$DW$T$1137)
	.dwattr $C$DW$T$1138, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1138, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1138, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1138, DW_AT_decl_column(0x2b)

$C$DW$T$299	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$299, DW_AT_byte_size(0x08)
$C$DW$1545	.dwtag  DW_TAG_member
	.dwattr $C$DW$1545, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1545, DW_AT_name("length")
	.dwattr $C$DW$1545, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1545, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1545, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1545, DW_AT_decl_column(0x16)
$C$DW$1546	.dwtag  DW_TAG_member
	.dwattr $C$DW$1546, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$1546, DW_AT_name("elem")
	.dwattr $C$DW$1546, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1546, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1546, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1546, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1546, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$299

	.dwattr $C$DW$T$299, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$299, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$299, DW_AT_decl_column(0x10)
$C$DW$T$1139	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1139, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$T$1139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1139, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1139, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$1139, DW_AT_decl_column(0x42)
$C$DW$T$1140	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1140, DW_AT_type(*$C$DW$T$1139)
	.dwattr $C$DW$T$1140, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1140, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1140, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$1140, DW_AT_decl_column(0x2b)
$C$DW$T$1141	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1141, DW_AT_type(*$C$DW$T$1140)
	.dwattr $C$DW$T$1141, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1141, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1141, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$1141, DW_AT_decl_column(0x27)

$C$DW$T$302	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$302, DW_AT_byte_size(0x08)
$C$DW$1547	.dwtag  DW_TAG_member
	.dwattr $C$DW$1547, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1547, DW_AT_name("length")
	.dwattr $C$DW$1547, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1547, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1547, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1547, DW_AT_decl_column(0x16)
$C$DW$1548	.dwtag  DW_TAG_member
	.dwattr $C$DW$1548, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$1548, DW_AT_name("elem")
	.dwattr $C$DW$1548, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1548, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1548, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1548, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1548, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$302

	.dwattr $C$DW$T$302, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$302, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$302, DW_AT_decl_column(0x10)
$C$DW$T$1142	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1142, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$1142, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1142, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1142, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$1142, DW_AT_decl_column(0x43)
$C$DW$T$1143	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1143, DW_AT_type(*$C$DW$T$1142)
	.dwattr $C$DW$T$1143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1143, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1143, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$1143, DW_AT_decl_column(0x2c)
$C$DW$T$1144	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1144, DW_AT_type(*$C$DW$T$1143)
	.dwattr $C$DW$T$1144, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1144, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1144, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$1144, DW_AT_decl_column(0x28)

$C$DW$T$303	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$303, DW_AT_byte_size(0x04)
$C$DW$1549	.dwtag  DW_TAG_member
	.dwattr $C$DW$1549, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$1549, DW_AT_name("area")
	.dwattr $C$DW$1549, DW_AT_TI_symbol_name("area")
	.dwattr $C$DW$1549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1549, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1549, DW_AT_decl_line(0x77)
	.dwattr $C$DW$1549, DW_AT_decl_column(0x0b)
$C$DW$1550	.dwtag  DW_TAG_member
	.dwattr $C$DW$1550, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1550, DW_AT_name("len")
	.dwattr $C$DW$1550, DW_AT_TI_symbol_name("len")
	.dwattr $C$DW$1550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1550, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1550, DW_AT_decl_line(0x78)
	.dwattr $C$DW$1550, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$303

	.dwattr $C$DW$T$303, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$T$303, DW_AT_decl_line(0x73)
	.dwattr $C$DW$T$303, DW_AT_decl_column(0x0b)

$C$DW$T$305	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$305, DW_AT_byte_size(0x14)
$C$DW$1551	.dwtag  DW_TAG_member
	.dwattr $C$DW$1551, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1551, DW_AT_name("shMemParams")
	.dwattr $C$DW$1551, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$1551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1551, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1551, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1551, DW_AT_decl_column(0x37)
	.dwendtag $C$DW$T$305

	.dwattr $C$DW$T$305, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$305, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$305, DW_AT_decl_column(0x08)

$C$DW$T$1145	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1145, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1145, DW_AT_byte_size(0x01)
$C$DW$1552	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1552, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1552, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1552, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1145

	.dwattr $C$DW$T$1145, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1145, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1145, DW_AT_decl_column(0x0e)
$C$DW$T$1146	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1146, DW_AT_type(*$C$DW$T$1145)
	.dwattr $C$DW$T$1146, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1146, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1146, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1146, DW_AT_decl_column(0x03)

$C$DW$T$314	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$314, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$314, DW_AT_byte_size(0x10)
$C$DW$1553	.dwtag  DW_TAG_member
	.dwattr $C$DW$1553, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1553, DW_AT_name("gate")
	.dwattr $C$DW$1553, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1553, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1553, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1553, DW_AT_decl_column(0x1b)
$C$DW$1554	.dwtag  DW_TAG_member
	.dwattr $C$DW$1554, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1554, DW_AT_name("numProcessors")
	.dwattr $C$DW$1554, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1554, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1554, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1554, DW_AT_decl_column(0x0f)
$C$DW$1555	.dwtag  DW_TAG_member
	.dwattr $C$DW$1555, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1555, DW_AT_name("procIds")
	.dwattr $C$DW$1555, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1555, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1555, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1555, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1555, DW_AT_decl_column(0x0f)
$C$DW$1556	.dwtag  DW_TAG_member
	.dwattr $C$DW$1556, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1556, DW_AT_name("drvHandles")
	.dwattr $C$DW$1556, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1556, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1556, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1556, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1556, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$314

	.dwattr $C$DW$T$314, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$314, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$314, DW_AT_decl_column(0x10)
$C$DW$T$1147	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1147, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$T$1147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1147, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1147, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1147, DW_AT_decl_column(0x03)

$C$DW$T$1148	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1148, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1148, DW_AT_byte_size(0x01)
$C$DW$1557	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1557, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1557, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1557, DW_AT_decl_column(0x05)
$C$DW$1558	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1558, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1558, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1558, DW_AT_decl_column(0x05)
$C$DW$1559	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1559, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1559, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1559, DW_AT_decl_column(0x05)
$C$DW$1560	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1560, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1560, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1560, DW_AT_decl_column(0x05)
$C$DW$1561	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1561, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1561, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1561, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1148

	.dwattr $C$DW$T$1148, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1148, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1148, DW_AT_decl_column(0x0e)
$C$DW$T$1149	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1149, DW_AT_type(*$C$DW$T$1148)
	.dwattr $C$DW$T$1149, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1149, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1149, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1149, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$1150	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1150, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1150, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1150, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1150, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1150, DW_AT_decl_column(0x27)
$C$DW$T$391	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$391, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$391, DW_AT_address_class(0x20)
$C$DW$T$392	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$392, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$T$392, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$392, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$392, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$392, DW_AT_decl_column(0x29)
$C$DW$T$1154	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1154, DW_AT_type(*$C$DW$T$392)
	.dwattr $C$DW$T$1154, DW_AT_address_class(0x20)

$C$DW$T$323	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$323, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$323, DW_AT_byte_size(0x2c)
$C$DW$1562	.dwtag  DW_TAG_member
	.dwattr $C$DW$1562, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1562, DW_AT_name("name")
	.dwattr $C$DW$1562, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1562, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1562, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1562, DW_AT_decl_column(0x14)
$C$DW$1563	.dwtag  DW_TAG_member
	.dwattr $C$DW$1563, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1563, DW_AT_name("eventNo")
	.dwattr $C$DW$1563, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1563, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1563, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1563, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1563, DW_AT_decl_column(0x14)
$C$DW$1564	.dwtag  DW_TAG_member
	.dwattr $C$DW$1564, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1564, DW_AT_name("openFlag")
	.dwattr $C$DW$1564, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1564, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1564, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1564, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1564, DW_AT_decl_column(0x14)
$C$DW$1565	.dwtag  DW_TAG_member
	.dwattr $C$DW$1565, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1565, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1565, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1565, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1565, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1565, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1565, DW_AT_decl_column(0x14)
$C$DW$1566	.dwtag  DW_TAG_member
	.dwattr $C$DW$1566, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1566, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1566, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1566, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1566, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1566, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1566, DW_AT_decl_column(0x14)
$C$DW$1567	.dwtag  DW_TAG_member
	.dwattr $C$DW$1567, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1567, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1567, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1567, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1567, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1567, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1567, DW_AT_decl_column(0x14)
$C$DW$1568	.dwtag  DW_TAG_member
	.dwattr $C$DW$1568, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1568, DW_AT_name("gate")
	.dwattr $C$DW$1568, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1568, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1568, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1568, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1568, DW_AT_decl_column(0x14)
$C$DW$1569	.dwtag  DW_TAG_member
	.dwattr $C$DW$1569, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1569, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1569, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1569, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1569, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1569, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1569, DW_AT_decl_column(0x14)
$C$DW$1570	.dwtag  DW_TAG_member
	.dwattr $C$DW$1570, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1570, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1570, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1570, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1570, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1570, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1570, DW_AT_decl_column(0x14)
$C$DW$1571	.dwtag  DW_TAG_member
	.dwattr $C$DW$1571, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1571, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1571, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1571, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1571, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1571, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1571, DW_AT_decl_column(0x14)
$C$DW$1572	.dwtag  DW_TAG_member
	.dwattr $C$DW$1572, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1572, DW_AT_name("regionId")
	.dwattr $C$DW$1572, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1572, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1572, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1572, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1572, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$323

	.dwattr $C$DW$T$323, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$323, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$323, DW_AT_decl_column(0x10)
$C$DW$T$1151	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1151, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$T$1151, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1151, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1151, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1151, DW_AT_decl_column(0x03)
$C$DW$T$1158	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1158, DW_AT_type(*$C$DW$T$1151)
$C$DW$T$1159	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1159, DW_AT_type(*$C$DW$T$1158)
	.dwattr $C$DW$T$1159, DW_AT_address_class(0x20)
$C$DW$T$1152	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1152, DW_AT_type(*$C$DW$T$1151)
	.dwattr $C$DW$T$1152, DW_AT_address_class(0x20)

$C$DW$T$327	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$327, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$327, DW_AT_byte_size(0x1c)
$C$DW$1573	.dwtag  DW_TAG_member
	.dwattr $C$DW$1573, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1573, DW_AT_name("clientHandle")
	.dwattr $C$DW$1573, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1573, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1573, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1573, DW_AT_decl_column(0x12)
$C$DW$1574	.dwtag  DW_TAG_member
	.dwattr $C$DW$1574, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$1574, DW_AT_name("procId")
	.dwattr $C$DW$1574, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1574, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1574, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1574, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1574, DW_AT_decl_column(0x12)
$C$DW$1575	.dwtag  DW_TAG_member
	.dwattr $C$DW$1575, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1575, DW_AT_name("notifyType")
	.dwattr $C$DW$1575, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1575, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1575, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1575, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1575, DW_AT_decl_column(0x12)
$C$DW$1576	.dwtag  DW_TAG_member
	.dwattr $C$DW$1576, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1576, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1576, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1576, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1576, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1576, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1576, DW_AT_decl_column(0x1d)
$C$DW$1577	.dwtag  DW_TAG_member
	.dwattr $C$DW$1577, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1577, DW_AT_name("cbContext")
	.dwattr $C$DW$1577, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1577, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1577, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1577, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1577, DW_AT_decl_column(0x12)
$C$DW$1578	.dwtag  DW_TAG_member
	.dwattr $C$DW$1578, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1578, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1578, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1578, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1578, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1578, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1578, DW_AT_decl_column(0x12)
$C$DW$1579	.dwtag  DW_TAG_member
	.dwattr $C$DW$1579, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1579, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1579, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1579, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1579, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1579, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1579, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$327

	.dwattr $C$DW$T$327, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$327, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$327, DW_AT_decl_column(0x10)
$C$DW$T$1161	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1161, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$T$1161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1161, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1161, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1161, DW_AT_decl_column(0x03)
$C$DW$T$1162	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1162, DW_AT_type(*$C$DW$T$1161)
	.dwattr $C$DW$T$1162, DW_AT_address_class(0x20)

$C$DW$T$482	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$482, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$482, DW_AT_byte_size(0x01)
$C$DW$1580	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1580, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1580, DW_AT_decl_line(0x162)
	.dwattr $C$DW$1580, DW_AT_decl_column(0x05)
$C$DW$1581	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1581, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1581, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1581, DW_AT_decl_column(0x05)
$C$DW$1582	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1582, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1582, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$1582, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$482

	.dwattr $C$DW$T$482, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$482, DW_AT_decl_line(0x161)
	.dwattr $C$DW$T$482, DW_AT_decl_column(0x0e)
$C$DW$T$483	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$483, DW_AT_type(*$C$DW$T$482)
	.dwattr $C$DW$T$483, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$483, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$483, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$T$483, DW_AT_decl_column(0x02)
$C$DW$T$1165	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1165, DW_AT_type(*$C$DW$T$483)

$C$DW$T$333	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$333, DW_AT_name("FrameQBufMgr_Attrs_Tag")
	.dwattr $C$DW$T$333, DW_AT_byte_size(0x48)
$C$DW$1583	.dwtag  DW_TAG_member
	.dwattr $C$DW$1583, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1583, DW_AT_name("status")
	.dwattr $C$DW$1583, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$1583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1583, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1583, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1583, DW_AT_decl_column(0x1a)
$C$DW$1584	.dwtag  DW_TAG_member
	.dwattr $C$DW$1584, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1584, DW_AT_name("version")
	.dwattr $C$DW$1584, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1584, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1584, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1584, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1584, DW_AT_decl_column(0x1a)
$C$DW$1585	.dwtag  DW_TAG_member
	.dwattr $C$DW$1585, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1585, DW_AT_name("localProtect")
	.dwattr $C$DW$1585, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1585, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1585, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1585, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$1585, DW_AT_decl_column(0x1a)
$C$DW$1586	.dwtag  DW_TAG_member
	.dwattr $C$DW$1586, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1586, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1586, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1586, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1586, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1586, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1586, DW_AT_decl_column(0x1a)
$C$DW$1587	.dwtag  DW_TAG_member
	.dwattr $C$DW$1587, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1587, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$1587, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$1587, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1587, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1587, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1587, DW_AT_decl_column(0x1a)
$C$DW$1588	.dwtag  DW_TAG_member
	.dwattr $C$DW$1588, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1588, DW_AT_name("name")
	.dwattr $C$DW$1588, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1588, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1588, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1588, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1588, DW_AT_decl_column(0x1a)
$C$DW$1589	.dwtag  DW_TAG_member
	.dwattr $C$DW$1589, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1589, DW_AT_name("sharedDataBufAddr")
	.dwattr $C$DW$1589, DW_AT_TI_symbol_name("sharedDataBufAddr")
	.dwattr $C$DW$1589, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1589, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1589, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1589, DW_AT_decl_column(0x17)
$C$DW$1590	.dwtag  DW_TAG_member
	.dwattr $C$DW$1590, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1590, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1590, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1590, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1590, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1590, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1590, DW_AT_decl_column(0x18)
$C$DW$1591	.dwtag  DW_TAG_member
	.dwattr $C$DW$1591, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1591, DW_AT_name("numFreeFramePools")
	.dwattr $C$DW$1591, DW_AT_TI_symbol_name("numFreeFramePools")
	.dwattr $C$DW$1591, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1591, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1591, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1591, DW_AT_decl_column(0x17)
$C$DW$1592	.dwtag  DW_TAG_member
	.dwattr $C$DW$1592, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1592, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1592, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1592, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1592, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1592, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1592, DW_AT_decl_column(0x1a)
$C$DW$1593	.dwtag  DW_TAG_member
	.dwattr $C$DW$1593, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1593, DW_AT_name("entryId")
	.dwattr $C$DW$1593, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$1593, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1593, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1593, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1593, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$333

	.dwattr $C$DW$T$333, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x10)
$C$DW$T$382	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Attrs")
	.dwattr $C$DW$T$382, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$T$382, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$382, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$382, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$382, DW_AT_decl_column(0x03)
$C$DW$T$383	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Attrs")
	.dwattr $C$DW$T$383, DW_AT_type(*$C$DW$T$382)
	.dwattr $C$DW$T$383, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$383, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$383, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$383, DW_AT_decl_column(0x27)
$C$DW$T$384	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$383)
$C$DW$T$385	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$T$385, DW_AT_address_class(0x20)
$C$DW$T$1166	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1166, DW_AT_type(*$C$DW$T$333)
$C$DW$T$1167	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1167, DW_AT_type(*$C$DW$T$1166)
	.dwattr $C$DW$T$1167, DW_AT_address_class(0x20)

$C$DW$T$484	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$484, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$484, DW_AT_byte_size(0x01)
$C$DW$1594	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1594, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1594, DW_AT_decl_line(0x156)
	.dwattr $C$DW$1594, DW_AT_decl_column(0x05)
$C$DW$1595	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1595, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1595, DW_AT_decl_line(0x158)
	.dwattr $C$DW$1595, DW_AT_decl_column(0x05)
$C$DW$1596	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1596, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1596, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$1596, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$484

	.dwattr $C$DW$T$484, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$484, DW_AT_decl_line(0x155)
	.dwattr $C$DW$T$484, DW_AT_decl_column(0x0e)
$C$DW$T$485	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$485, DW_AT_type(*$C$DW$T$484)
	.dwattr $C$DW$T$485, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$485, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$485, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$T$485, DW_AT_decl_column(0x02)

$C$DW$T$334	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$334, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$334, DW_AT_byte_size(0x0c)
$C$DW$1597	.dwtag  DW_TAG_member
	.dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1597, DW_AT_name("name")
	.dwattr $C$DW$1597, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1597, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1597, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$1597, DW_AT_decl_column(0x11)
$C$DW$1598	.dwtag  DW_TAG_member
	.dwattr $C$DW$1598, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1598, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$1598, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$1598, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1598, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1598, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$1598, DW_AT_decl_column(0x11)
$C$DW$1599	.dwtag  DW_TAG_member
	.dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1599, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1599, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1599, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1599, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1599, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$1599, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$334

	.dwattr $C$DW$T$334, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$334, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$T$334, DW_AT_decl_column(0x10)
$C$DW$T$364	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$364, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$364, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$T$364, DW_AT_decl_column(0x03)

$C$DW$T$335	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$335, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$335, DW_AT_byte_size(0x0c)
$C$DW$1600	.dwtag  DW_TAG_member
	.dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1600, DW_AT_name("eventNo")
	.dwattr $C$DW$1600, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1600, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1600, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$1600, DW_AT_decl_column(0x0c)
$C$DW$1601	.dwtag  DW_TAG_member
	.dwattr $C$DW$1601, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1601, DW_AT_name("maxInstances")
	.dwattr $C$DW$1601, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$1601, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1601, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1601, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1601, DW_AT_decl_column(0x0c)
$C$DW$1602	.dwtag  DW_TAG_member
	.dwattr $C$DW$1602, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1602, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$1602, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$1602, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1602, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1602, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1602, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$335

	.dwattr $C$DW$T$335, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x10)
$C$DW$T$374	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$374, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$374, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$T$374, DW_AT_decl_column(0x03)
$C$DW$T$1169	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Config")
	.dwattr $C$DW$T$1169, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$T$1169, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1169, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1169, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$1169, DW_AT_decl_column(0x27)
$C$DW$T$1170	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1170, DW_AT_type(*$C$DW$T$1169)
	.dwattr $C$DW$T$1170, DW_AT_address_class(0x20)
$C$DW$T$1171	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1171, DW_AT_type(*$C$DW$T$1170)
$C$DW$T$1172	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1172, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$T$1172, DW_AT_address_class(0x20)

$C$DW$T$1175	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1175, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$1175, DW_AT_byte_size(0x04)
$C$DW$1603	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1603, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1603, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1603, DW_AT_decl_column(0x09)
$C$DW$1604	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1604, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1604, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1604, DW_AT_decl_column(0x09)
$C$DW$1605	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1605, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1605, DW_AT_decl_line(0x138)
	.dwattr $C$DW$1605, DW_AT_decl_column(0x09)
$C$DW$1606	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$1606, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1606, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$1606, DW_AT_decl_column(0x09)
$C$DW$1607	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$1607, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1607, DW_AT_decl_line(0x140)
	.dwattr $C$DW$1607, DW_AT_decl_column(0x09)
$C$DW$1608	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$1608, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1608, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1608, DW_AT_decl_column(0x09)
$C$DW$1609	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$1609, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1609, DW_AT_decl_line(0x148)
	.dwattr $C$DW$1609, DW_AT_decl_column(0x09)
$C$DW$1610	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$1610, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1610, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$1610, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$1175

	.dwattr $C$DW$T$1175, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1175, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$T$1175, DW_AT_decl_column(0x0e)
$C$DW$T$1176	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$1176, DW_AT_type(*$C$DW$T$1175)
	.dwattr $C$DW$T$1176, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1176, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1176, DW_AT_decl_line(0x150)
	.dwattr $C$DW$T$1176, DW_AT_decl_column(0x03)

$C$DW$T$338	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$338, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$338, DW_AT_byte_size(0x10)
$C$DW$1611	.dwtag  DW_TAG_member
	.dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1611, DW_AT_name("size")
	.dwattr $C$DW$1611, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1611, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1611, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$1611, DW_AT_decl_column(0x0c)
$C$DW$1612	.dwtag  DW_TAG_member
	.dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$1612, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1612, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1612, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1612, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$1612, DW_AT_decl_column(0x1c)
$C$DW$1613	.dwtag  DW_TAG_member
	.dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1613, DW_AT_name("name")
	.dwattr $C$DW$1613, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1613, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1613, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$1613, DW_AT_decl_column(0x0c)
$C$DW$1614	.dwtag  DW_TAG_member
	.dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1614, DW_AT_name("openFlag")
	.dwattr $C$DW$1614, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1614, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1614, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1614, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$338

	.dwattr $C$DW$T$338, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x10)
$C$DW$T$366	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$366, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$T$366, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$366, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$366, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$366, DW_AT_decl_column(0x03)

$C$DW$T$339	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$339, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$339, DW_AT_byte_size(0x14)
$C$DW$1615	.dwtag  DW_TAG_member
	.dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1615, DW_AT_name("size")
	.dwattr $C$DW$1615, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1615, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1615, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$1615, DW_AT_decl_column(0x0c)
$C$DW$1616	.dwtag  DW_TAG_member
	.dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1616, DW_AT_name("pixelFormat")
	.dwattr $C$DW$1616, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1616, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1616, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$1616, DW_AT_decl_column(0x0c)
$C$DW$1617	.dwtag  DW_TAG_member
	.dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1617, DW_AT_name("height")
	.dwattr $C$DW$1617, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1617, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1617, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1617, DW_AT_decl_column(0x0c)
$C$DW$1618	.dwtag  DW_TAG_member
	.dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1618, DW_AT_name("width")
	.dwattr $C$DW$1618, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1618, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1618, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1618, DW_AT_decl_column(0x0c)
$C$DW$1619	.dwtag  DW_TAG_member
	.dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1619, DW_AT_name("align")
	.dwattr $C$DW$1619, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1619, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1619, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$1619, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$339

	.dwattr $C$DW$T$339, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x10)
$C$DW$T$409	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$409, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$T$409, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$409, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$409, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$T$409, DW_AT_decl_column(0x02)
$C$DW$T$410	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$410, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$T$410, DW_AT_address_class(0x20)

$C$DW$T$411	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$411, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$T$411, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$411, DW_AT_byte_size(0x100)
$C$DW$1620	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1620, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$411

$C$DW$T$1178	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1178, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$T$1178, DW_AT_address_class(0x20)
$C$DW$T$1179	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1179, DW_AT_type(*$C$DW$T$1178)
$C$DW$T$1180	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1180, DW_AT_type(*$C$DW$T$1179)
	.dwattr $C$DW$T$1180, DW_AT_address_class(0x20)

$C$DW$T$1182	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1182, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$1182, DW_AT_byte_size(0x01)
$C$DW$1621	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1621, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1621, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$1621, DW_AT_decl_column(0x05)
$C$DW$1622	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1622, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1622, DW_AT_decl_line(0x190)
	.dwattr $C$DW$1622, DW_AT_decl_column(0x05)
$C$DW$1623	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1623, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1623, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1623, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1182

	.dwattr $C$DW$T$1182, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1182, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$1182, DW_AT_decl_column(0x0e)
$C$DW$T$1183	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$1183, DW_AT_type(*$C$DW$T$1182)
	.dwattr $C$DW$T$1183, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1183, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1183, DW_AT_decl_line(0x194)
	.dwattr $C$DW$T$1183, DW_AT_decl_column(0x03)

$C$DW$T$1184	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1184, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$1184, DW_AT_byte_size(0x01)
$C$DW$1624	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1624, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1624, DW_AT_decl_line(0x180)
	.dwattr $C$DW$1624, DW_AT_decl_column(0x05)
$C$DW$1625	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1625, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1625, DW_AT_decl_line(0x184)
	.dwattr $C$DW$1625, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1184

	.dwattr $C$DW$T$1184, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1184, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$1184, DW_AT_decl_column(0x0e)
$C$DW$T$1185	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$1185, DW_AT_type(*$C$DW$T$1184)
	.dwattr $C$DW$T$1185, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1185, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1185, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$1185, DW_AT_decl_column(0x03)

$C$DW$T$354	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$354, DW_AT_name("FrameQBufMgr_FreeFramePoolObj_Tag")
	.dwattr $C$DW$T$354, DW_AT_byte_size(0x2b4)
$C$DW$1626	.dwtag  DW_TAG_member
	.dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1626, DW_AT_name("numFrms")
	.dwattr $C$DW$1626, DW_AT_TI_symbol_name("numFrms")
	.dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1626, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1626, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1626, DW_AT_decl_column(0x15)
$C$DW$1627	.dwtag  DW_TAG_member
	.dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1627, DW_AT_name("freeFrms")
	.dwattr $C$DW$1627, DW_AT_TI_symbol_name("freeFrms")
	.dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1627, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1627, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1627, DW_AT_decl_column(0x15)
$C$DW$1628	.dwtag  DW_TAG_member
	.dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1628, DW_AT_name("numFrmHdrBufs")
	.dwattr $C$DW$1628, DW_AT_TI_symbol_name("numFrmHdrBufs")
	.dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1628, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1628, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1628, DW_AT_decl_column(0x15)
$C$DW$1629	.dwtag  DW_TAG_member
	.dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1629, DW_AT_name("freeFrmHdrBufs")
	.dwattr $C$DW$1629, DW_AT_TI_symbol_name("freeFrmHdrBufs")
	.dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1629, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1629, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1629, DW_AT_decl_column(0x15)
$C$DW$1630	.dwtag  DW_TAG_member
	.dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1630, DW_AT_name("frmHdrBufSize")
	.dwattr $C$DW$1630, DW_AT_TI_symbol_name("frmHdrBufSize")
	.dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1630, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1630, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1630, DW_AT_decl_column(0x15)
$C$DW$1631	.dwtag  DW_TAG_member
	.dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1631, DW_AT_name("numBufsInFrame")
	.dwattr $C$DW$1631, DW_AT_TI_symbol_name("numBufsInFrame")
	.dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1631, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1631, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1631, DW_AT_decl_column(0x15)
$C$DW$1632	.dwtag  DW_TAG_member
	.dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1632, DW_AT_name("numDynamicHdrBufs")
	.dwattr $C$DW$1632, DW_AT_TI_symbol_name("numDynamicHdrBufs")
	.dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1632, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1632, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1632, DW_AT_decl_column(0x15)
$C$DW$1633	.dwtag  DW_TAG_member
	.dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1633, DW_AT_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1633, DW_AT_TI_symbol_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1633, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1633, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1633, DW_AT_decl_column(0x15)
$C$DW$1634	.dwtag  DW_TAG_member
	.dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1634, DW_AT_name("numDynamicFrames")
	.dwattr $C$DW$1634, DW_AT_TI_symbol_name("numDynamicFrames")
	.dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1634, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1634, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1634, DW_AT_decl_column(0x15)
$C$DW$1635	.dwtag  DW_TAG_member
	.dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1635, DW_AT_name("freeDynamicFrames")
	.dwattr $C$DW$1635, DW_AT_TI_symbol_name("freeDynamicFrames")
	.dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1635, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1635, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1635, DW_AT_decl_column(0x15)
$C$DW$1636	.dwtag  DW_TAG_member
	.dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1636, DW_AT_name("frmStartAddrp")
	.dwattr $C$DW$1636, DW_AT_TI_symbol_name("frmStartAddrp")
	.dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1636, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1636, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1636, DW_AT_decl_column(0x15)
$C$DW$1637	.dwtag  DW_TAG_member
	.dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1637, DW_AT_name("frmEndAddrp")
	.dwattr $C$DW$1637, DW_AT_TI_symbol_name("frmEndAddrp")
	.dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1637, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1637, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1637, DW_AT_decl_column(0x15)
$C$DW$1638	.dwtag  DW_TAG_member
	.dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1638, DW_AT_name("hdrBufStartAddrp")
	.dwattr $C$DW$1638, DW_AT_TI_symbol_name("hdrBufStartAddrp")
	.dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1638, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1638, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$1638, DW_AT_decl_column(0x15)
$C$DW$1639	.dwtag  DW_TAG_member
	.dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1639, DW_AT_name("hdrBufEndAddrp")
	.dwattr $C$DW$1639, DW_AT_TI_symbol_name("hdrBufEndAddrp")
	.dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1639, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1639, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1639, DW_AT_decl_column(0x15)
$C$DW$1640	.dwtag  DW_TAG_member
	.dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1640, DW_AT_name("frmBufsStartAddrp")
	.dwattr $C$DW$1640, DW_AT_TI_symbol_name("frmBufsStartAddrp")
	.dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1640, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1640, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1640, DW_AT_decl_column(0x15)
$C$DW$1641	.dwtag  DW_TAG_member
	.dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1641, DW_AT_name("frmBufsEndAddrp")
	.dwattr $C$DW$1641, DW_AT_TI_symbol_name("frmBufsEndAddrp")
	.dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1641, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1641, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1641, DW_AT_decl_column(0x15)
$C$DW$1642	.dwtag  DW_TAG_member
	.dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$1642, DW_AT_name("frmBufSize")
	.dwattr $C$DW$1642, DW_AT_TI_symbol_name("frmBufSize")
	.dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1642, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1642, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1642, DW_AT_decl_column(0x15)
$C$DW$1643	.dwtag  DW_TAG_member
	.dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$1643, DW_AT_name("frmRefCnt")
	.dwattr $C$DW$1643, DW_AT_TI_symbol_name("frmRefCnt")
	.dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1643, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1643, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1643, DW_AT_decl_column(0x15)
$C$DW$1644	.dwtag  DW_TAG_member
	.dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1644, DW_AT_name("dynFrame")
	.dwattr $C$DW$1644, DW_AT_TI_symbol_name("dynFrame")
	.dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1644, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1644, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1644, DW_AT_decl_column(0x15)
$C$DW$1645	.dwtag  DW_TAG_member
	.dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1645, DW_AT_name("dynFrmRefCnt")
	.dwattr $C$DW$1645, DW_AT_TI_symbol_name("dynFrmRefCnt")
	.dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1645, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1645, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1645, DW_AT_decl_column(0x15)
$C$DW$1646	.dwtag  DW_TAG_member
	.dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1646, DW_AT_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1646, DW_AT_TI_symbol_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1646, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1646, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1646, DW_AT_decl_column(0x15)
$C$DW$1647	.dwtag  DW_TAG_member
	.dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1647, DW_AT_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1647, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1647, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1647, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1647, DW_AT_decl_column(0x15)
$C$DW$1648	.dwtag  DW_TAG_member
	.dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1648, DW_AT_name("dynHdrBufs")
	.dwattr $C$DW$1648, DW_AT_TI_symbol_name("dynHdrBufs")
	.dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1648, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1648, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1648, DW_AT_decl_column(0x15)
$C$DW$1649	.dwtag  DW_TAG_member
	.dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$1649, DW_AT_name("hdrBufIsUsed")
	.dwattr $C$DW$1649, DW_AT_TI_symbol_name("hdrBufIsUsed")
	.dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1649, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1649, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1649, DW_AT_decl_column(0x15)
$C$DW$1650	.dwtag  DW_TAG_member
	.dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1650, DW_AT_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1650, DW_AT_TI_symbol_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1650, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1650, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1650, DW_AT_decl_column(0x15)
$C$DW$1651	.dwtag  DW_TAG_member
	.dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$1651, DW_AT_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1651, DW_AT_TI_symbol_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1651, DW_AT_data_member_location[DW_OP_plus_uconst 0x272]
	.dwattr $C$DW$1651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1651, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1651, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1651, DW_AT_decl_column(0x15)
$C$DW$1652	.dwtag  DW_TAG_member
	.dwattr $C$DW$1652, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1652, DW_AT_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1652, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1652, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b2]
	.dwattr $C$DW$1652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1652, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1652, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1652, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$354

	.dwattr $C$DW$T$354, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x10)
$C$DW$T$386	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FreeFramePoolObj")
	.dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$386, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$386, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$386, DW_AT_decl_column(0x03)
$C$DW$T$387	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_FreeFramePoolObj")
	.dwattr $C$DW$T$387, DW_AT_type(*$C$DW$T$386)
	.dwattr $C$DW$T$387, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$387, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$387, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$387, DW_AT_decl_column(0x27)
$C$DW$T$388	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$388, DW_AT_type(*$C$DW$T$387)
$C$DW$T$389	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$389, DW_AT_type(*$C$DW$T$388)
	.dwattr $C$DW$T$389, DW_AT_address_class(0x20)
$C$DW$T$390	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$390, DW_AT_type(*$C$DW$T$389)
	.dwattr $C$DW$T$390, DW_AT_address_class(0x20)
$C$DW$T$1186	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1186, DW_AT_type(*$C$DW$T$387)
	.dwattr $C$DW$T$1186, DW_AT_address_class(0x20)
$C$DW$T$1187	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1187, DW_AT_type(*$C$DW$T$354)
$C$DW$T$1188	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1188, DW_AT_type(*$C$DW$T$1187)
	.dwattr $C$DW$T$1188, DW_AT_address_class(0x20)
$C$DW$T$1189	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1189, DW_AT_type(*$C$DW$T$1188)
	.dwattr $C$DW$T$1189, DW_AT_address_class(0x20)

$C$DW$T$336	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$336, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$336, DW_AT_byte_size(0x01)
$C$DW$1653	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1653, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1653, DW_AT_decl_line(0x174)
	.dwattr $C$DW$1653, DW_AT_decl_column(0x05)
$C$DW$1654	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1654, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1654, DW_AT_decl_line(0x178)
	.dwattr $C$DW$1654, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$336

	.dwattr $C$DW$T$336, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$336, DW_AT_decl_line(0x173)
	.dwattr $C$DW$T$336, DW_AT_decl_column(0x0e)
$C$DW$T$337	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$337, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0x179)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x03)

$C$DW$T$355	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$355, DW_AT_name("FrameQBufMgr_NameServerEntry_tag")
	.dwattr $C$DW$T$355, DW_AT_byte_size(0x20)
$C$DW$1655	.dwtag  DW_TAG_member
	.dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1655, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1655, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1655, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1655, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1655, DW_AT_decl_column(0x0f)
$C$DW$1656	.dwtag  DW_TAG_member
	.dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1656, DW_AT_name("headerInterfaceType")
	.dwattr $C$DW$1656, DW_AT_TI_symbol_name("headerInterfaceType")
	.dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1656, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1656, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1656, DW_AT_decl_column(0x0f)
$C$DW$1657	.dwtag  DW_TAG_member
	.dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1657, DW_AT_name("bufInterfaceType")
	.dwattr $C$DW$1657, DW_AT_TI_symbol_name("bufInterfaceType")
	.dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1657, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1657, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1657, DW_AT_decl_column(0x0f)
$C$DW$1658	.dwtag  DW_TAG_member
	.dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1658, DW_AT_name("instParams")
	.dwattr $C$DW$1658, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1658, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1658, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1658, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$355

	.dwattr $C$DW$T$355, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$355, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$355, DW_AT_decl_column(0x10)
$C$DW$T$1192	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NameServerEntry")
	.dwattr $C$DW$T$1192, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$T$1192, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1192, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1192, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1192, DW_AT_decl_column(0x02)
$C$DW$T$1193	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1193, DW_AT_type(*$C$DW$T$1192)
	.dwattr $C$DW$T$1193, DW_AT_address_class(0x20)

$C$DW$T$363	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$363, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$363, DW_AT_byte_size(0x14)
$C$DW$1659	.dwtag  DW_TAG_member
	.dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1659, DW_AT_name("notifyType")
	.dwattr $C$DW$1659, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1659, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1659, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$1659, DW_AT_decl_column(0x1d)
$C$DW$1660	.dwtag  DW_TAG_member
	.dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1660, DW_AT_name("watermark")
	.dwattr $C$DW$1660, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1660, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1660, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$1660, DW_AT_decl_column(0x1d)
$C$DW$1661	.dwtag  DW_TAG_member
	.dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$1661, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$1661, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1661, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1661, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$1661, DW_AT_decl_column(0x1d)
$C$DW$1662	.dwtag  DW_TAG_member
	.dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1662, DW_AT_name("cbContext")
	.dwattr $C$DW$1662, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1662, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1662, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$1662, DW_AT_decl_column(0x1d)
$C$DW$1663	.dwtag  DW_TAG_member
	.dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1663, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$1663, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1663, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1663, DW_AT_decl_line(0x201)
	.dwattr $C$DW$1663, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$363

	.dwattr $C$DW$T$363, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$363, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$T$363, DW_AT_decl_column(0x10)
$C$DW$T$464	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$464, DW_AT_type(*$C$DW$T$363)
	.dwattr $C$DW$T$464, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$464, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$464, DW_AT_decl_line(0x204)
	.dwattr $C$DW$T$464, DW_AT_decl_column(0x03)
$C$DW$T$1195	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_NotifyParams")
	.dwattr $C$DW$T$1195, DW_AT_type(*$C$DW$T$464)
	.dwattr $C$DW$T$1195, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1195, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1195, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1195, DW_AT_decl_column(0x27)
$C$DW$T$1196	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1196, DW_AT_type(*$C$DW$T$1195)
	.dwattr $C$DW$T$1196, DW_AT_address_class(0x20)
$C$DW$T$1197	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1197, DW_AT_type(*$C$DW$T$1196)
$C$DW$T$465	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$465, DW_AT_type(*$C$DW$T$464)
	.dwattr $C$DW$T$465, DW_AT_address_class(0x20)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("FrameQBufMgr_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$358	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$358, DW_AT_address_class(0x20)
$C$DW$T$359	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Handle")
	.dwattr $C$DW$T$359, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$T$359, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$359, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$359, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$T$359, DW_AT_decl_column(0x25)

$C$DW$T$365	.dwtag  DW_TAG_structure_type
