;******************************************************************************
;* TMS470 C/C++ Codegen                                           Unix v4.9.5 *
;* Date/Time created: Wed Apr  3 11:43:25 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=2 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("shMem/FrameQ_ShMem.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS470 C/C++ Codegen Unix v4.9.5 Copyright (c) 1996-2012 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/sksung/work/udx/ch2/ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/cgt470_4_9_5/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)
$C$DW$3	.dwtag  DW_TAG_formal_parameter

	.dwattr $C$DW$1621, DW_AT_decl_column(0x05)
$C$DW$1622	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1622, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1622, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1622, DW_AT_decl_column(0x05)
$C$DW$1623	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1623, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1623, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1623, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1183

	.dwattr $C$DW$T$1183, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1183, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1183, DW_AT_decl_column(0x0e)
$C$DW$T$1184	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1184, DW_AT_type(*$C$DW$T$1183)
	.dwattr $C$DW$T$1184, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1184, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1184, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1184, DW_AT_decl_column(0x03)

$C$DW$T$1185	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1185, DW_AT_byte_size(0x04)
$C$DW$1624	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1624, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1624, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1624, DW_AT_decl_column(0x05)
$C$DW$1625	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1625, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1625, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1625, DW_AT_decl_column(0x05)
$C$DW$1626	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$1626, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1626, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1626, DW_AT_decl_column(0x05)
$C$DW$1627	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1627, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1627, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1627, DW_AT_decl_column(0x05)
$C$DW$1628	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$1628, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1628, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1628, DW_AT_decl_column(0x05)
$C$DW$1629	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$1629, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1629, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1629, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1185

	.dwattr $C$DW$T$1185, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1185, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1185, DW_AT_decl_column(0x0e)
$C$DW$T$1186	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1186, DW_AT_type(*$C$DW$T$1185)
	.dwattr $C$DW$T$1186, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1186, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1186, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1186, DW_AT_decl_column(0x03)

$C$DW$T$1187	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1187, DW_AT_byte_size(0x01)
$C$DW$1630	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1630, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1630, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1630, DW_AT_decl_column(0x05)
$C$DW$1631	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1631, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1631, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1631, DW_AT_decl_column(0x05)
$C$DW$1632	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1632, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1632, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1632, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1187

	.dwattr $C$DW$T$1187, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1187, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1187, DW_AT_decl_column(0x0e)
$C$DW$T$1188	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1188, DW_AT_type(*$C$DW$T$1187)
	.dwattr $C$DW$T$1188, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1188, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1188, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1188, DW_AT_decl_column(0x03)

$C$DW$T$288	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$288, DW_AT_byte_size(0x08)
$C$DW$1633	.dwtag  DW_TAG_member
	.dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1633, DW_AT_name("length")
	.dwattr $C$DW$1633, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1633, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1633, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1633, DW_AT_decl_column(0x16)
$C$DW$1634	.dwtag  DW_TAG_member
	.dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$1634, DW_AT_name("elem")
	.dwattr $C$DW$1634, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1634, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1634, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1634, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$288

	.dwattr $C$DW$T$288, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$288, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$288, DW_AT_decl_column(0x10)
$C$DW$T$1189	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1189, DW_AT_type(*$C$DW$T$288)
	.dwattr $C$DW$T$1189, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1189, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1189, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1189, DW_AT_decl_column(0x43)
$C$DW$T$1190	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1190, DW_AT_type(*$C$DW$T$1189)
	.dwattr $C$DW$T$1190, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1190, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1190, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1190, DW_AT_decl_column(0x30)
$C$DW$T$1191	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1191, DW_AT_type(*$C$DW$T$1190)
	.dwattr $C$DW$T$1191, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1191, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1191, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1191, DW_AT_decl_column(0x2c)

$C$DW$T$289	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$289, DW_AT_byte_size(0x08)
$C$DW$1635	.dwtag  DW_TAG_member
	.dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1635, DW_AT_name("length")
	.dwattr $C$DW$1635, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1635, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1635, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1635, DW_AT_decl_column(0x16)
$C$DW$1636	.dwtag  DW_TAG_member
	.dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$1636, DW_AT_name("elem")
	.dwattr $C$DW$1636, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1636, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1636, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1636, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$289

	.dwattr $C$DW$T$289, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$289, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$289, DW_AT_decl_column(0x10)
$C$DW$T$1192	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1192, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$T$1192, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1192, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1192, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1192, DW_AT_decl_column(0x43)
$C$DW$T$1193	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1193, DW_AT_type(*$C$DW$T$1192)
	.dwattr $C$DW$T$1193, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1193, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1193, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1193, DW_AT_decl_column(0x2f)
$C$DW$T$1194	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1194, DW_AT_type(*$C$DW$T$1193)
	.dwattr $C$DW$T$1194, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1194, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1194, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1194, DW_AT_decl_column(0x2b)

$C$DW$T$292	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$292, DW_AT_byte_size(0x08)
$C$DW$1637	.dwtag  DW_TAG_member
	.dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1637, DW_AT_name("length")
	.dwattr $C$DW$1637, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1637, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1637, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1637, DW_AT_decl_column(0x16)
$C$DW$1638	.dwtag  DW_TAG_member
	.dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$1638, DW_AT_name("elem")
	.dwattr $C$DW$1638, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1638, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1638, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1638, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$292

	.dwattr $C$DW$T$292, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$292, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$292, DW_AT_decl_column(0x10)
$C$DW$T$1195	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1195, DW_AT_type(*$C$DW$T$292)
	.dwattr $C$DW$T$1195, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1195, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1195, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$1195, DW_AT_decl_column(0x42)
$C$DW$T$1196	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1196, DW_AT_type(*$C$DW$T$1195)
	.dwattr $C$DW$T$1196, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1196, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1196, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$1196, DW_AT_decl_column(0x2b)
$C$DW$T$1197	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1197, DW_AT_type(*$C$DW$T$1196)
	.dwattr $C$DW$T$1197, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1197, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1197, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$1197, DW_AT_decl_column(0x27)

$C$DW$T$295	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$295, DW_AT_byte_size(0x08)
$C$DW$1639	.dwtag  DW_TAG_member
	.dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1639, DW_AT_name("length")
	.dwattr $C$DW$1639, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1639, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1639, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1639, DW_AT_decl_column(0x16)
$C$DW$1640	.dwtag  DW_TAG_member
	.dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$1640, DW_AT_name("elem")
	.dwattr $C$DW$1640, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1640, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1640, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1640, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$295

	.dwattr $C$DW$T$295, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$295, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$295, DW_AT_decl_column(0x10)
$C$DW$T$1198	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1198, DW_AT_type(*$C$DW$T$295)
	.dwattr $C$DW$T$1198, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1198, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1198, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$1198, DW_AT_decl_column(0x43)
$C$DW$T$1199	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1199, DW_AT_type(*$C$DW$T$1198)
	.dwattr $C$DW$T$1199, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1199, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1199, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$1199, DW_AT_decl_column(0x2c)
$C$DW$T$1200	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1200, DW_AT_type(*$C$DW$T$1199)
	.dwattr $C$DW$T$1200, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1200, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1200, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$1200, DW_AT_decl_column(0x28)

$C$DW$T$297	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$297, DW_AT_byte_size(0x34)
$C$DW$1641	.dwtag  DW_TAG_member
	.dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$1641, DW_AT_name("shMemParams")
	.dwattr $C$DW$1641, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1641, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$1641, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$1641, DW_AT_decl_column(0x26)
	.dwendtag $C$DW$T$297

	.dwattr $C$DW$T$297, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$297, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$T$297, DW_AT_decl_column(0x08)

$C$DW$T$299	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$299, DW_AT_byte_size(0x14)
$C$DW$1642	.dwtag  DW_TAG_member
	.dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$1642, DW_AT_name("shMemParams")
	.dwattr $C$DW$1642, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1642, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1642, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1642, DW_AT_decl_column(0x37)
	.dwendtag $C$DW$T$299

	.dwattr $C$DW$T$299, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$299, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$299, DW_AT_decl_column(0x08)

$C$DW$T$1201	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1201, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1201, DW_AT_byte_size(0x01)
$C$DW$1643	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1643, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1643, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1643, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1201

	.dwattr $C$DW$T$1201, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1201, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1201, DW_AT_decl_column(0x0e)
$C$DW$T$1202	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1202, DW_AT_type(*$C$DW$T$1201)
	.dwattr $C$DW$T$1202, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1202, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1202, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1202, DW_AT_decl_column(0x03)

$C$DW$T$308	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$308, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$308, DW_AT_byte_size(0x10)
$C$DW$1644	.dwtag  DW_TAG_member
	.dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$1644, DW_AT_name("gate")
	.dwattr $C$DW$1644, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1644, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1644, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1644, DW_AT_decl_column(0x1b)
$C$DW$1645	.dwtag  DW_TAG_member
	.dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1645, DW_AT_name("numProcessors")
	.dwattr $C$DW$1645, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1645, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1645, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1645, DW_AT_decl_column(0x0f)
$C$DW$1646	.dwtag  DW_TAG_member
	.dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1646, DW_AT_name("procIds")
	.dwattr $C$DW$1646, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1646, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1646, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1646, DW_AT_decl_column(0x0f)
$C$DW$1647	.dwtag  DW_TAG_member
	.dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1647, DW_AT_name("drvHandles")
	.dwattr $C$DW$1647, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1647, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1647, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1647, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$308

	.dwattr $C$DW$T$308, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$308, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$308, DW_AT_decl_column(0x10)
$C$DW$T$1203	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1203, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$T$1203, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1203, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1203, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1203, DW_AT_decl_column(0x03)

$C$DW$T$1204	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1204, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1204, DW_AT_byte_size(0x01)
$C$DW$1648	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1648, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1648, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1648, DW_AT_decl_column(0x05)
$C$DW$1649	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1649, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1649, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1649, DW_AT_decl_column(0x05)
$C$DW$1650	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1650, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1650, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1650, DW_AT_decl_column(0x05)
$C$DW$1651	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1651, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1651, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1651, DW_AT_decl_column(0x05)
$C$DW$1652	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1652, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1652, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1652, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1204

	.dwattr $C$DW$T$1204, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1204, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1204, DW_AT_decl_column(0x0e)
$C$DW$T$1205	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1205, DW_AT_type(*$C$DW$T$1204)
	.dwattr $C$DW$T$1205, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1205, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1205, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1205, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$1206	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1206, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1206, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1206, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1206, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1206, DW_AT_decl_column(0x27)
$C$DW$T$521	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$521, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$521, DW_AT_address_class(0x20)
$C$DW$T$522	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$522, DW_AT_type(*$C$DW$T$521)
	.dwattr $C$DW$T$522, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$522, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$522, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$522, DW_AT_decl_column(0x29)
$C$DW$T$1210	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1210, DW_AT_type(*$C$DW$T$522)
	.dwattr $C$DW$T$1210, DW_AT_address_class(0x20)

$C$DW$T$321	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$321, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$321, DW_AT_byte_size(0x2c)
$C$DW$1653	.dwtag  DW_TAG_member
	.dwattr $C$DW$1653, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1653, DW_AT_name("name")
	.dwattr $C$DW$1653, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1653, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1653, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1653, DW_AT_decl_column(0x14)
$C$DW$1654	.dwtag  DW_TAG_member
	.dwattr $C$DW$1654, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1654, DW_AT_name("eventNo")
	.dwattr $C$DW$1654, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1654, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1654, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1654, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1654, DW_AT_decl_column(0x14)
$C$DW$1655	.dwtag  DW_TAG_member
	.dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1655, DW_AT_name("openFlag")
	.dwattr $C$DW$1655, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1655, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1655, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1655, DW_AT_decl_column(0x14)
$C$DW$1656	.dwtag  DW_TAG_member
	.dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1656, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1656, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1656, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1656, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1656, DW_AT_decl_column(0x14)
$C$DW$1657	.dwtag  DW_TAG_member
	.dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1657, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1657, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1657, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1657, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1657, DW_AT_decl_column(0x14)
$C$DW$1658	.dwtag  DW_TAG_member
	.dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1658, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1658, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1658, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1658, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1658, DW_AT_decl_column(0x14)
$C$DW$1659	.dwtag  DW_TAG_member
	.dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$1659, DW_AT_name("gate")
	.dwattr $C$DW$1659, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1659, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1659, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1659, DW_AT_decl_column(0x14)
$C$DW$1660	.dwtag  DW_TAG_member
	.dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1660, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1660, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1660, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1660, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1660, DW_AT_decl_column(0x14)
$C$DW$1661	.dwtag  DW_TAG_member
	.dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1661, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1661, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1661, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1661, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1661, DW_AT_decl_column(0x14)
$C$DW$1662	.dwtag  DW_TAG_member
	.dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1662, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1662, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1662, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1662, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1662, DW_AT_decl_column(0x14)
$C$DW$1663	.dwtag  DW_TAG_member
	.dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1663, DW_AT_name("regionId")
	.dwattr $C$DW$1663, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1663, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1663, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1663, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$321

	.dwattr $C$DW$T$321, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$321, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$321, DW_AT_decl_column(0x10)
$C$DW$T$1207	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1207, DW_AT_type(*$C$DW$T$321)
	.dwattr $C$DW$T$1207, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1207, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1207, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1207, DW_AT_decl_column(0x03)
$C$DW$T$1214	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1214, DW_AT_type(*$C$DW$T$1207)
$C$DW$T$1215	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1215, DW_AT_type(*$C$DW$T$1214)
	.dwattr $C$DW$T$1215, DW_AT_address_class(0x20)
$C$DW$T$1208	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1208, DW_AT_type(*$C$DW$T$1207)
	.dwattr $C$DW$T$1208, DW_AT_address_class(0x20)

$C$DW$T$325	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$325, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$325, DW_AT_byte_size(0x1c)
$C$DW$1664	.dwtag  DW_TAG_member
	.dwattr $C$DW$1664, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1664, DW_AT_name("clientHandle")
	.dwattr $C$DW$1664, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1664, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1664, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1664, DW_AT_decl_column(0x12)
$C$DW$1665	.dwtag  DW_TAG_member
	.dwattr $C$DW$1665, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1665, DW_AT_name("procId")
	.dwattr $C$DW$1665, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1665, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1665, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1665, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1665, DW_AT_decl_column(0x12)
$C$DW$1666	.dwtag  DW_TAG_member
	.dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1666, DW_AT_name("notifyType")
	.dwattr $C$DW$1666, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1666, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1666, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1666, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1666, DW_AT_decl_column(0x12)
$C$DW$1667	.dwtag  DW_TAG_member
	.dwattr $C$DW$1667, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1667, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1667, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1667, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1667, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1667, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1667, DW_AT_decl_column(0x1d)
$C$DW$1668	.dwtag  DW_TAG_member
	.dwattr $C$DW$1668, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1668, DW_AT_name("cbContext")
	.dwattr $C$DW$1668, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1668, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1668, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1668, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1668, DW_AT_decl_column(0x12)
$C$DW$1669	.dwtag  DW_TAG_member
	.dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1669, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1669, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1669, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1669, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1669, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1669, DW_AT_decl_column(0x12)
$C$DW$1670	.dwtag  DW_TAG_member
	.dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1670, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1670, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1670, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1670, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1670, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1670, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$325

	.dwattr $C$DW$T$325, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x10)
$C$DW$T$1217	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1217, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$T$1217, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1217, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1217, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1217, DW_AT_decl_column(0x03)
$C$DW$T$1218	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1218, DW_AT_type(*$C$DW$T$1217)
	.dwattr $C$DW$T$1218, DW_AT_address_class(0x20)

$C$DW$T$436	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$436, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$436, DW_AT_byte_size(0x01)
$C$DW$1671	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1671, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1671, DW_AT_decl_line(0x162)
	.dwattr $C$DW$1671, DW_AT_decl_column(0x05)
$C$DW$1672	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1672, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1672, DW_AT_decl_line(0x166)
	.dwattr $C$DW$1672, DW_AT_decl_column(0x05)
$C$DW$1673	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1673, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1673, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$1673, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$436

	.dwattr $C$DW$T$436, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$436, DW_AT_decl_line(0x161)
	.dwattr $C$DW$T$436, DW_AT_decl_column(0x0e)
$C$DW$T$437	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$437, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$T$437, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$437, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$437, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$T$437, DW_AT_decl_column(0x02)

$C$DW$T$331	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$331, DW_AT_name("FrameQBufMgr_Attrs_Tag")
	.dwattr $C$DW$T$331, DW_AT_byte_size(0x48)
$C$DW$1674	.dwtag  DW_TAG_member
	.dwattr $C$DW$1674, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1674, DW_AT_name("status")
	.dwattr $C$DW$1674, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$1674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1674, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1674, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1674, DW_AT_decl_column(0x1a)
$C$DW$1675	.dwtag  DW_TAG_member
	.dwattr $C$DW$1675, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1675, DW_AT_name("version")
	.dwattr $C$DW$1675, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1675, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1675, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1675, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1675, DW_AT_decl_column(0x1a)
$C$DW$1676	.dwtag  DW_TAG_member
	.dwattr $C$DW$1676, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1676, DW_AT_name("localProtect")
	.dwattr $C$DW$1676, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1676, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1676, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1676, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$1676, DW_AT_decl_column(0x1a)
$C$DW$1677	.dwtag  DW_TAG_member
	.dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1677, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1677, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1677, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1677, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1677, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1677, DW_AT_decl_column(0x1a)
$C$DW$1678	.dwtag  DW_TAG_member
	.dwattr $C$DW$1678, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$1678, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$1678, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$1678, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1678, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1678, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1678, DW_AT_decl_column(0x1a)
$C$DW$1679	.dwtag  DW_TAG_member
	.dwattr $C$DW$1679, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1679, DW_AT_name("name")
	.dwattr $C$DW$1679, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1679, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1679, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1679, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1679, DW_AT_decl_column(0x1a)
$C$DW$1680	.dwtag  DW_TAG_member
	.dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$1680, DW_AT_name("sharedDataBufAddr")
	.dwattr $C$DW$1680, DW_AT_TI_symbol_name("sharedDataBufAddr")
	.dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1680, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1680, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1680, DW_AT_decl_column(0x17)
$C$DW$1681	.dwtag  DW_TAG_member
	.dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1681, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1681, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1681, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1681, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1681, DW_AT_decl_column(0x18)
$C$DW$1682	.dwtag  DW_TAG_member
	.dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1682, DW_AT_name("numFreeFramePools")
	.dwattr $C$DW$1682, DW_AT_TI_symbol_name("numFreeFramePools")
	.dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1682, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1682, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1682, DW_AT_decl_column(0x17)
$C$DW$1683	.dwtag  DW_TAG_member
	.dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1683, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1683, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1683, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1683, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1683, DW_AT_decl_column(0x1a)
$C$DW$1684	.dwtag  DW_TAG_member
	.dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1684, DW_AT_name("entryId")
	.dwattr $C$DW$1684, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1684, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1684, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1684, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$331

	.dwattr $C$DW$T$331, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$331, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$331, DW_AT_decl_column(0x10)
$C$DW$T$1220	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Attrs")
	.dwattr $C$DW$T$1220, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$T$1220, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1220, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1220, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$1220, DW_AT_decl_column(0x03)

$C$DW$T$438	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$438, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$438, DW_AT_byte_size(0x01)
$C$DW$1685	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1685, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1685, DW_AT_decl_line(0x156)
	.dwattr $C$DW$1685, DW_AT_decl_column(0x05)
$C$DW$1686	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1686, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1686, DW_AT_decl_line(0x158)
	.dwattr $C$DW$1686, DW_AT_decl_column(0x05)
$C$DW$1687	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1687, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1687, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$1687, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$438

	.dwattr $C$DW$T$438, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$438, DW_AT_decl_line(0x155)
	.dwattr $C$DW$T$438, DW_AT_decl_column(0x0e)
$C$DW$T$439	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$439, DW_AT_type(*$C$DW$T$438)
	.dwattr $C$DW$T$439, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$439, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$439, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$T$439, DW_AT_decl_column(0x02)

$C$DW$T$332	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$332, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$332, DW_AT_byte_size(0x0c)
$C$DW$1688	.dwtag  DW_TAG_member
	.dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1688, DW_AT_name("name")
	.dwattr $C$DW$1688, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1688, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1688, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$1688, DW_AT_decl_column(0x11)
$C$DW$1689	.dwtag  DW_TAG_member
	.dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1689, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$1689, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1689, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1689, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$1689, DW_AT_decl_column(0x11)
$C$DW$1690	.dwtag  DW_TAG_member
	.dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1690, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1690, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1690, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1690, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$1690, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$332

	.dwattr $C$DW$T$332, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$332, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$T$332, DW_AT_decl_column(0x10)
$C$DW$T$362	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$362, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$362, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$T$362, DW_AT_decl_column(0x03)

$C$DW$T$333	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$333, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$333, DW_AT_byte_size(0x0c)
$C$DW$1691	.dwtag  DW_TAG_member
	.dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1691, DW_AT_name("eventNo")
	.dwattr $C$DW$1691, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1691, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1691, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$1691, DW_AT_decl_column(0x0c)
$C$DW$1692	.dwtag  DW_TAG_member
	.dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1692, DW_AT_name("maxInstances")
	.dwattr $C$DW$1692, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1692, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1692, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1692, DW_AT_decl_column(0x0c)
$C$DW$1693	.dwtag  DW_TAG_member
	.dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1693, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$1693, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1693, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1693, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$1693, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$333

	.dwattr $C$DW$T$333, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x10)
$C$DW$T$1221	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$1221, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$T$1221, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1221, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1221, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$T$1221, DW_AT_decl_column(0x03)

$C$DW$T$1222	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1222, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$1222, DW_AT_byte_size(0x04)
$C$DW$1694	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1694, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1694, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1694, DW_AT_decl_column(0x09)
$C$DW$1695	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1695, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1695, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1695, DW_AT_decl_column(0x09)
$C$DW$1696	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1696, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1696, DW_AT_decl_line(0x138)
	.dwattr $C$DW$1696, DW_AT_decl_column(0x09)
$C$DW$1697	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$1697, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1697, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$1697, DW_AT_decl_column(0x09)
$C$DW$1698	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$1698, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1698, DW_AT_decl_line(0x140)
	.dwattr $C$DW$1698, DW_AT_decl_column(0x09)
$C$DW$1699	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$1699, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1699, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1699, DW_AT_decl_column(0x09)
$C$DW$1700	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$1700, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1700, DW_AT_decl_line(0x148)
	.dwattr $C$DW$1700, DW_AT_decl_column(0x09)
$C$DW$1701	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$1701, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1701, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$1701, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$1222

	.dwattr $C$DW$T$1222, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1222, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$T$1222, DW_AT_decl_column(0x0e)
$C$DW$T$1223	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$1223, DW_AT_type(*$C$DW$T$1222)
	.dwattr $C$DW$T$1223, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1223, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1223, DW_AT_decl_line(0x150)
	.dwattr $C$DW$T$1223, DW_AT_decl_column(0x03)

$C$DW$T$336	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$336, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$336, DW_AT_byte_size(0x10)
$C$DW$1702	.dwtag  DW_TAG_member
	.dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1702, DW_AT_name("size")
	.dwattr $C$DW$1702, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1702, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1702, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$1702, DW_AT_decl_column(0x0c)
$C$DW$1703	.dwtag  DW_TAG_member
	.dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$1703, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1703, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1703, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1703, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$1703, DW_AT_decl_column(0x1c)
$C$DW$1704	.dwtag  DW_TAG_member
	.dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1704, DW_AT_name("name")
	.dwattr $C$DW$1704, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1704, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1704, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$1704, DW_AT_decl_column(0x0c)
$C$DW$1705	.dwtag  DW_TAG_member
	.dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1705, DW_AT_name("openFlag")
	.dwattr $C$DW$1705, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1705, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1705, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1705, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$336

	.dwattr $C$DW$T$336, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$336, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$336, DW_AT_decl_column(0x10)
$C$DW$T$364	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$364, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$364, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$364, DW_AT_decl_column(0x03)

$C$DW$T$337	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$337, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$337, DW_AT_byte_size(0x14)
$C$DW$1706	.dwtag  DW_TAG_member
	.dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1706, DW_AT_name("size")
	.dwattr $C$DW$1706, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1706, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1706, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$1706, DW_AT_decl_column(0x0c)
$C$DW$1707	.dwtag  DW_TAG_member
	.dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1707, DW_AT_name("pixelFormat")
	.dwattr $C$DW$1707, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1707, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1707, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$1707, DW_AT_decl_column(0x0c)
$C$DW$1708	.dwtag  DW_TAG_member
	.dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1708, DW_AT_name("height")
	.dwattr $C$DW$1708, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1708, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1708, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1708, DW_AT_decl_column(0x0c)
$C$DW$1709	.dwtag  DW_TAG_member
	.dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1709, DW_AT_name("width")
	.dwattr $C$DW$1709, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1709, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1709, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1709, DW_AT_decl_column(0x0c)
$C$DW$1710	.dwtag  DW_TAG_member
	.dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1710, DW_AT_name("align")
	.dwattr $C$DW$1710, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1710, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1710, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$1710, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$337

	.dwattr $C$DW$T$337, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x10)
$C$DW$T$1224	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$1224, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$1224, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1224, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1224, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$T$1224, DW_AT_decl_column(0x02)

$C$DW$T$1225	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1225, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$1225, DW_AT_byte_size(0x01)
$C$DW$1711	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1711, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1711, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$1711, DW_AT_decl_column(0x05)
$C$DW$1712	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1712, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1712, DW_AT_decl_line(0x190)
	.dwattr $C$DW$1712, DW_AT_decl_column(0x05)
$C$DW$1713	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1713, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1713, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1713, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1225

	.dwattr $C$DW$T$1225, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1225, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$1225, DW_AT_decl_column(0x0e)
$C$DW$T$1226	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$1226, DW_AT_type(*$C$DW$T$1225)
	.dwattr $C$DW$T$1226, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1226, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1226, DW_AT_decl_line(0x194)
	.dwattr $C$DW$T$1226, DW_AT_decl_column(0x03)

$C$DW$T$1227	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1227, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$1227, DW_AT_byte_size(0x01)
$C$DW$1714	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1714, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1714, DW_AT_decl_line(0x180)
	.dwattr $C$DW$1714, DW_AT_decl_column(0x05)
$C$DW$1715	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1715, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1715, DW_AT_decl_line(0x184)
	.dwattr $C$DW$1715, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1227

	.dwattr $C$DW$T$1227, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1227, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$1227, DW_AT_decl_column(0x0e)
$C$DW$T$1228	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$1228, DW_AT_type(*$C$DW$T$1227)
	.dwattr $C$DW$T$1228, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1228, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1228, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$1228, DW_AT_decl_column(0x03)

$C$DW$T$352	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$352, DW_AT_name("FrameQBufMgr_FreeFramePoolObj_Tag")
	.dwattr $C$DW$T$352, DW_AT_byte_size(0x2b4)
$C$DW$1716	.dwtag  DW_TAG_member
	.dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1716, DW_AT_name("numFrms")
	.dwattr $C$DW$1716, DW_AT_TI_symbol_name("numFrms")
	.dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1716, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1716, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1716, DW_AT_decl_column(0x15)
$C$DW$1717	.dwtag  DW_TAG_member
	.dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1717, DW_AT_name("freeFrms")
	.dwattr $C$DW$1717, DW_AT_TI_symbol_name("freeFrms")
	.dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1717, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1717, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1717, DW_AT_decl_column(0x15)
$C$DW$1718	.dwtag  DW_TAG_member
	.dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1718, DW_AT_name("numFrmHdrBufs")
	.dwattr $C$DW$1718, DW_AT_TI_symbol_name("numFrmHdrBufs")
	.dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1718, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1718, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1718, DW_AT_decl_column(0x15)
$C$DW$1719	.dwtag  DW_TAG_member
	.dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1719, DW_AT_name("freeFrmHdrBufs")
	.dwattr $C$DW$1719, DW_AT_TI_symbol_name("freeFrmHdrBufs")
	.dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1719, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1719, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1719, DW_AT_decl_column(0x15)
$C$DW$1720	.dwtag  DW_TAG_member
	.dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1720, DW_AT_name("frmHdrBufSize")
	.dwattr $C$DW$1720, DW_AT_TI_symbol_name("frmHdrBufSize")
	.dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1720, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1720, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1720, DW_AT_decl_column(0x15)
$C$DW$1721	.dwtag  DW_TAG_member
	.dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1721, DW_AT_name("numBufsInFrame")
	.dwattr $C$DW$1721, DW_AT_TI_symbol_name("numBufsInFrame")
	.dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1721, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1721, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1721, DW_AT_decl_column(0x15)
$C$DW$1722	.dwtag  DW_TAG_member
	.dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1722, DW_AT_name("numDynamicHdrBufs")
	.dwattr $C$DW$1722, DW_AT_TI_symbol_name("numDynamicHdrBufs")
	.dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1722, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1722, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1722, DW_AT_decl_column(0x15)
$C$DW$1723	.dwtag  DW_TAG_member
	.dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1723, DW_AT_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1723, DW_AT_TI_symbol_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1723, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1723, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1723, DW_AT_decl_column(0x15)
$C$DW$1724	.dwtag  DW_TAG_member
	.dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1724, DW_AT_name("numDynamicFrames")
	.dwattr $C$DW$1724, DW_AT_TI_symbol_name("numDynamicFrames")
	.dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1724, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1724, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1724, DW_AT_decl_column(0x15)
$C$DW$1725	.dwtag  DW_TAG_member
	.dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1725, DW_AT_name("freeDynamicFrames")
	.dwattr $C$DW$1725, DW_AT_TI_symbol_name("freeDynamicFrames")
	.dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1725, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1725, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1725, DW_AT_decl_column(0x15)
$C$DW$1726	.dwtag  DW_TAG_member
	.dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1726, DW_AT_name("frmStartAddrp")
	.dwattr $C$DW$1726, DW_AT_TI_symbol_name("frmStartAddrp")
	.dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1726, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1726, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1726, DW_AT_decl_column(0x15)
$C$DW$1727	.dwtag  DW_TAG_member
	.dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1727, DW_AT_name("frmEndAddrp")
	.dwattr $C$DW$1727, DW_AT_TI_symbol_name("frmEndAddrp")
	.dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1727, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1727, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1727, DW_AT_decl_column(0x15)
$C$DW$1728	.dwtag  DW_TAG_member
	.dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1728, DW_AT_name("hdrBufStartAddrp")
	.dwattr $C$DW$1728, DW_AT_TI_symbol_name("hdrBufStartAddrp")
	.dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1728, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1728, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$1728, DW_AT_decl_column(0x15)
$C$DW$1729	.dwtag  DW_TAG_member
	.dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1729, DW_AT_name("hdrBufEndAddrp")
	.dwattr $C$DW$1729, DW_AT_TI_symbol_name("hdrBufEndAddrp")
	.dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1729, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1729, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1729, DW_AT_decl_column(0x15)
$C$DW$1730	.dwtag  DW_TAG_member
	.dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1730, DW_AT_name("frmBufsStartAddrp")
	.dwattr $C$DW$1730, DW_AT_TI_symbol_name("frmBufsStartAddrp")
	.dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1730, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1730, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1730, DW_AT_decl_column(0x15)
$C$DW$1731	.dwtag  DW_TAG_member
	.dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1731, DW_AT_name("frmBufsEndAddrp")
	.dwattr $C$DW$1731, DW_AT_TI_symbol_name("frmBufsEndAddrp")
	.dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1731, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1731, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1731, DW_AT_decl_column(0x15)
$C$DW$1732	.dwtag  DW_TAG_member
	.dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$1732, DW_AT_name("frmBufSize")
	.dwattr $C$DW$1732, DW_AT_TI_symbol_name("frmBufSize")
	.dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1732, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1732, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1732, DW_AT_decl_column(0x15)
$C$DW$1733	.dwtag  DW_TAG_member
	.dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$1733, DW_AT_name("frmRefCnt")
	.dwattr $C$DW$1733, DW_AT_TI_symbol_name("frmRefCnt")
	.dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1733, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1733, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1733, DW_AT_decl_column(0x15)
$C$DW$1734	.dwtag  DW_TAG_member
	.dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$1734, DW_AT_name("dynFrame")
	.dwattr $C$DW$1734, DW_AT_TI_symbol_name("dynFrame")
	.dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1734, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1734, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1734, DW_AT_decl_column(0x15)
$C$DW$1735	.dwtag  DW_TAG_member
	.dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$1735, DW_AT_name("dynFrmRefCnt")
	.dwattr $C$DW$1735, DW_AT_TI_symbol_name("dynFrmRefCnt")
	.dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1735, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1735, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1735, DW_AT_decl_column(0x15)
$C$DW$1736	.dwtag  DW_TAG_member
	.dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$1736, DW_AT_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1736, DW_AT_TI_symbol_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1736, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1736, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1736, DW_AT_decl_column(0x15)
$C$DW$1737	.dwtag  DW_TAG_member
	.dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$1737, DW_AT_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1737, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1737, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1737, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1737, DW_AT_decl_column(0x15)
$C$DW$1738	.dwtag  DW_TAG_member
	.dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$1738, DW_AT_name("dynHdrBufs")
	.dwattr $C$DW$1738, DW_AT_TI_symbol_name("dynHdrBufs")
	.dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1738, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1738, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1738, DW_AT_decl_column(0x15)
$C$DW$1739	.dwtag  DW_TAG_member
	.dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1739, DW_AT_name("hdrBufIsUsed")
	.dwattr $C$DW$1739, DW_AT_TI_symbol_name("hdrBufIsUsed")
	.dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1739, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1739, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1739, DW_AT_decl_column(0x15)
$C$DW$1740	.dwtag  DW_TAG_member
	.dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1740, DW_AT_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1740, DW_AT_TI_symbol_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1740, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1740, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1740, DW_AT_decl_column(0x15)
$C$DW$1741	.dwtag  DW_TAG_member
	.dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$1741, DW_AT_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1741, DW_AT_TI_symbol_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x272]
	.dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1741, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1741, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1741, DW_AT_decl_column(0x15)
$C$DW$1742	.dwtag  DW_TAG_member
	.dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$351)
	.dwattr $C$DW$1742, DW_AT_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1742, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b2]
	.dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1742, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1742, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1742, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$352

	.dwattr $C$DW$T$352, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$352, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$352, DW_AT_decl_column(0x10)
$C$DW$T$1229	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FreeFramePoolObj")
	.dwattr $C$DW$T$1229, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$T$1229, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1229, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1229, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$1229, DW_AT_decl_column(0x03)

$C$DW$T$334	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$334, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$334, DW_AT_byte_size(0x01)
$C$DW$1743	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1743, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1743, DW_AT_decl_line(0x174)
	.dwattr $C$DW$1743, DW_AT_decl_column(0x05)
$C$DW$1744	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1744, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1744, DW_AT_decl_line(0x178)
	.dwattr $C$DW$1744, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$334

	.dwattr $C$DW$T$334, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$334, DW_AT_decl_line(0x173)
	.dwattr $C$DW$T$334, DW_AT_decl_column(0x0e)
$C$DW$T$335	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$335, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x179)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x03)

$C$DW$T$353	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$353, DW_AT_name("FrameQBufMgr_NameServerEntry_tag")
	.dwattr $C$DW$T$353, DW_AT_byte_size(0x20)
$C$DW$1745	.dwtag  DW_TAG_member
	.dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1745, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1745, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1745, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1745, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1745, DW_AT_decl_column(0x0f)
$C$DW$1746	.dwtag  DW_TAG_member
	.dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1746, DW_AT_name("headerInterfaceType")
	.dwattr $C$DW$1746, DW_AT_TI_symbol_name("headerInterfaceType")
	.dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1746, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1746, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1746, DW_AT_decl_column(0x0f)
$C$DW$1747	.dwtag  DW_TAG_member
	.dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1747, DW_AT_name("bufInterfaceType")
	.dwattr $C$DW$1747, DW_AT_TI_symbol_name("bufInterfaceType")
	.dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1747, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1747, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1747, DW_AT_decl_column(0x0f)
$C$DW$1748	.dwtag  DW_TAG_member
	.dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$1748, DW_AT_name("instParams")
	.dwattr $C$DW$1748, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1748, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1748, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1748, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$353

	.dwattr $C$DW$T$353, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$353, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$353, DW_AT_decl_column(0x10)
$C$DW$T$1230	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NameServerEntry")
	.dwattr $C$DW$T$1230, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$T$1230, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1230, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1230, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1230, DW_AT_decl_column(0x02)

$C$DW$T$361	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$361, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$361, DW_AT_byte_size(0x14)
$C$DW$1749	.dwtag  DW_TAG_member
	.dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$1749, DW_AT_name("notifyType")
	.dwattr $C$DW$1749, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1749, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1749, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$1749, DW_AT_decl_column(0x1d)
$C$DW$1750	.dwtag  DW_TAG_member
	.dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1750, DW_AT_name("watermark")
	.dwattr $C$DW$1750, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1750, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1750, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$1750, DW_AT_decl_column(0x1d)
$C$DW$1751	.dwtag  DW_TAG_member
	.dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$1751, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$1751, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1751, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1751, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$1751, DW_AT_decl_column(0x1d)
$C$DW$1752	.dwtag  DW_TAG_member
	.dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1752, DW_AT_name("cbContext")
	.dwattr $C$DW$1752, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1752, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1752, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$1752, DW_AT_decl_column(0x1d)
$C$DW$1753	.dwtag  DW_TAG_member
	.dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1753, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$1753, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1753, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1753, DW_AT_decl_line(0x201)
	.dwattr $C$DW$1753, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$361

	.dwattr $C$DW$T$361, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$361, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$T$361, DW_AT_decl_column(0x10)
$C$DW$T$418	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$418, DW_AT_type(*$C$DW$T$361)
	.dwattr $C$DW$T$418, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$418, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$418, DW_AT_decl_line(0x204)
	.dwattr $C$DW$T$418, DW_AT_decl_column(0x03)
$C$DW$T$419	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$419, DW_AT_type(*$C$DW$T$418)
	.dwattr $C$DW$T$419, DW_AT_address_class(0x20)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("FrameQBufMgr_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$356	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$356, DW_AT_address_class(0x20)
$C$DW$T$357	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Handle")
	.dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$T$357, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$357, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$357, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$T$357, DW_AT_decl_column(0x25)
$C$DW$T$1232	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1232, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$T$1232, DW_AT_address_class(0x20)

$C$DW$T$363	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$363, DW_AT_name("FrameQBufMgr_OpenParams_tag")
	.dwattr $C$DW$T$363, DW_AT_byte_size(0x0c)
$C$DW$1754	.dwtag  DW_TAG_member
	.dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$1754, DW_AT_name("commonOpenParams")
	.dwattr $C$DW$1754, DW_AT_TI_symbol_name("commonOpenParams")
	.dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1754, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1754, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1754, DW_AT_decl_column(0x27)
	.dwendtag $C$DW$T$363

	.dwattr $C$DW$T$363, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$363, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$363, DW_AT_decl_column(0x10)
$C$DW$T$1234	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_OpenParams")
	.dwattr $C$DW$T$1234, DW_AT_type(*$C$DW$T$363)
	.dwattr $C$DW$T$1234, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1234, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1234, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$1234, DW_AT_decl_column(0x02)

$C$DW$T$365	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$365, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$365, DW_AT_byte_size(0x18)
$C$DW$1755	.dwtag  DW_TAG_member
	.dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$1755, DW_AT_name("commonCreateParams")
	.dwattr $C$DW$1755, DW_AT_TI_symbol_name("commonCreateParams")
	.dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1755, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1755, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$1755, DW_AT_decl_column(0x21)
$C$DW$1756	.dwtag  DW_TAG_member
	.dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1756, DW_AT_name("impParams")
	.dwattr $C$DW$1756, DW_AT_TI_symbol_name("impParams")
	.dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1756, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1756, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$1756, DW_AT_decl_column(0x09)
$C$DW$1757	.dwtag  DW_TAG_member
	.dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1757, DW_AT_name("impParamsSize")
	.dwattr $C$DW$1757, DW_AT_TI_symbol_name("impParamsSize")
	.dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1757, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1757, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$1757, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$365

	.dwattr $C$DW$T$365, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$365, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$T$365, DW_AT_decl_column(0x10)
$C$DW$T$1236	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$1236, DW_AT_type(*$C$DW$T$365)
	.dwattr $C$DW$T$1236, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1236, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1236, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$T$1236, DW_AT_decl_column(0x03)

$C$DW$T$366	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$366, DW_AT_name("FrameQBufMgr_ShMem_InstNameServerEntryParams_tag")
	.dwattr $C$DW$T$366, DW_AT_byte_size(0x14)
$C$DW$1758	.dwtag  DW_TAG_member
	.dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1758, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1758, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1758, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1758, DW_AT_decl_line(0x100)
	.dwattr $C$DW$1758, DW_AT_decl_column(0x14)
$C$DW$1759	.dwtag  DW_TAG_member
	.dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1759, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1759, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1759, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1759, DW_AT_decl_line(0x101)
	.dwattr $C$DW$1759, DW_AT_decl_column(0x14)
$C$DW$1760	.dwtag  DW_TAG_member
	.dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1760, DW_AT_name("instGateMPAddr")
	.dwattr $C$DW$1760, DW_AT_TI_symbol_name("instGateMPAddr")
	.dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1760, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1760, DW_AT_decl_line(0x102)
	.dwattr $C$DW$1760, DW_AT_decl_column(0x14)
$C$DW$1761	.dwtag  DW_TAG_member
	.dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$1761, DW_AT_name("frmBuf_regionId")
	.dwattr $C$DW$1761, DW_AT_TI_symbol_name("frmBuf_regionId")
	.dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1761, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1761, DW_AT_decl_line(0x103)
	.dwattr $C$DW$1761, DW_AT_decl_column(0x14)
$C$DW$1762	.dwtag  DW_TAG_member
	.dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$1762, DW_AT_name("hdrBuf_regionId")
	.dwattr $C$DW$1762, DW_AT_TI_symbol_name("hdrBuf_regionId")
