;******************************************************************************
;* TMS470 C/C++ Codegen                                           Unix v4.9.5 *
;* Date/Time created: Wed Apr  3 11:43:11 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=2 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../../cfg/SysLinkCfg.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS470 C/C++ Codegen Unix v4.9.5 Copyright (c) 1996-2012 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/sksung/work/udx/ch2/ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("RingIOShm_create")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("RingIOShm_create")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x198)
	.dwattr $C$DW$1, DW_AT_decl_column(0x01)
$C$DW$2	.dwtag  DW_TAG_formal_parameter

	.dwattr $C$DW$4, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$4, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$4, DW_AT_decl_column(0x01)
$C$DW$5	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$5, DW_AT_type(*$C$DW$T$151)
$C$DW$6	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$6, DW_AT_type(*$C$DW$T$157)
	.dwendtag $C$DW$4


$C$DW$7	.dwtag  DW_TAG_subprogram, DW_AT_name("RingIOShm_openByAddr")
	.dwattr $C$DW$7, DW_AT_TI_symbol_name("RingIOShm_openByAddr")
	.dwattr $C$DW$7, DW_AT_type(*$C$DW$T$149)
	.dwattr $C$DW$7, DW_AT_declaration
	.dwattr $C$DW$7, DW_AT_external
	.dwattr $C$DW$7, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$7, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$7, DW_AT_decl_column(0x01)
$C$DW$8	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$8, DW_AT_type(*$C$DW$T$95)
$C$DW$9	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$9, DW_AT_type(*$C$DW$T$163)
$C$DW$10	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$10, DW_AT_type(*$C$DW$T$152)
	.dwendtag $C$DW$7

	.global	SysLink_RingIO_cfgFxns
	.data
	.align	4
	.elfsym	SysLink_RingIO_cfgFxns,SYM_SIZE(12)
SysLink_RingIO_cfgFxns:
	.field	RingIOShm_create,32		; SysLink_RingIO_cfgFxns[0].create @ 0
	.field	RingIOShm_sharedMemReq,32		; SysLink_RingIO_cfgFxns[0].sharedMemReq @ 32
	.field	RingIOShm_openByAddr,32		; SysLink_RingIO_cfgFxns[0].openByAddr @ 64

$C$DW$11	.dwtag  DW_TAG_variable, DW_AT_name("SysLink_RingIO_cfgFxns")
	.dwattr $C$DW$11, DW_AT_TI_symbol_name("SysLink_RingIO_cfgFxns")
	.dwattr $C$DW$11, DW_AT_location[DW_OP_addr SysLink_RingIO_cfgFxns]
	.dwattr $C$DW$11, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$11, DW_AT_external
	.dwattr $C$DW$11, DW_AT_decl_file("../../cfg/SysLinkCfg.c")
	.dwattr $C$DW$11, DW_AT_decl_line(0x51)
	.dwattr $C$DW$11, DW_AT_decl_column(0x10)
	.global	Syslink_RingIO_moduleCfg
	.data
	.align	4
	.elfsym	Syslink_RingIO_moduleCfg,SYM_SIZE(8)
Syslink_RingIO_moduleCfg:
	.field	32,32			; Syslink_RingIO_moduleCfg.maxNameLen @ 0
	.field	32,32			; Syslink_RingIO_moduleCfg.maxInstances @ 32

$C$DW$12	.dwtag  DW_TAG_variable, DW_AT_name("Syslink_RingIO_moduleCfg")
	.dwattr $C$DW$12, DW_AT_TI_symbol_name("Syslink_RingIO_moduleCfg")
	.dwattr $C$DW$12, DW_AT_location[DW_OP_addr Syslink_RingIO_moduleCfg]
	.dwattr $C$DW$12, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$12, DW_AT_external
	.dwattr $C$DW$12, DW_AT_decl_file("../../cfg/SysLinkCfg.c")
	.dwattr $C$DW$12, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$12, DW_AT_decl_column(0x0f)
	.global	Syslink_RingIOShm_moduleCfg
	.data
	.align	4
	.elfsym	Syslink_RingIOShm_moduleCfg,SYM_SIZE(4)
Syslink_RingIOShm_moduleCfg:
	.field	5,32			; Syslink_RingIOShm_moduleCfg.notifyEventNo @ 0

$C$DW$13	.dwtag  DW_TAG_variable, DW_AT_name("Syslink_RingIOShm_moduleCfg")
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("Syslink_RingIOShm_moduleCfg")
	.dwattr $C$DW$13, DW_AT_location[DW_OP_addr Syslink_RingIOShm_moduleCfg]
	.dwattr $C$DW$13, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$13, DW_AT_external
	.dwattr $C$DW$13, DW_AT_decl_file("../../cfg/SysLinkCfg.c")
	.dwattr $C$DW$13, DW_AT_decl_line(0x60)
	.dwattr $C$DW$13, DW_AT_decl_column(0x12)
;	/home/sksung/work/udx/ch2/packages/../ti_tools/cgt470_4_9_5/bin/acpia470 -@/tmp/27863oH7m2S 
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	RingIOShm_create
	.global	RingIOShm_sharedMemReq
	.global	RingIOShm_openByAddr

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(2)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$323	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$323, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$323, DW_AT_byte_size(0x01)
$C$DW$14	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$14, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$14, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$14, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$323

	.dwattr $C$DW$T$323, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$323, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$323, DW_AT_decl_column(0x0e)
$C$DW$T$324	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$324, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$324, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$324, DW_AT_decl_column(0x03)

$C$DW$T$96	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$96, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x10)
$C$DW$15	.dwtag  DW_TAG_member
	.dwattr $C$DW$15, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$15, DW_AT_name("gate")
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$15, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$15, DW_AT_decl_line(0x87)
	.dwattr $C$DW$15, DW_AT_decl_column(0x1b)
$C$DW$16	.dwtag  DW_TAG_member
	.dwattr $C$DW$16, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$16, DW_AT_name("numProcessors")
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$16, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$16, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$16, DW_AT_decl_column(0x0f)
$C$DW$17	.dwtag  DW_TAG_member
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$17, DW_AT_name("procIds")
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$17, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$17, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$17, DW_AT_decl_column(0x0f)
$C$DW$18	.dwtag  DW_TAG_member
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$18, DW_AT_name("drvHandles")
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$18, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$18, DW_AT_decl_line(0x93)
	.dwattr $C$DW$18, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$96

	.dwattr $C$DW$T$96, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$96, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$96, DW_AT_decl_column(0x10)
$C$DW$T$325	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$325, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x03)

$C$DW$T$326	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$326, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$326, DW_AT_byte_size(0x01)
$C$DW$19	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$19, DW_AT_decl_line(0x61)
	.dwattr $C$DW$19, DW_AT_decl_column(0x05)
$C$DW$20	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$20, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$20, DW_AT_decl_line(0x63)
	.dwattr $C$DW$20, DW_AT_decl_column(0x05)
$C$DW$21	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$21, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$21, DW_AT_decl_line(0x65)
	.dwattr $C$DW$21, DW_AT_decl_column(0x05)
$C$DW$22	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$22, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$22, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$22, DW_AT_decl_column(0x05)
$C$DW$23	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$23, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$23, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$23, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$326

	.dwattr $C$DW$T$326, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$326, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$326, DW_AT_decl_column(0x0e)
$C$DW$T$327	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$327, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$327, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$327, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$328	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$328, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$328, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$328, DW_AT_decl_column(0x27)
$C$DW$T$126	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$126, DW_AT_address_class(0x20)
$C$DW$T$127	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$127, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$127, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$127, DW_AT_decl_column(0x29)

$C$DW$T$109	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$109, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$109, DW_AT_byte_size(0x2c)
$C$DW$24	.dwtag  DW_TAG_member
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$24, DW_AT_name("name")
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$24, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$24, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$24, DW_AT_decl_column(0x14)
$C$DW$25	.dwtag  DW_TAG_member
	.dwattr $C$DW$25, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$25, DW_AT_name("eventNo")
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$25, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$25, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$25, DW_AT_decl_column(0x14)
$C$DW$26	.dwtag  DW_TAG_member
	.dwattr $C$DW$26, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$26, DW_AT_name("openFlag")
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$26, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$26, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$26, DW_AT_decl_column(0x14)
$C$DW$27	.dwtag  DW_TAG_member
	.dwattr $C$DW$27, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$27, DW_AT_name("creatorProcId")
	.dwattr $C$DW$27, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$27, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$27, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$27, DW_AT_decl_column(0x14)
$C$DW$28	.dwtag  DW_TAG_member
	.dwattr $C$DW$28, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$28, DW_AT_name("sharedAddr")
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$28, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$28, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$28, DW_AT_decl_column(0x14)
$C$DW$29	.dwtag  DW_TAG_member
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$29, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$29, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$29, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$29, DW_AT_decl_column(0x14)
$C$DW$30	.dwtag  DW_TAG_member
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$30, DW_AT_name("gate")
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$30, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$30, DW_AT_decl_line(0xac)
	.dwattr $C$DW$30, DW_AT_decl_column(0x14)
$C$DW$31	.dwtag  DW_TAG_member
	.dwattr $C$DW$31, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$31, DW_AT_name("cacheFlags")
	.dwattr $C$DW$31, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$31, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$31, DW_AT_decl_line(0xae)
	.dwattr $C$DW$31, DW_AT_decl_column(0x14)
$C$DW$32	.dwtag  DW_TAG_member
	.dwattr $C$DW$32, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$32, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$32, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$32, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$32, DW_AT_decl_column(0x14)
$C$DW$33	.dwtag  DW_TAG_member
	.dwattr $C$DW$33, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$33, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$33, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$33, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$33, DW_AT_decl_column(0x14)
$C$DW$34	.dwtag  DW_TAG_member
	.dwattr $C$DW$34, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$34, DW_AT_name("regionId")
	.dwattr $C$DW$34, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$34, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$34, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$34, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$109

	.dwattr $C$DW$T$109, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x10)
$C$DW$T$329	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$329, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$329, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$329, DW_AT_decl_column(0x03)

$C$DW$T$113	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$113, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$113, DW_AT_byte_size(0x1c)
$C$DW$35	.dwtag  DW_TAG_member
	.dwattr $C$DW$35, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$35, DW_AT_name("clientHandle")
	.dwattr $C$DW$35, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$35, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$35, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$35, DW_AT_decl_column(0x12)
$C$DW$36	.dwtag  DW_TAG_member
	.dwattr $C$DW$36, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$36, DW_AT_name("procId")
	.dwattr $C$DW$36, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$36, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$36, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$36, DW_AT_decl_column(0x12)
$C$DW$37	.dwtag  DW_TAG_member
	.dwattr $C$DW$37, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$37, DW_AT_name("notifyType")
	.dwattr $C$DW$37, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$37, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$37, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$37, DW_AT_decl_column(0x12)
$C$DW$38	.dwtag  DW_TAG_member
	.dwattr $C$DW$38, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$38, DW_AT_name("fxnPtr")
	.dwattr $C$DW$38, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$38, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$38, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$38, DW_AT_decl_column(0x1d)
$C$DW$39	.dwtag  DW_TAG_member
	.dwattr $C$DW$39, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$39, DW_AT_name("cbContext")
	.dwattr $C$DW$39, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$39, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$39, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$39, DW_AT_decl_column(0x12)
$C$DW$40	.dwtag  DW_TAG_member
	.dwattr $C$DW$40, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$40, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$40, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$40, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$40, DW_AT_decl_column(0x12)
$C$DW$41	.dwtag  DW_TAG_member
	.dwattr $C$DW$41, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$41, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$41, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$41, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$41, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$113

	.dwattr $C$DW$T$113, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$113, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$113, DW_AT_decl_column(0x10)
$C$DW$T$330	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$330, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$330, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$330, DW_AT_decl_column(0x03)

$C$DW$T$114	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$114, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x01)
$C$DW$42	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$42, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$42, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$42, DW_AT_decl_column(0x05)
$C$DW$43	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_INTERRUPT"), DW_AT_const_value(0x01)
	.dwattr $C$DW$43, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$43, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$43, DW_AT_decl_column(0x05)
$C$DW$44	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_TASKLET"), DW_AT_const_value(0x02)
	.dwattr $C$DW$44, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$44, DW_AT_decl_line(0xce)
	.dwattr $C$DW$44, DW_AT_decl_column(0x05)
$C$DW$45	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_THREAD"), DW_AT_const_value(0x03)
	.dwattr $C$DW$45, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$45, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$45, DW_AT_decl_column(0x05)
$C$DW$46	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_PROCESS"), DW_AT_const_value(0x04)
	.dwattr $C$DW$46, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$46, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$46, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$114

	.dwattr $C$DW$T$114, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$114, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$114, DW_AT_decl_column(0x0e)
$C$DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$115, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$115, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$T$115, DW_AT_decl_column(0x03)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("GateMP_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$103	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$103, DW_AT_address_class(0x20)
$C$DW$T$104	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Handle")
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$104, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$104, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$T$104, DW_AT_decl_column(0x1f)

$C$DW$T$118	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$118, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$118, DW_AT_byte_size(0x10)
$C$DW$47	.dwtag  DW_TAG_member
	.dwattr $C$DW$47, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$47, DW_AT_name("name")
	.dwattr $C$DW$47, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$47, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$47, DW_AT_decl_line(0x101)
	.dwattr $C$DW$47, DW_AT_decl_column(0x0c)
$C$DW$48	.dwtag  DW_TAG_member
	.dwattr $C$DW$48, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$48, DW_AT_name("regionId")
	.dwattr $C$DW$48, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$48, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$48, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$48, DW_AT_decl_column(0x0c)
$C$DW$49	.dwtag  DW_TAG_member
	.dwattr $C$DW$49, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$49, DW_AT_name("sharedAddr")
	.dwattr $C$DW$49, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$49, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$49, DW_AT_decl_line(0x117)
	.dwattr $C$DW$49, DW_AT_decl_column(0x09)
$C$DW$50	.dwtag  DW_TAG_member
	.dwattr $C$DW$50, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$50, DW_AT_name("localProtect")
	.dwattr $C$DW$50, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$50, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$50, DW_AT_decl_line(0x125)
	.dwattr $C$DW$50, DW_AT_decl_column(0x19)
$C$DW$51	.dwtag  DW_TAG_member
	.dwattr $C$DW$51, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$51, DW_AT_name("remoteProtect")
	.dwattr $C$DW$51, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$51, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$51, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$51, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$118

	.dwattr $C$DW$T$118, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$118, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$118, DW_AT_decl_column(0x10)
$C$DW$T$331	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$331, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$331, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$331, DW_AT_decl_column(0x03)

$C$DW$T$116	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$116, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$116, DW_AT_byte_size(0x01)
$C$DW$52	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$52, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$52, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$52, DW_AT_decl_column(0x05)
$C$DW$53	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_SYSTEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$53, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$53, DW_AT_decl_line(0xed)
	.dwattr $C$DW$53, DW_AT_decl_column(0x05)
$C$DW$54	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM1"), DW_AT_const_value(0x02)
	.dwattr $C$DW$54, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$54, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$54, DW_AT_decl_column(0x05)
$C$DW$55	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM2"), DW_AT_const_value(0x03)
	.dwattr $C$DW$55, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$55, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$55, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$116

	.dwattr $C$DW$T$116, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$116, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$116, DW_AT_decl_column(0x0e)
$C$DW$T$117	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$117, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/ipc_1_24_03_32/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$117, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$T$117, DW_AT_decl_column(0x03)

$C$DW$T$123	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$123, DW_AT_name("RingIOShm_Attr_tag")
	.dwattr $C$DW$T$123, DW_AT_byte_size(0x10)
$C$DW$56	.dwtag  DW_TAG_member
	.dwattr $C$DW$56, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$56, DW_AT_name("offset")
	.dwattr $C$DW$56, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$56, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$56, DW_AT_decl_line(0xab)
	.dwattr $C$DW$56, DW_AT_decl_column(0x0f)
$C$DW$57	.dwtag  DW_TAG_member
	.dwattr $C$DW$57, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$57, DW_AT_name("prevoffset")
	.dwattr $C$DW$57, DW_AT_TI_symbol_name("prevoffset")
	.dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$57, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$57, DW_AT_decl_line(0xad)
	.dwattr $C$DW$57, DW_AT_decl_column(0x0f)
$C$DW$58	.dwtag  DW_TAG_member
	.dwattr $C$DW$58, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$58, DW_AT_name("type")
	.dwattr $C$DW$58, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$58, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$58, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$58, DW_AT_decl_column(0x0f)
$C$DW$59	.dwtag  DW_TAG_member
	.dwattr $C$DW$59, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$59, DW_AT_name("size")
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$59, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$59, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$59, DW_AT_decl_column(0x0f)
$C$DW$60	.dwtag  DW_TAG_member
	.dwattr $C$DW$60, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$60, DW_AT_name("param")
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("param")
	.dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$60, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$60, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$60, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$123

	.dwattr $C$DW$T$123, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$123, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$T$123, DW_AT_decl_column(0x10)
$C$DW$T$332	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Attr")
	.dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$332, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$332, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$332, DW_AT_decl_column(0x03)

$C$DW$T$128	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$128, DW_AT_name("RingIOShm_Client_tag")
	.dwattr $C$DW$T$128, DW_AT_byte_size(0x40)
$C$DW$61	.dwtag  DW_TAG_member
	.dwattr $C$DW$61, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$61, DW_AT_name("pDataStart")
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("pDataStart")
	.dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$61, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$61, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$61, DW_AT_decl_column(0x1c)
$C$DW$62	.dwtag  DW_TAG_member
	.dwattr $C$DW$62, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$62, DW_AT_name("pAttrStart")
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("pAttrStart")
	.dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$62, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$62, DW_AT_decl_line(0xca)
	.dwattr $C$DW$62, DW_AT_decl_column(0x1c)
$C$DW$63	.dwtag  DW_TAG_member
	.dwattr $C$DW$63, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$63, DW_AT_name("acqStart")
	.dwattr $C$DW$63, DW_AT_TI_symbol_name("acqStart")
	.dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$63, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$63, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$63, DW_AT_decl_column(0x1c)
$C$DW$64	.dwtag  DW_TAG_member
	.dwattr $C$DW$64, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$64, DW_AT_name("acqSize")
	.dwattr $C$DW$64, DW_AT_TI_symbol_name("acqSize")
	.dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$64, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$64, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$64, DW_AT_decl_column(0x1c)
$C$DW$65	.dwtag  DW_TAG_member
	.dwattr $C$DW$65, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$65, DW_AT_name("acqAttrStart")
	.dwattr $C$DW$65, DW_AT_TI_symbol_name("acqAttrStart")
	.dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$65, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$65, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$65, DW_AT_decl_column(0x1c)
$C$DW$66	.dwtag  DW_TAG_member
	.dwattr $C$DW$66, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$66, DW_AT_name("acqAttrSize")
	.dwattr $C$DW$66, DW_AT_TI_symbol_name("acqAttrSize")
	.dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$66, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$66, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$66, DW_AT_decl_column(0x1c)
$C$DW$67	.dwtag  DW_TAG_member
	.dwattr $C$DW$67, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$67, DW_AT_name("notifyType")
	.dwattr $C$DW$67, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$67, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$67, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$67, DW_AT_decl_column(0x1c)
$C$DW$68	.dwtag  DW_TAG_member
	.dwattr $C$DW$68, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$68, DW_AT_name("notifyParam")
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("notifyParam")
	.dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$68, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$68, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$68, DW_AT_decl_column(0x1c)
$C$DW$69	.dwtag  DW_TAG_member
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$69, DW_AT_name("notifyWaterMark")
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("notifyWaterMark")
	.dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$69, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$69, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$69, DW_AT_decl_column(0x1c)
$C$DW$70	.dwtag  DW_TAG_member
	.dwattr $C$DW$70, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$70, DW_AT_name("flags")
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$70, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$70, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$70, DW_AT_decl_column(0x1c)
$C$DW$71	.dwtag  DW_TAG_member
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$71, DW_AT_name("isValid")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$71, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$71, DW_AT_decl_line(0xea)
	.dwattr $C$DW$71, DW_AT_decl_column(0x1c)
$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$72, DW_AT_name("refCount")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$72, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$72, DW_AT_decl_line(0xec)
	.dwattr $C$DW$72, DW_AT_decl_column(0x1c)
$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$73, DW_AT_name("notifyId")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("notifyId")
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$73, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$73, DW_AT_decl_line(0xee)
	.dwattr $C$DW$73, DW_AT_decl_column(0x1c)
$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$74, DW_AT_name("isRegistered")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("isRegistered")
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$74, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$74, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$74, DW_AT_decl_column(0x1c)
$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$75, DW_AT_name("clientNotifyMgrHandle")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("clientNotifyMgrHandle")
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$75, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$75, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$75, DW_AT_decl_column(0x1c)
$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$76, DW_AT_name("clientNotifyMgrGate")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("clientNotifyMgrGate")
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$76, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$76, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$76, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$128

	.dwattr $C$DW$T$128, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x10)
$C$DW$T$140	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Client")
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$140, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x03)
$C$DW$T$141	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
	.dwattr $C$DW$T$141, DW_AT_address_class(0x20)
$C$DW$T$142	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ClientHandle")
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$142, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$142, DW_AT_decl_line(0x146)
	.dwattr $C$DW$T$142, DW_AT_decl_column(0x22)

$C$DW$T$129	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$129, DW_AT_name("RingIOShm_Config_Tag")
	.dwattr $C$DW$T$129, DW_AT_byte_size(0x04)
$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$77, DW_AT_name("notifyEventNo")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("notifyEventNo")
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$77, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$77, DW_AT_decl_line(0x112)
	.dwattr $C$DW$77, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$129

	.dwattr $C$DW$T$129, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$T$129, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$129, DW_AT_decl_column(0x10)
$C$DW$T$333	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Config")
	.dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$333, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0x114)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x03)

$C$DW$T$134	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$134, DW_AT_name("RingIOShm_ControlStruct_tag")
	.dwattr $C$DW$T$134, DW_AT_byte_size(0x44)
$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$78, DW_AT_name("interfaceAttrs")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("interfaceAttrs")
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$78, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$78, DW_AT_decl_line(0x107)
	.dwattr $C$DW$78, DW_AT_decl_column(0x1d)
$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$79, DW_AT_name("srPtrBufStart")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("srPtrBufStart")
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$79, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$79, DW_AT_decl_line(0x109)
	.dwattr $C$DW$79, DW_AT_decl_column(0x1c)
$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$80, DW_AT_name("srPtrBufEnd")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("srPtrBufEnd")
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$80, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$80, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$80, DW_AT_decl_column(0x1c)
$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$81, DW_AT_name("curBufEnd")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("curBufEnd")
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$81, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$81, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$81, DW_AT_decl_column(0x1b)
$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$82, DW_AT_name("dataBufEnd")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("dataBufEnd")
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$82, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$82, DW_AT_decl_line(0x111)
	.dwattr $C$DW$82, DW_AT_decl_column(0x1b)
$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$83, DW_AT_name("dataSharedAddrSize")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("dataSharedAddrSize")
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$83, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$83, DW_AT_decl_line(0x113)
	.dwattr $C$DW$83, DW_AT_decl_column(0x1b)
$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$84, DW_AT_name("footBufSize")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("footBufSize")
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$84, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$84, DW_AT_decl_line(0x115)
	.dwattr $C$DW$84, DW_AT_decl_column(0x1b)
$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$85, DW_AT_name("validSize")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("validSize")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$85, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$85, DW_AT_decl_line(0x117)
	.dwattr $C$DW$85, DW_AT_decl_column(0x1b)
$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$86, DW_AT_name("emptySize")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("emptySize")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$86, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$86, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$86, DW_AT_decl_column(0x1b)
$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$87, DW_AT_name("srPtrAttrBufStart")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("srPtrAttrBufStart")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$87, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$87, DW_AT_decl_line(0x121)
	.dwattr $C$DW$87, DW_AT_decl_column(0x1b)
$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$88, DW_AT_name("srPtrAttrBufEnd")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("srPtrAttrBufEnd")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$88, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$88, DW_AT_decl_line(0x123)
	.dwattr $C$DW$88, DW_AT_decl_column(0x1b)
$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$89, DW_AT_name("curAttrBufEnd")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("curAttrBufEnd")
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$89, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$89, DW_AT_decl_line(0x125)
	.dwattr $C$DW$89, DW_AT_decl_column(0x1b)
$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$90, DW_AT_name("validAttrSize")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("validAttrSize")
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$90, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$90, DW_AT_decl_line(0x129)
	.dwattr $C$DW$90, DW_AT_decl_column(0x1b)
$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$91, DW_AT_name("emptyAttrSize")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("emptyAttrSize")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$91, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$91, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$91, DW_AT_decl_column(0x1b)
$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$92, DW_AT_name("prevAttrOffset")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("prevAttrOffset")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$92, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$92, DW_AT_decl_line(0x132)
	.dwattr $C$DW$92, DW_AT_decl_column(0x1b)
$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$93, DW_AT_name("procId")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$93, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$93, DW_AT_decl_line(0x134)
	.dwattr $C$DW$93, DW_AT_decl_column(0x1b)
$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$94, DW_AT_name("gateMPSharedAddr")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("gateMPSharedAddr")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$94, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$94, DW_AT_decl_line(0x136)
	.dwattr $C$DW$94, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$134

	.dwattr $C$DW$T$134, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x10)
$C$DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ControlStruct")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$137, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x138)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x03)
$C$DW$T$138	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$138, DW_AT_address_class(0x20)
$C$DW$T$139	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ControlHandle")
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$139, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x23)

$C$DW$T$144	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$144, DW_AT_name("RingIOShm_Obj_tag")
	.dwattr $C$DW$T$144, DW_AT_byte_size(0x3c)
$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$95, DW_AT_name("name")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$95, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$95, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$95, DW_AT_decl_column(0x11)
$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$96, DW_AT_name("ctrlSharedAddr")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("ctrlSharedAddr")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$96, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$96, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$96, DW_AT_decl_column(0x11)
$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$97, DW_AT_name("gateHandle")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("gateHandle")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$97, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$97, DW_AT_decl_line(0x156)
	.dwattr $C$DW$97, DW_AT_decl_column(0x21)
$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$98, DW_AT_name("transportHandle")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("transportHandle")
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$98, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$98, DW_AT_decl_line(0x159)
	.dwattr $C$DW$98, DW_AT_decl_column(0x21)
$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$99, DW_AT_name("control")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("control")
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$99, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$99, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$99, DW_AT_decl_column(0x21)
$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$100, DW_AT_name("writer")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("writer")
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$100, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$100, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$100, DW_AT_decl_column(0x21)
$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$101, DW_AT_name("reader")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("reader")
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$101, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$101, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$101, DW_AT_decl_column(0x21)
$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$102, DW_AT_name("openMode")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("openMode")
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$102, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$102, DW_AT_decl_line(0x161)
	.dwattr $C$DW$102, DW_AT_decl_column(0x21)
$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$103, DW_AT_name("owner")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("owner")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$103, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$103, DW_AT_decl_line(0x163)
	.dwattr $C$DW$103, DW_AT_decl_column(0x21)
$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$104, DW_AT_name("clientNotifyMgrHandle")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("clientNotifyMgrHandle")
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$104, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$104, DW_AT_decl_line(0x165)
	.dwattr $C$DW$104, DW_AT_decl_column(0x21)
$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$105, DW_AT_name("clientNotifyMgrGate")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("clientNotifyMgrGate")
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$105, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$105, DW_AT_decl_line(0x169)
	.dwattr $C$DW$105, DW_AT_decl_column(0x21)
$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$106, DW_AT_name("controlCacheUse")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("controlCacheUse")
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$106, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$106, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$106, DW_AT_decl_column(0x21)
$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$107, DW_AT_name("dataBufCacheUse")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("dataBufCacheUse")
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$107, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$107, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$107, DW_AT_decl_column(0x21)
$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$108, DW_AT_name("attrBufCacheUse")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("attrBufCacheUse")
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$108, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$108, DW_AT_decl_line(0x171)
	.dwattr $C$DW$108, DW_AT_decl_column(0x21)
$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$109, DW_AT_name("controlIntAllocated")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("controlIntAllocated")
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$109, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$109, DW_AT_decl_line(0x173)
	.dwattr $C$DW$109, DW_AT_decl_column(0x21)
$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$110, DW_AT_name("dataBufIntAllocated")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("dataBufIntAllocated")
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$110, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$110, DW_AT_decl_line(0x175)
	.dwattr $C$DW$110, DW_AT_decl_column(0x21)
$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$111, DW_AT_name("attrBufIntAllocated")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("attrBufIntAllocated")
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$111, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$111, DW_AT_decl_line(0x177)
	.dwattr $C$DW$111, DW_AT_decl_column(0x21)
$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$112, DW_AT_name("flags")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$112, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$112, DW_AT_decl_line(0x179)
	.dwattr $C$DW$112, DW_AT_decl_column(0x21)
	.dwendtag $C$DW$T$144

	.dwattr $C$DW$T$144, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x10)
$C$DW$T$334	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Obj")
	.dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$334, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$334, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$T$334, DW_AT_decl_column(0x02)

$C$DW$T$146	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$146, DW_AT_name("RingIOShm_Params_Tag")
	.dwattr $C$DW$T$146, DW_AT_byte_size(0x30)
$C$DW$113	.dwtag  DW_TAG_member
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$113, DW_AT_name("commonParams")
	.dwattr $C$DW$113, DW_AT_TI_symbol_name("commonParams")
	.dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$113, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$113, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$113, DW_AT_decl_column(0x14)
$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$114, DW_AT_name("ctrlRegionId")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("ctrlRegionId")
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$114, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$114, DW_AT_decl_column(0x11)
$C$DW$115	.dwtag  DW_TAG_member
	.dwattr $C$DW$115, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$115, DW_AT_name("dataRegionId")
	.dwattr $C$DW$115, DW_AT_TI_symbol_name("dataRegionId")
	.dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$115, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$115, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$115, DW_AT_decl_column(0x11)
$C$DW$116	.dwtag  DW_TAG_member
	.dwattr $C$DW$116, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$116, DW_AT_name("attrRegionId")
	.dwattr $C$DW$116, DW_AT_TI_symbol_name("attrRegionId")
	.dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$116, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$116, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$116, DW_AT_decl_column(0x11)
$C$DW$117	.dwtag  DW_TAG_member
	.dwattr $C$DW$117, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$117, DW_AT_name("ctrlSharedAddr")
	.dwattr $C$DW$117, DW_AT_TI_symbol_name("ctrlSharedAddr")
	.dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$117, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$117, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$117, DW_AT_decl_column(0x12)
$C$DW$118	.dwtag  DW_TAG_member
	.dwattr $C$DW$118, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$118, DW_AT_name("dataSharedAddr")
	.dwattr $C$DW$118, DW_AT_TI_symbol_name("dataSharedAddr")
	.dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$118, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$118, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$118, DW_AT_decl_column(0x12)
$C$DW$119	.dwtag  DW_TAG_member
	.dwattr $C$DW$119, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$119, DW_AT_name("dataSharedAddrSize")
	.dwattr $C$DW$119, DW_AT_TI_symbol_name("dataSharedAddrSize")
	.dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$119, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$119, DW_AT_decl_line(0xef)
	.dwattr $C$DW$119, DW_AT_decl_column(0x12)
$C$DW$120	.dwtag  DW_TAG_member
	.dwattr $C$DW$120, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$120, DW_AT_name("footBufSize")
	.dwattr $C$DW$120, DW_AT_TI_symbol_name("footBufSize")
	.dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$120, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$120, DW_AT_decl_column(0x12)
$C$DW$121	.dwtag  DW_TAG_member
	.dwattr $C$DW$121, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$121, DW_AT_name("attrSharedAddr")
	.dwattr $C$DW$121, DW_AT_TI_symbol_name("attrSharedAddr")
	.dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$121, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$121, DW_AT_decl_column(0x12)
$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$122, DW_AT_name("attrSharedAddrSize")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("attrSharedAddrSize")
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$122, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$122, DW_AT_decl_column(0x12)
$C$DW$123	.dwtag  DW_TAG_member
	.dwattr $C$DW$123, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$123, DW_AT_name("gateHandle")
	.dwattr $C$DW$123, DW_AT_TI_symbol_name("gateHandle")
	.dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$123, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$123, DW_AT_decl_column(0x14)
$C$DW$124	.dwtag  DW_TAG_member
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$124, DW_AT_name("localProtect")
	.dwattr $C$DW$124, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$124, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0x105)
	.dwattr $C$DW$124, DW_AT_decl_column(0x1b)
$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$125, DW_AT_name("remoteProtect")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$125, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0x107)
	.dwattr $C$DW$125, DW_AT_decl_column(0x1b)
$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$126, DW_AT_name("remoteProcId")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("remoteProcId")
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$126, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0x109)
	.dwattr $C$DW$126, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$146

	.dwattr $C$DW$T$146, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x10)
$C$DW$T$335	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Params")
	.dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$335, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIOShm.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x03)

$C$DW$T$147	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$147, DW_AT_name("RingIOShm_ProcAttrs_tag")
	.dwattr $C$DW$T$147, DW_AT_byte_size(0x04)
$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$127, DW_AT_name("creator")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("creator")
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$127, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$127, DW_AT_decl_column(0x0c)
$C$DW$128	.dwtag  DW_TAG_member
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$128, DW_AT_name("procId")
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$128, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$128, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$147

	.dwattr $C$DW$T$147, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x10)
$C$DW$T$143	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ProcAttrs")
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$143, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$143, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$143, DW_AT_decl_column(0x03)

$C$DW$T$167	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$167, DW_AT_name("RingIO_CfgFxns_tag")
	.dwattr $C$DW$T$167, DW_AT_byte_size(0x0c)
$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$155)
	.dwattr $C$DW$129, DW_AT_name("create")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("create")
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$129, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$129, DW_AT_decl_column(0x23)
$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$130, DW_AT_name("sharedMemReq")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("sharedMemReq")
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$130, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$130, DW_AT_decl_column(0x23)
$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$131, DW_AT_name("openByAddr")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("openByAddr")
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$131, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$131, DW_AT_decl_column(0x23)
	.dwendtag $C$DW$T$167

	.dwattr $C$DW$T$167, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$167, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$T$167, DW_AT_decl_column(0x10)
$C$DW$T$336	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_CfgFxns")
	.dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$167)
	.dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$336, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$336, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$T$336, DW_AT_decl_column(0x03)

$C$DW$T$337	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$337, DW_AT_byte_size(0x0c)
$C$DW$132	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$132, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$337


$C$DW$T$168	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$168, DW_AT_name("RingIO_Config_Tag")
	.dwattr $C$DW$T$168, DW_AT_byte_size(0x08)
$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$133, DW_AT_name("maxNameLen")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$133, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0x189)
	.dwattr $C$DW$133, DW_AT_decl_column(0x12)
$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$134, DW_AT_name("maxInstances")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$134, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$134, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$168

	.dwattr $C$DW$T$168, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$168, DW_AT_decl_line(0x188)
	.dwattr $C$DW$T$168, DW_AT_decl_column(0x10)
$C$DW$T$338	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Config")
	.dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$168)
	.dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$338, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x03)

$C$DW$T$339	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$339, DW_AT_name("RingIO_Flags_tag")
	.dwattr $C$DW$T$339, DW_AT_byte_size(0x01)
$C$DW$135	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_DATABUF_MAINTAINCACHE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$135, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$135, DW_AT_decl_column(0x05)
$C$DW$136	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NEED_EXACT_SIZE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$136, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$136, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$339

	.dwattr $C$DW$T$339, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x0e)
$C$DW$T$340	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Flags")
	.dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$340, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$340, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$T$340, DW_AT_decl_column(0x03)

$C$DW$T$171	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$171, DW_AT_name("RingIO_InterfaceAttrs_tag")
	.dwattr $C$DW$T$171, DW_AT_byte_size(0x01)
$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$137, DW_AT_name("type")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$137, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$137, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$171

	.dwattr $C$DW$T$171, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x10)
$C$DW$T$130	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_InterfaceAttrs")
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$130, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$130, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$T$130, DW_AT_decl_column(0x03)

$C$DW$T$172	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$172, DW_AT_name("RingIO_NameServerEntry_tag")
	.dwattr $C$DW$T$172, DW_AT_byte_size(0x08)
$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$138, DW_AT_name("procId")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$138, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$138, DW_AT_decl_column(0x1c)
$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$139, DW_AT_name("ctrlSharedSrPtr")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("ctrlSharedSrPtr")
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$139, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$139, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$172

	.dwattr $C$DW$T$172, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$172, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$172, DW_AT_decl_column(0x10)
$C$DW$T$341	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_NameServerEntry")
	.dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$341, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$341, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$341, DW_AT_decl_column(0x03)

$C$DW$T$342	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$342, DW_AT_name("RingIO_NotifyType_Tag")
	.dwattr $C$DW$T$342, DW_AT_byte_size(0x01)
$C$DW$140	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$140, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$140, DW_AT_decl_column(0x05)
$C$DW$141	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$141, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$141, DW_AT_decl_column(0x05)
$C$DW$142	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$142, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$142, DW_AT_decl_column(0x05)
$C$DW$143	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$143, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$143, DW_AT_decl_column(0x05)
$C$DW$144	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$144, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$144, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$342

	.dwattr $C$DW$T$342, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x0e)
$C$DW$T$343	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_NotifyType")
	.dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$T$343, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$343, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$343, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$T$343, DW_AT_decl_column(0x03)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("RingIO_Object")
	.dwattr $C$DW$T$21, DW_AT_declaration
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x175)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$135	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$135, DW_AT_address_class(0x20)
$C$DW$T$136	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Handle")
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$136, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$136, DW_AT_decl_line(0x175)
	.dwattr $C$DW$T$136, DW_AT_decl_column(0x23)
$C$DW$T$152	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$T$152, DW_AT_address_class(0x20)

$C$DW$T$174	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$174, DW_AT_name("RingIO_OpenMode_Tag")
	.dwattr $C$DW$T$174, DW_AT_byte_size(0x01)
$C$DW$145	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_MODE_READER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$145, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$145, DW_AT_decl_column(0x05)
$C$DW$146	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_MODE_WRITER"), DW_AT_const_value(0x01)
	.dwattr $C$DW$146, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$146, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$174

	.dwattr $C$DW$T$174, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$174, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$174, DW_AT_decl_column(0x0e)
$C$DW$T$175	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_OpenMode")
	.dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$175, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$175, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$T$175, DW_AT_decl_column(0x03)

$C$DW$T$173	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$173, DW_AT_name("RingIO_Params_Tag")
	.dwattr $C$DW$T$173, DW_AT_byte_size(0x08)
$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$147, DW_AT_name("name")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x196)
	.dwattr $C$DW$147, DW_AT_decl_column(0x13)
$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$148, DW_AT_name("interfaceType")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("interfaceType")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x198)
	.dwattr $C$DW$148, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$173

	.dwattr $C$DW$T$173, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$173, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$173, DW_AT_decl_column(0x10)
$C$DW$T$145	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Params")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x03)

$C$DW$T$169	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$169, DW_AT_name("RingIO_Type_Tag")
	.dwattr $C$DW$T$169, DW_AT_byte_size(0x01)
$C$DW$149	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_Type_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$149, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$149, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$169

	.dwattr $C$DW$T$169, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$169, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$T$169, DW_AT_decl_column(0x0e)
$C$DW$T$170	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Type")
	.dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$170, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x03)

$C$DW$T$176	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$176, DW_AT_name("RingIO_openParams_Tag")
	.dwattr $C$DW$T$176, DW_AT_byte_size(0x08)
$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$150, DW_AT_name("flags")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x1ab)
	.dwattr $C$DW$150, DW_AT_decl_column(0x11)
$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$175)
	.dwattr $C$DW$151, DW_AT_name("openMode")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("openMode")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$151, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$176

	.dwattr $C$DW$T$176, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$176, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$T$176, DW_AT_decl_column(0x10)
$C$DW$T$161	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_openParams")
	.dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$161, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x03)
$C$DW$T$162	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
$C$DW$T$163	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
	.dwattr $C$DW$T$163, DW_AT_address_class(0x20)

$C$DW$T$177	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$177, DW_AT_name("RingIO_sharedMemReqDetails_tag")
	.dwattr $C$DW$T$177, DW_AT_byte_size(0x0c)
$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$152, DW_AT_name("ctrlSharedMemReq")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("ctrlSharedMemReq")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$152, DW_AT_decl_column(0x14)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$153, DW_AT_name("dataSharedMemReq")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("dataSharedMemReq")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$153, DW_AT_decl_column(0x14)
$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$154, DW_AT_name("attrSharedMemReq")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("attrSharedMemReq")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$154, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$177

