;******************************************************************************
;* TMS470 C/C++ Codegen                                           Unix v4.9.5 *
;* Date/Time created: Wed Apr  3 11:43:15 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=2 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("FrameQBufMgr.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS470 C/C++ Codegen Unix v4.9.5 Copyright (c) 1996-2012 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/sksung/work/udx/ch2/ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/cgt470_4_9_5/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)
$C$DW$3	.dwtag  DW_TAG_formal_parameter

	.dwattr $C$DW$790, DW_AT_decl_line(0x95)
	.dwattr $C$DW$790, DW_AT_decl_column(0x05)
$C$DW$791	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$791, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$791, DW_AT_decl_line(0x97)
	.dwattr $C$DW$791, DW_AT_decl_column(0x05)
$C$DW$792	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$792, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$792, DW_AT_decl_line(0x99)
	.dwattr $C$DW$792, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1079

	.dwattr $C$DW$T$1079, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1079, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1079, DW_AT_decl_column(0x0e)
$C$DW$T$1080	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1080, DW_AT_type(*$C$DW$T$1079)
	.dwattr $C$DW$T$1080, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1080, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1080, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1080, DW_AT_decl_column(0x03)

$C$DW$T$1081	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1081, DW_AT_byte_size(0x04)
$C$DW$793	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$793, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$793, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$793, DW_AT_decl_column(0x05)
$C$DW$794	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$794, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$794, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$794, DW_AT_decl_column(0x05)
$C$DW$795	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$795, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$795, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$795, DW_AT_decl_column(0x05)
$C$DW$796	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$796, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$796, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$796, DW_AT_decl_column(0x05)
$C$DW$797	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$797, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$797, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$797, DW_AT_decl_column(0x05)
$C$DW$798	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$798, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$798, DW_AT_decl_line(0xab)
	.dwattr $C$DW$798, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1081

	.dwattr $C$DW$T$1081, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1081, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1081, DW_AT_decl_column(0x0e)
$C$DW$T$1082	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1082, DW_AT_type(*$C$DW$T$1081)
	.dwattr $C$DW$T$1082, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1082, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1082, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1082, DW_AT_decl_column(0x03)

$C$DW$T$1083	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1083, DW_AT_byte_size(0x01)
$C$DW$799	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$799, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$799, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$799, DW_AT_decl_column(0x05)
$C$DW$800	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$800, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$800, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$800, DW_AT_decl_column(0x05)
$C$DW$801	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$801, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$801, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$801, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1083

	.dwattr $C$DW$T$1083, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1083, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1083, DW_AT_decl_column(0x0e)
$C$DW$T$1084	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1084, DW_AT_type(*$C$DW$T$1083)
	.dwattr $C$DW$T$1084, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1084, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1084, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1084, DW_AT_decl_column(0x03)

$C$DW$T$285	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$285, DW_AT_byte_size(0x04)
$C$DW$802	.dwtag  DW_TAG_member
	.dwattr $C$DW$802, DW_AT_type(*$C$DW$T$284)
	.dwattr $C$DW$802, DW_AT_name("fxns")
	.dwattr $C$DW$802, DW_AT_TI_symbol_name("fxns")
	.dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$802, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$802, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$802, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$285

	.dwattr $C$DW$T$285, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$T$285, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$285, DW_AT_decl_column(0x10)
$C$DW$T$1085	.dwtag  DW_TAG_typedef, DW_AT_name("IFrameQBufMgr_Object")
	.dwattr $C$DW$T$1085, DW_AT_type(*$C$DW$T$285)
	.dwattr $C$DW$T$1085, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1085, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$T$1085, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$1085, DW_AT_decl_column(0x02)

$C$DW$T$290	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$290, DW_AT_byte_size(0x08)
$C$DW$803	.dwtag  DW_TAG_member
	.dwattr $C$DW$803, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$803, DW_AT_name("length")
	.dwattr $C$DW$803, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$803, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$803, DW_AT_decl_line(0xad)
	.dwattr $C$DW$803, DW_AT_decl_column(0x16)
$C$DW$804	.dwtag  DW_TAG_member
	.dwattr $C$DW$804, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$804, DW_AT_name("elem")
	.dwattr $C$DW$804, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$804, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$804, DW_AT_decl_line(0xad)
	.dwattr $C$DW$804, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$290

	.dwattr $C$DW$T$290, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$290, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$290, DW_AT_decl_column(0x10)
$C$DW$T$1087	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1087, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$T$1087, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1087, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1087, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1087, DW_AT_decl_column(0x43)
$C$DW$T$1088	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1088, DW_AT_type(*$C$DW$T$1087)
	.dwattr $C$DW$T$1088, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1088, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1088, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1088, DW_AT_decl_column(0x30)
$C$DW$T$1089	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1089, DW_AT_type(*$C$DW$T$1088)
	.dwattr $C$DW$T$1089, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1089, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1089, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1089, DW_AT_decl_column(0x2c)

$C$DW$T$291	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$291, DW_AT_byte_size(0x08)
$C$DW$805	.dwtag  DW_TAG_member
	.dwattr $C$DW$805, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$805, DW_AT_name("length")
	.dwattr $C$DW$805, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$805, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$805, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$805, DW_AT_decl_column(0x16)
$C$DW$806	.dwtag  DW_TAG_member
	.dwattr $C$DW$806, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$806, DW_AT_name("elem")
	.dwattr $C$DW$806, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$806, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$806, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$806, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$291

	.dwattr $C$DW$T$291, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$291, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$291, DW_AT_decl_column(0x10)
$C$DW$T$1090	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1090, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$T$1090, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1090, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1090, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1090, DW_AT_decl_column(0x43)
$C$DW$T$1091	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$1090)
	.dwattr $C$DW$T$1091, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1091, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1091, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1091, DW_AT_decl_column(0x2f)
$C$DW$T$1092	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1092, DW_AT_type(*$C$DW$T$1091)
	.dwattr $C$DW$T$1092, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1092, DW_AT_decl_file("/home/sksung/work/udx/ch2/ti_tools/xdctools_3_23_03_53/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1092, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1092, DW_AT_decl_column(0x2b)

$C$DW$T$294	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$294, DW_AT_byte_size(0x08)
$C$DW$807	.dwtag  DW_TAG_member
	.dwattr $C$DW$807, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$807, DW_AT_name("length")
	.dwattr $C$DW$807, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$807, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$807, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$807, DW_AT_decl_column(0x16)
$C$DW$808	.dwtag  DW_TAG_member
	.dwattr $C$DW$808, DW_AT_type(*$C$DW$T$293)
	.dwattr $C$DW$808, DW_AT_name("elem")
	.dwattr $C$DW$808, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$808, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$808, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$808, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$294

	.dwattr $C$DW$T$294, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$294, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$294, DW_AT_decl_column(0x10)
$C$DW$T$1093	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1093, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$T$1093, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1093, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1093, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$T$1093, DW_AT_decl_column(0x42)
$C$DW$T$1094	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$1093)
	.dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1094, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1094, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$1094, DW_AT_decl_column(0x2b)
$C$DW$T$1095	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$1094)
	.dwattr $C$DW$T$1095, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1095, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1095, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$1095, DW_AT_decl_column(0x27)

$C$DW$T$297	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$297, DW_AT_byte_size(0x08)
$C$DW$809	.dwtag  DW_TAG_member
	.dwattr $C$DW$809, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$809, DW_AT_name("length")
	.dwattr $C$DW$809, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$809, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$809, DW_AT_decl_line(0x167)
	.dwattr $C$DW$809, DW_AT_decl_column(0x16)
$C$DW$810	.dwtag  DW_TAG_member
	.dwattr $C$DW$810, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$810, DW_AT_name("elem")
	.dwattr $C$DW$810, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$810, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$810, DW_AT_decl_line(0x167)
	.dwattr $C$DW$810, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$297

	.dwattr $C$DW$T$297, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$297, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$297, DW_AT_decl_column(0x10)
$C$DW$T$1096	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$297)
	.dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1096, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1096, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$1096, DW_AT_decl_column(0x43)
$C$DW$T$1097	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1097, DW_AT_type(*$C$DW$T$1096)
	.dwattr $C$DW$T$1097, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1097, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1097, DW_AT_decl_line(0x168)
	.dwattr $C$DW$T$1097, DW_AT_decl_column(0x2c)
$C$DW$T$1098	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1098, DW_AT_type(*$C$DW$T$1097)
	.dwattr $C$DW$T$1098, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1098, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/bios_6_33_05_46/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1098, DW_AT_decl_line(0x169)
	.dwattr $C$DW$T$1098, DW_AT_decl_column(0x28)

$C$DW$T$299	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$299, DW_AT_byte_size(0x14)
$C$DW$811	.dwtag  DW_TAG_member
	.dwattr $C$DW$811, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$811, DW_AT_name("shMemParams")
	.dwattr $C$DW$811, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$811, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$811, DW_AT_decl_line(0x112)
	.dwattr $C$DW$811, DW_AT_decl_column(0x37)
	.dwendtag $C$DW$T$299

	.dwattr $C$DW$T$299, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$299, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$299, DW_AT_decl_column(0x08)

$C$DW$T$1099	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1099, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1099, DW_AT_byte_size(0x01)
$C$DW$812	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$812, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$812, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$812, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1099

	.dwattr $C$DW$T$1099, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1099, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1099, DW_AT_decl_column(0x0e)
$C$DW$T$1100	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1100, DW_AT_type(*$C$DW$T$1099)
	.dwattr $C$DW$T$1100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1100, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1100, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1100, DW_AT_decl_column(0x03)

$C$DW$T$308	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$308, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$308, DW_AT_byte_size(0x10)
$C$DW$813	.dwtag  DW_TAG_member
	.dwattr $C$DW$813, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$813, DW_AT_name("gate")
	.dwattr $C$DW$813, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$813, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$813, DW_AT_decl_line(0x87)
	.dwattr $C$DW$813, DW_AT_decl_column(0x1b)
$C$DW$814	.dwtag  DW_TAG_member
	.dwattr $C$DW$814, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$814, DW_AT_name("numProcessors")
	.dwattr $C$DW$814, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$814, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$814, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$814, DW_AT_decl_column(0x0f)
$C$DW$815	.dwtag  DW_TAG_member
	.dwattr $C$DW$815, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$815, DW_AT_name("procIds")
	.dwattr $C$DW$815, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$815, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$815, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$815, DW_AT_decl_column(0x0f)
$C$DW$816	.dwtag  DW_TAG_member
	.dwattr $C$DW$816, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$816, DW_AT_name("drvHandles")
	.dwattr $C$DW$816, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$816, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$816, DW_AT_decl_line(0x93)
	.dwattr $C$DW$816, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$308

	.dwattr $C$DW$T$308, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$308, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$308, DW_AT_decl_column(0x10)
$C$DW$T$1101	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1101, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$T$1101, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1101, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1101, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1101, DW_AT_decl_column(0x03)

$C$DW$T$1102	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1102, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1102, DW_AT_byte_size(0x01)
$C$DW$817	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$817, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$817, DW_AT_decl_line(0x61)
	.dwattr $C$DW$817, DW_AT_decl_column(0x05)
$C$DW$818	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$818, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$818, DW_AT_decl_line(0x63)
	.dwattr $C$DW$818, DW_AT_decl_column(0x05)
$C$DW$819	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$819, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$819, DW_AT_decl_line(0x65)
	.dwattr $C$DW$819, DW_AT_decl_column(0x05)
$C$DW$820	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$820, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$820, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$820, DW_AT_decl_column(0x05)
$C$DW$821	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$821, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$821, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$821, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1102

	.dwattr $C$DW$T$1102, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1102, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1102, DW_AT_decl_column(0x0e)
$C$DW$T$1103	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1103, DW_AT_type(*$C$DW$T$1102)
	.dwattr $C$DW$T$1103, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1103, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1103, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1103, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$1104	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1104, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1104, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1104, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1104, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1104, DW_AT_decl_column(0x27)
$C$DW$T$1105	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1105, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1105, DW_AT_address_class(0x20)
$C$DW$T$1106	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$1106, DW_AT_type(*$C$DW$T$1105)
	.dwattr $C$DW$T$1106, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1106, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1106, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$1106, DW_AT_decl_column(0x29)

$C$DW$T$321	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$321, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$321, DW_AT_byte_size(0x2c)
$C$DW$822	.dwtag  DW_TAG_member
	.dwattr $C$DW$822, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$822, DW_AT_name("name")
	.dwattr $C$DW$822, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$822, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$822, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$822, DW_AT_decl_column(0x14)
$C$DW$823	.dwtag  DW_TAG_member
	.dwattr $C$DW$823, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$823, DW_AT_name("eventNo")
	.dwattr $C$DW$823, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$823, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$823, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$823, DW_AT_decl_column(0x14)
$C$DW$824	.dwtag  DW_TAG_member
	.dwattr $C$DW$824, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$824, DW_AT_name("openFlag")
	.dwattr $C$DW$824, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$824, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$824, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$824, DW_AT_decl_column(0x14)
$C$DW$825	.dwtag  DW_TAG_member
	.dwattr $C$DW$825, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$825, DW_AT_name("creatorProcId")
	.dwattr $C$DW$825, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$825, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$825, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$825, DW_AT_decl_column(0x14)
$C$DW$826	.dwtag  DW_TAG_member
	.dwattr $C$DW$826, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$826, DW_AT_name("sharedAddr")
	.dwattr $C$DW$826, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$826, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$826, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$826, DW_AT_decl_column(0x14)
$C$DW$827	.dwtag  DW_TAG_member
	.dwattr $C$DW$827, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$827, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$827, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$827, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$827, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$827, DW_AT_decl_column(0x14)
$C$DW$828	.dwtag  DW_TAG_member
	.dwattr $C$DW$828, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$828, DW_AT_name("gate")
	.dwattr $C$DW$828, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$828, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$828, DW_AT_decl_line(0xac)
	.dwattr $C$DW$828, DW_AT_decl_column(0x14)
$C$DW$829	.dwtag  DW_TAG_member
	.dwattr $C$DW$829, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$829, DW_AT_name("cacheFlags")
	.dwattr $C$DW$829, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$829, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$829, DW_AT_decl_line(0xae)
	.dwattr $C$DW$829, DW_AT_decl_column(0x14)
$C$DW$830	.dwtag  DW_TAG_member
	.dwattr $C$DW$830, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$830, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$830, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$830, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$830, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$830, DW_AT_decl_column(0x14)
$C$DW$831	.dwtag  DW_TAG_member
	.dwattr $C$DW$831, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$831, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$831, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$831, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$831, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$831, DW_AT_decl_column(0x14)
$C$DW$832	.dwtag  DW_TAG_member
	.dwattr $C$DW$832, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$832, DW_AT_name("regionId")
	.dwattr $C$DW$832, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$832, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$832, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$832, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$321

	.dwattr $C$DW$T$321, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$321, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$321, DW_AT_decl_column(0x10)
$C$DW$T$1107	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1107, DW_AT_type(*$C$DW$T$321)
	.dwattr $C$DW$T$1107, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1107, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1107, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1107, DW_AT_decl_column(0x03)

$C$DW$T$325	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$325, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$325, DW_AT_byte_size(0x1c)
$C$DW$833	.dwtag  DW_TAG_member
	.dwattr $C$DW$833, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$833, DW_AT_name("clientHandle")
	.dwattr $C$DW$833, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$833, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$833, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$833, DW_AT_decl_column(0x12)
$C$DW$834	.dwtag  DW_TAG_member
	.dwattr $C$DW$834, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$834, DW_AT_name("procId")
	.dwattr $C$DW$834, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$834, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$834, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$834, DW_AT_decl_column(0x12)
$C$DW$835	.dwtag  DW_TAG_member
	.dwattr $C$DW$835, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$835, DW_AT_name("notifyType")
	.dwattr $C$DW$835, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$835, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$835, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$835, DW_AT_decl_column(0x12)
$C$DW$836	.dwtag  DW_TAG_member
	.dwattr $C$DW$836, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$836, DW_AT_name("fxnPtr")
	.dwattr $C$DW$836, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$836, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$836, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$836, DW_AT_decl_column(0x1d)
$C$DW$837	.dwtag  DW_TAG_member
	.dwattr $C$DW$837, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$837, DW_AT_name("cbContext")
	.dwattr $C$DW$837, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$837, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$837, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$837, DW_AT_decl_column(0x12)
$C$DW$838	.dwtag  DW_TAG_member
	.dwattr $C$DW$838, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$838, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$838, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$838, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$838, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$838, DW_AT_decl_column(0x12)
$C$DW$839	.dwtag  DW_TAG_member
	.dwattr $C$DW$839, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$839, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$839, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$839, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$839, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$839, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$325

	.dwattr $C$DW$T$325, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x10)
$C$DW$T$1108	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1108, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$T$1108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1108, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1108, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1108, DW_AT_decl_column(0x03)

$C$DW$T$464	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$464, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$464, DW_AT_byte_size(0x01)
$C$DW$840	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$840, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$840, DW_AT_decl_line(0x162)
	.dwattr $C$DW$840, DW_AT_decl_column(0x05)
$C$DW$841	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$841, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$841, DW_AT_decl_line(0x166)
	.dwattr $C$DW$841, DW_AT_decl_column(0x05)
$C$DW$842	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$842, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$842, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$842, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$464

	.dwattr $C$DW$T$464, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$464, DW_AT_decl_line(0x161)
	.dwattr $C$DW$T$464, DW_AT_decl_column(0x0e)
$C$DW$T$465	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$465, DW_AT_type(*$C$DW$T$464)
	.dwattr $C$DW$T$465, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$465, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$465, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$T$465, DW_AT_decl_column(0x02)

$C$DW$T$331	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$331, DW_AT_name("FrameQBufMgr_Attrs_Tag")
	.dwattr $C$DW$T$331, DW_AT_byte_size(0x48)
$C$DW$843	.dwtag  DW_TAG_member
	.dwattr $C$DW$843, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$843, DW_AT_name("status")
	.dwattr $C$DW$843, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$843, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$843, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$843, DW_AT_decl_column(0x1a)
$C$DW$844	.dwtag  DW_TAG_member
	.dwattr $C$DW$844, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$844, DW_AT_name("version")
	.dwattr $C$DW$844, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$844, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$844, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$844, DW_AT_decl_column(0x1a)
$C$DW$845	.dwtag  DW_TAG_member
	.dwattr $C$DW$845, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$845, DW_AT_name("localProtect")
	.dwattr $C$DW$845, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$845, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$845, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$845, DW_AT_decl_column(0x1a)
$C$DW$846	.dwtag  DW_TAG_member
	.dwattr $C$DW$846, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$846, DW_AT_name("remoteProtect")
	.dwattr $C$DW$846, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$846, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$846, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$846, DW_AT_decl_column(0x1a)
$C$DW$847	.dwtag  DW_TAG_member
	.dwattr $C$DW$847, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$847, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$847, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$847, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$847, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$847, DW_AT_decl_column(0x1a)
$C$DW$848	.dwtag  DW_TAG_member
	.dwattr $C$DW$848, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$848, DW_AT_name("name")
	.dwattr $C$DW$848, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$848, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$848, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$848, DW_AT_decl_column(0x1a)
$C$DW$849	.dwtag  DW_TAG_member
	.dwattr $C$DW$849, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$849, DW_AT_name("sharedDataBufAddr")
	.dwattr $C$DW$849, DW_AT_TI_symbol_name("sharedDataBufAddr")
	.dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$849, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$849, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$849, DW_AT_decl_column(0x17)
$C$DW$850	.dwtag  DW_TAG_member
	.dwattr $C$DW$850, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$850, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$850, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$850, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$850, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$850, DW_AT_decl_column(0x18)
$C$DW$851	.dwtag  DW_TAG_member
	.dwattr $C$DW$851, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$851, DW_AT_name("numFreeFramePools")
	.dwattr $C$DW$851, DW_AT_TI_symbol_name("numFreeFramePools")
	.dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$851, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$851, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$851, DW_AT_decl_column(0x17)
$C$DW$852	.dwtag  DW_TAG_member
	.dwattr $C$DW$852, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$852, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$852, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$852, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$852, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$852, DW_AT_decl_column(0x1a)
$C$DW$853	.dwtag  DW_TAG_member
	.dwattr $C$DW$853, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$853, DW_AT_name("entryId")
	.dwattr $C$DW$853, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$853, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$853, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$853, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$331

	.dwattr $C$DW$T$331, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$331, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$331, DW_AT_decl_column(0x10)
$C$DW$T$1109	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Attrs")
	.dwattr $C$DW$T$1109, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$T$1109, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1109, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1109, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$1109, DW_AT_decl_column(0x03)
$C$DW$T$1110	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Attrs")
	.dwattr $C$DW$T$1110, DW_AT_type(*$C$DW$T$1109)
	.dwattr $C$DW$T$1110, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1110, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1110, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$1110, DW_AT_decl_column(0x27)

$C$DW$T$466	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$466, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$466, DW_AT_byte_size(0x01)
$C$DW$854	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$854, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$854, DW_AT_decl_line(0x156)
	.dwattr $C$DW$854, DW_AT_decl_column(0x05)
$C$DW$855	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$855, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$855, DW_AT_decl_line(0x158)
	.dwattr $C$DW$855, DW_AT_decl_column(0x05)
$C$DW$856	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$856, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$856, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$856, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$466

	.dwattr $C$DW$T$466, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$466, DW_AT_decl_line(0x155)
	.dwattr $C$DW$T$466, DW_AT_decl_column(0x0e)
$C$DW$T$467	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$467, DW_AT_type(*$C$DW$T$466)
	.dwattr $C$DW$T$467, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$467, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$467, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$T$467, DW_AT_decl_column(0x02)

$C$DW$T$332	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$332, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$332, DW_AT_byte_size(0x0c)
$C$DW$857	.dwtag  DW_TAG_member
	.dwattr $C$DW$857, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$857, DW_AT_name("name")
	.dwattr $C$DW$857, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$857, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$857, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$857, DW_AT_decl_column(0x11)
$C$DW$858	.dwtag  DW_TAG_member
	.dwattr $C$DW$858, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$858, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$858, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$858, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$858, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$858, DW_AT_decl_column(0x11)
$C$DW$859	.dwtag  DW_TAG_member
	.dwattr $C$DW$859, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$859, DW_AT_name("sharedAddr")
	.dwattr $C$DW$859, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$859, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$859, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$859, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$332

	.dwattr $C$DW$T$332, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$332, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$T$332, DW_AT_decl_column(0x10)
$C$DW$T$380	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$380, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$T$380, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$380, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$380, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$T$380, DW_AT_decl_column(0x03)

$C$DW$T$333	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$333, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$333, DW_AT_byte_size(0x0c)
$C$DW$860	.dwtag  DW_TAG_member
	.dwattr $C$DW$860, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$860, DW_AT_name("eventNo")
	.dwattr $C$DW$860, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$860, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$860, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$860, DW_AT_decl_column(0x0c)
$C$DW$861	.dwtag  DW_TAG_member
	.dwattr $C$DW$861, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$861, DW_AT_name("maxInstances")
	.dwattr $C$DW$861, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$861, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$861, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$861, DW_AT_decl_column(0x0c)
$C$DW$862	.dwtag  DW_TAG_member
	.dwattr $C$DW$862, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$862, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$862, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$862, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$862, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$862, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$333

	.dwattr $C$DW$T$333, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x10)
$C$DW$T$358	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$358, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$358, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$T$358, DW_AT_decl_column(0x03)
$C$DW$T$1111	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Config")
	.dwattr $C$DW$T$1111, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$T$1111, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1111, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1111, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$1111, DW_AT_decl_column(0x27)
$C$DW$T$1112	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1112, DW_AT_type(*$C$DW$T$1111)
	.dwattr $C$DW$T$1112, DW_AT_address_class(0x20)
$C$DW$T$1113	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1113, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$T$1113, DW_AT_address_class(0x20)

$C$DW$T$1114	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1114, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$1114, DW_AT_byte_size(0x04)
$C$DW$863	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$863, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$863, DW_AT_decl_line(0x130)
	.dwattr $C$DW$863, DW_AT_decl_column(0x09)
$C$DW$864	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$864, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$864, DW_AT_decl_line(0x134)
	.dwattr $C$DW$864, DW_AT_decl_column(0x09)
$C$DW$865	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$865, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$865, DW_AT_decl_line(0x138)
	.dwattr $C$DW$865, DW_AT_decl_column(0x09)
$C$DW$866	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$866, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$866, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$866, DW_AT_decl_column(0x09)
$C$DW$867	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$867, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$867, DW_AT_decl_line(0x140)
	.dwattr $C$DW$867, DW_AT_decl_column(0x09)
$C$DW$868	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$868, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$868, DW_AT_decl_line(0x144)
	.dwattr $C$DW$868, DW_AT_decl_column(0x09)
$C$DW$869	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$869, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$869, DW_AT_decl_line(0x148)
	.dwattr $C$DW$869, DW_AT_decl_column(0x09)
$C$DW$870	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$870, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$870, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$870, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$1114

	.dwattr $C$DW$T$1114, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1114, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$T$1114, DW_AT_decl_column(0x0e)
$C$DW$T$1115	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$1115, DW_AT_type(*$C$DW$T$1114)
	.dwattr $C$DW$T$1115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1115, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1115, DW_AT_decl_line(0x150)
	.dwattr $C$DW$T$1115, DW_AT_decl_column(0x03)

$C$DW$T$336	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$336, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$336, DW_AT_byte_size(0x10)
$C$DW$871	.dwtag  DW_TAG_member
	.dwattr $C$DW$871, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$871, DW_AT_name("size")
	.dwattr $C$DW$871, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$871, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$871, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$871, DW_AT_decl_column(0x0c)
$C$DW$872	.dwtag  DW_TAG_member
	.dwattr $C$DW$872, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$872, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$872, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$872, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$872, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$872, DW_AT_decl_column(0x1c)
$C$DW$873	.dwtag  DW_TAG_member
	.dwattr $C$DW$873, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$873, DW_AT_name("name")
	.dwattr $C$DW$873, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$873, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$873, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$873, DW_AT_decl_column(0x0c)
$C$DW$874	.dwtag  DW_TAG_member
	.dwattr $C$DW$874, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$874, DW_AT_name("openFlag")
	.dwattr $C$DW$874, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$874, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$874, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$874, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$336

	.dwattr $C$DW$T$336, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$336, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$T$336, DW_AT_decl_column(0x10)
$C$DW$T$382	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$382, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$382, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$382, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$382, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$T$382, DW_AT_decl_column(0x03)

$C$DW$T$337	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$337, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$337, DW_AT_byte_size(0x14)
$C$DW$875	.dwtag  DW_TAG_member
	.dwattr $C$DW$875, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$875, DW_AT_name("size")
	.dwattr $C$DW$875, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$875, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$875, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$875, DW_AT_decl_column(0x0c)
$C$DW$876	.dwtag  DW_TAG_member
	.dwattr $C$DW$876, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$876, DW_AT_name("pixelFormat")
	.dwattr $C$DW$876, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$876, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$876, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$876, DW_AT_decl_column(0x0c)
$C$DW$877	.dwtag  DW_TAG_member
	.dwattr $C$DW$877, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$877, DW_AT_name("height")
	.dwattr $C$DW$877, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$877, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$877, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$877, DW_AT_decl_column(0x0c)
$C$DW$878	.dwtag  DW_TAG_member
	.dwattr $C$DW$878, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$878, DW_AT_name("width")
	.dwattr $C$DW$878, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$878, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$878, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$878, DW_AT_decl_column(0x0c)
$C$DW$879	.dwtag  DW_TAG_member
	.dwattr $C$DW$879, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$879, DW_AT_name("align")
	.dwattr $C$DW$879, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$879, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$879, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$879, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$337

	.dwattr $C$DW$T$337, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x10)
$C$DW$T$391	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$391, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$391, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$391, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$391, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$T$391, DW_AT_decl_column(0x02)
$C$DW$T$392	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$392, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$T$392, DW_AT_address_class(0x20)

$C$DW$T$393	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$393, DW_AT_type(*$C$DW$T$392)
	.dwattr $C$DW$T$393, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$393, DW_AT_byte_size(0x100)
$C$DW$880	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$880, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$393


$C$DW$T$1116	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1116, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$1116, DW_AT_byte_size(0x01)
$C$DW$881	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$881, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$881, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$881, DW_AT_decl_column(0x05)
$C$DW$882	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$882, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$882, DW_AT_decl_line(0x190)
	.dwattr $C$DW$882, DW_AT_decl_column(0x05)
$C$DW$883	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$883, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$883, DW_AT_decl_line(0x193)
	.dwattr $C$DW$883, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1116

	.dwattr $C$DW$T$1116, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1116, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$1116, DW_AT_decl_column(0x0e)
$C$DW$T$1117	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$1117, DW_AT_type(*$C$DW$T$1116)
	.dwattr $C$DW$T$1117, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1117, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1117, DW_AT_decl_line(0x194)
	.dwattr $C$DW$T$1117, DW_AT_decl_column(0x03)

$C$DW$T$1118	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1118, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$1118, DW_AT_byte_size(0x01)
$C$DW$884	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$884, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$884, DW_AT_decl_line(0x180)
	.dwattr $C$DW$884, DW_AT_decl_column(0x05)
$C$DW$885	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$885, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$885, DW_AT_decl_line(0x184)
	.dwattr $C$DW$885, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1118

	.dwattr $C$DW$T$1118, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1118, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$1118, DW_AT_decl_column(0x0e)
$C$DW$T$1119	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$1119, DW_AT_type(*$C$DW$T$1118)
	.dwattr $C$DW$T$1119, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1119, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1119, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$1119, DW_AT_decl_column(0x03)

$C$DW$T$352	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$352, DW_AT_name("FrameQBufMgr_FreeFramePoolObj_Tag")
	.dwattr $C$DW$T$352, DW_AT_byte_size(0x2b4)
$C$DW$886	.dwtag  DW_TAG_member
	.dwattr $C$DW$886, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$886, DW_AT_name("numFrms")
	.dwattr $C$DW$886, DW_AT_TI_symbol_name("numFrms")
	.dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$886, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$886, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$886, DW_AT_decl_column(0x15)
$C$DW$887	.dwtag  DW_TAG_member
	.dwattr $C$DW$887, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$887, DW_AT_name("freeFrms")
	.dwattr $C$DW$887, DW_AT_TI_symbol_name("freeFrms")
	.dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$887, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$887, DW_AT_decl_line(0xde)
	.dwattr $C$DW$887, DW_AT_decl_column(0x15)
$C$DW$888	.dwtag  DW_TAG_member
	.dwattr $C$DW$888, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$888, DW_AT_name("numFrmHdrBufs")
	.dwattr $C$DW$888, DW_AT_TI_symbol_name("numFrmHdrBufs")
	.dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$888, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$888, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$888, DW_AT_decl_column(0x15)
$C$DW$889	.dwtag  DW_TAG_member
	.dwattr $C$DW$889, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$889, DW_AT_name("freeFrmHdrBufs")
	.dwattr $C$DW$889, DW_AT_TI_symbol_name("freeFrmHdrBufs")
	.dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$889, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$889, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$889, DW_AT_decl_column(0x15)
$C$DW$890	.dwtag  DW_TAG_member
	.dwattr $C$DW$890, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$890, DW_AT_name("frmHdrBufSize")
	.dwattr $C$DW$890, DW_AT_TI_symbol_name("frmHdrBufSize")
	.dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$890, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$890, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$890, DW_AT_decl_column(0x15)
$C$DW$891	.dwtag  DW_TAG_member
	.dwattr $C$DW$891, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$891, DW_AT_name("numBufsInFrame")
	.dwattr $C$DW$891, DW_AT_TI_symbol_name("numBufsInFrame")
	.dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$891, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$891, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$891, DW_AT_decl_column(0x15)
$C$DW$892	.dwtag  DW_TAG_member
	.dwattr $C$DW$892, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$892, DW_AT_name("numDynamicHdrBufs")
	.dwattr $C$DW$892, DW_AT_TI_symbol_name("numDynamicHdrBufs")
	.dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$892, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$892, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$892, DW_AT_decl_column(0x15)
$C$DW$893	.dwtag  DW_TAG_member
	.dwattr $C$DW$893, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$893, DW_AT_name("freeDynamicHdrBufs")
	.dwattr $C$DW$893, DW_AT_TI_symbol_name("freeDynamicHdrBufs")
	.dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$893, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$893, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$893, DW_AT_decl_column(0x15)
$C$DW$894	.dwtag  DW_TAG_member
	.dwattr $C$DW$894, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$894, DW_AT_name("numDynamicFrames")
	.dwattr $C$DW$894, DW_AT_TI_symbol_name("numDynamicFrames")
	.dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$894, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$894, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$894, DW_AT_decl_column(0x15)
$C$DW$895	.dwtag  DW_TAG_member
	.dwattr $C$DW$895, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$895, DW_AT_name("freeDynamicFrames")
	.dwattr $C$DW$895, DW_AT_TI_symbol_name("freeDynamicFrames")
	.dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$895, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$895, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$895, DW_AT_decl_column(0x15)
$C$DW$896	.dwtag  DW_TAG_member
	.dwattr $C$DW$896, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$896, DW_AT_name("frmStartAddrp")
	.dwattr $C$DW$896, DW_AT_TI_symbol_name("frmStartAddrp")
	.dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$896, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$896, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$896, DW_AT_decl_column(0x15)
$C$DW$897	.dwtag  DW_TAG_member
	.dwattr $C$DW$897, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$897, DW_AT_name("frmEndAddrp")
	.dwattr $C$DW$897, DW_AT_TI_symbol_name("frmEndAddrp")
	.dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$897, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$897, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$897, DW_AT_decl_column(0x15)
$C$DW$898	.dwtag  DW_TAG_member
	.dwattr $C$DW$898, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$898, DW_AT_name("hdrBufStartAddrp")
	.dwattr $C$DW$898, DW_AT_TI_symbol_name("hdrBufStartAddrp")
	.dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$898, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$898, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$898, DW_AT_decl_column(0x15)
$C$DW$899	.dwtag  DW_TAG_member
	.dwattr $C$DW$899, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$899, DW_AT_name("hdrBufEndAddrp")
	.dwattr $C$DW$899, DW_AT_TI_symbol_name("hdrBufEndAddrp")
	.dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$899, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$899, DW_AT_decl_line(0xea)
	.dwattr $C$DW$899, DW_AT_decl_column(0x15)
$C$DW$900	.dwtag  DW_TAG_member
	.dwattr $C$DW$900, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$900, DW_AT_name("frmBufsStartAddrp")
	.dwattr $C$DW$900, DW_AT_TI_symbol_name("frmBufsStartAddrp")
	.dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$900, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$900, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$900, DW_AT_decl_column(0x15)
$C$DW$901	.dwtag  DW_TAG_member
	.dwattr $C$DW$901, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$901, DW_AT_name("frmBufsEndAddrp")
	.dwattr $C$DW$901, DW_AT_TI_symbol_name("frmBufsEndAddrp")
	.dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$901, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$901, DW_AT_decl_line(0xec)
	.dwattr $C$DW$901, DW_AT_decl_column(0x15)
$C$DW$902	.dwtag  DW_TAG_member
	.dwattr $C$DW$902, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$902, DW_AT_name("frmBufSize")
	.dwattr $C$DW$902, DW_AT_TI_symbol_name("frmBufSize")
	.dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$902, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$902, DW_AT_decl_line(0xed)
	.dwattr $C$DW$902, DW_AT_decl_column(0x15)
$C$DW$903	.dwtag  DW_TAG_member
	.dwattr $C$DW$903, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$903, DW_AT_name("frmRefCnt")
	.dwattr $C$DW$903, DW_AT_TI_symbol_name("frmRefCnt")
	.dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$903, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$903, DW_AT_decl_line(0xee)
	.dwattr $C$DW$903, DW_AT_decl_column(0x15)
$C$DW$904	.dwtag  DW_TAG_member
	.dwattr $C$DW$904, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$904, DW_AT_name("dynFrame")
	.dwattr $C$DW$904, DW_AT_TI_symbol_name("dynFrame")
	.dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$904, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$904, DW_AT_decl_line(0xef)
	.dwattr $C$DW$904, DW_AT_decl_column(0x15)
$C$DW$905	.dwtag  DW_TAG_member
	.dwattr $C$DW$905, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$905, DW_AT_name("dynFrmRefCnt")
	.dwattr $C$DW$905, DW_AT_TI_symbol_name("dynFrmRefCnt")
	.dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$905, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$905, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$905, DW_AT_decl_column(0x15)
$C$DW$906	.dwtag  DW_TAG_member
	.dwattr $C$DW$906, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$906, DW_AT_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$906, DW_AT_TI_symbol_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$906, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$906, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$906, DW_AT_decl_column(0x15)
$C$DW$907	.dwtag  DW_TAG_member
	.dwattr $C$DW$907, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$907, DW_AT_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$907, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$907, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$907, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$907, DW_AT_decl_column(0x15)
$C$DW$908	.dwtag  DW_TAG_member
	.dwattr $C$DW$908, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$908, DW_AT_name("dynHdrBufs")
	.dwattr $C$DW$908, DW_AT_TI_symbol_name("dynHdrBufs")
	.dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$908, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$908, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$908, DW_AT_decl_column(0x15)
$C$DW$909	.dwtag  DW_TAG_member
	.dwattr $C$DW$909, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$909, DW_AT_name("hdrBufIsUsed")
	.dwattr $C$DW$909, DW_AT_TI_symbol_name("hdrBufIsUsed")
	.dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$909, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$909, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$909, DW_AT_decl_column(0x15)
$C$DW$910	.dwtag  DW_TAG_member
	.dwattr $C$DW$910, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$910, DW_AT_name("dynHdrBufIsUsed")
	.dwattr $C$DW$910, DW_AT_TI_symbol_name("dynHdrBufIsUsed")
	.dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$910, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$910, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$910, DW_AT_decl_column(0x15)
$C$DW$911	.dwtag  DW_TAG_member
	.dwattr $C$DW$911, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$911, DW_AT_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$911, DW_AT_TI_symbol_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x272]
	.dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$911, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$911, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$911, DW_AT_decl_column(0x15)
$C$DW$912	.dwtag  DW_TAG_member
	.dwattr $C$DW$912, DW_AT_type(*$C$DW$T$351)
	.dwattr $C$DW$912, DW_AT_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$912, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b2]
	.dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$912, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$912, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$912, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$352

	.dwattr $C$DW$T$352, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$352, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$352, DW_AT_decl_column(0x10)
$C$DW$T$1120	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FreeFramePoolObj")
	.dwattr $C$DW$T$1120, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$T$1120, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1120, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1120, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$1120, DW_AT_decl_column(0x03)
$C$DW$T$1121	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_FreeFramePoolObj")
	.dwattr $C$DW$T$1121, DW_AT_type(*$C$DW$T$1120)
	.dwattr $C$DW$T$1121, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1121, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1121, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$1121, DW_AT_decl_column(0x27)

$C$DW$T$334	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$334, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$334, DW_AT_byte_size(0x01)
$C$DW$913	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$913, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$913, DW_AT_decl_line(0x174)
	.dwattr $C$DW$913, DW_AT_decl_column(0x05)
$C$DW$914	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$914, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$914, DW_AT_decl_line(0x178)
	.dwattr $C$DW$914, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$334

	.dwattr $C$DW$T$334, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$334, DW_AT_decl_line(0x173)
	.dwattr $C$DW$T$334, DW_AT_decl_column(0x0e)
$C$DW$T$335	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$335, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x179)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x03)

$C$DW$T$361	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$361, DW_AT_name("FrameQBufMgr_ModuleObject_Tag")
	.dwattr $C$DW$T$361, DW_AT_byte_size(0x24c)
$C$DW$915	.dwtag  DW_TAG_member
	.dwattr $C$DW$915, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$915, DW_AT_name("refCount")
	.dwattr $C$DW$915, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$915, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$915, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$915, DW_AT_decl_column(0x19)
$C$DW$916	.dwtag  DW_TAG_member
	.dwattr $C$DW$916, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$916, DW_AT_name("nameServer")
	.dwattr $C$DW$916, DW_AT_TI_symbol_name("nameServer")
	.dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$916, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$916, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$916, DW_AT_decl_column(0x21)
$C$DW$917	.dwtag  DW_TAG_member
	.dwattr $C$DW$917, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$917, DW_AT_name("nameServerType")
	.dwattr $C$DW$917, DW_AT_TI_symbol_name("nameServerType")
	.dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$917, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$917, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$917, DW_AT_decl_column(0x21)
$C$DW$918	.dwtag  DW_TAG_member
	.dwattr $C$DW$918, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$918, DW_AT_name("gate")
	.dwattr $C$DW$918, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$918, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$918, DW_AT_decl_line(0x81)
	.dwattr $C$DW$918, DW_AT_decl_column(0x21)
$C$DW$919	.dwtag  DW_TAG_member
	.dwattr $C$DW$919, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$919, DW_AT_name("gateType")
	.dwattr $C$DW$919, DW_AT_TI_symbol_name("gateType")
	.dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$919, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$919, DW_AT_decl_line(0x83)
	.dwattr $C$DW$919, DW_AT_decl_column(0x21)
$C$DW$920	.dwtag  DW_TAG_member
	.dwattr $C$DW$920, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$920, DW_AT_name("objList")
	.dwattr $C$DW$920, DW_AT_TI_symbol_name("objList")
	.dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$920, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$920, DW_AT_decl_line(0x85)
	.dwattr $C$DW$920, DW_AT_decl_column(0x21)
$C$DW$921	.dwtag  DW_TAG_member
	.dwattr $C$DW$921, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$921, DW_AT_name("listLock")
	.dwattr $C$DW$921, DW_AT_TI_symbol_name("listLock")
	.dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$921, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$921, DW_AT_decl_line(0x87)
	.dwattr $C$DW$921, DW_AT_decl_column(0x21)
$C$DW$922	.dwtag  DW_TAG_member
	.dwattr $C$DW$922, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$922, DW_AT_name("cfg")
	.dwattr $C$DW$922, DW_AT_TI_symbol_name("cfg")
	.dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$922, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$922, DW_AT_decl_line(0x88)
	.dwattr $C$DW$922, DW_AT_decl_column(0x21)
$C$DW$923	.dwtag  DW_TAG_member
	.dwattr $C$DW$923, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$923, DW_AT_name("defaultCfg")
	.dwattr $C$DW$923, DW_AT_TI_symbol_name("defaultCfg")
	.dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$923, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$923, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$923, DW_AT_decl_column(0x21)
$C$DW$924	.dwtag  DW_TAG_member
	.dwattr $C$DW$924, DW_AT_type(*$C$DW$T$359)
	.dwattr $C$DW$924, DW_AT_name("defaultInstParams")
	.dwattr $C$DW$924, DW_AT_TI_symbol_name("defaultInstParams")
	.dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$924, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$924, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$924, DW_AT_decl_column(0x1d)
$C$DW$925	.dwtag  DW_TAG_member
	.dwattr $C$DW$925, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$925, DW_AT_name("isInstNoValid")
	.dwattr $C$DW$925, DW_AT_TI_symbol_name("isInstNoValid")
	.dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$925, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$925, DW_AT_decl_line(0x90)
	.dwattr $C$DW$925, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$361

	.dwattr $C$DW$T$361, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$T$361, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$361, DW_AT_decl_column(0x10)
$C$DW$T$1122	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ModuleObject")
	.dwattr $C$DW$T$1122, DW_AT_type(*$C$DW$T$361)
	.dwattr $C$DW$T$1122, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1122, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$T$1122, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1122, DW_AT_decl_column(0x03)
$C$DW$T$1123	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1123, DW_AT_type(*$C$DW$T$1122)
	.dwattr $C$DW$T$1123, DW_AT_address_class(0x20)

$C$DW$T$362	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$362, DW_AT_name("FrameQBufMgr_NameServerEntry_tag")
	.dwattr $C$DW$T$362, DW_AT_byte_size(0x20)
$C$DW$926	.dwtag  DW_TAG_member
	.dwattr $C$DW$926, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$926, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$926, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$926, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$926, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$926, DW_AT_decl_column(0x0f)
$C$DW$927	.dwtag  DW_TAG_member
	.dwattr $C$DW$927, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$927, DW_AT_name("headerInterfaceType")
	.dwattr $C$DW$927, DW_AT_TI_symbol_name("headerInterfaceType")
	.dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$927, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$927, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$927, DW_AT_decl_column(0x0f)
$C$DW$928	.dwtag  DW_TAG_member
	.dwattr $C$DW$928, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$928, DW_AT_name("bufInterfaceType")
	.dwattr $C$DW$928, DW_AT_TI_symbol_name("bufInterfaceType")
	.dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$928, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$928, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$928, DW_AT_decl_column(0x0f)
$C$DW$929	.dwtag  DW_TAG_member
	.dwattr $C$DW$929, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$929, DW_AT_name("instParams")
	.dwattr $C$DW$929, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$929, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$929, DW_AT_decl_line(0x113)
	.dwattr $C$DW$929, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$362

	.dwattr $C$DW$T$362, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$362, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$362, DW_AT_decl_column(0x10)
$C$DW$T$1124	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NameServerEntry")
	.dwattr $C$DW$T$1124, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$T$1124, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1124, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1124, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1124, DW_AT_decl_column(0x02)
$C$DW$T$1125	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1125, DW_AT_type(*$C$DW$T$1124)
	.dwattr $C$DW$T$1125, DW_AT_address_class(0x20)

$C$DW$T$370	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$370, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$370, DW_AT_byte_size(0x14)
$C$DW$930	.dwtag  DW_TAG_member
	.dwattr $C$DW$930, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$930, DW_AT_name("notifyType")
	.dwattr $C$DW$930, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$930, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$930, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$930, DW_AT_decl_column(0x1d)
$C$DW$931	.dwtag  DW_TAG_member
	.dwattr $C$DW$931, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$931, DW_AT_name("watermark")
	.dwattr $C$DW$931, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$931, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$931, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$931, DW_AT_decl_column(0x1d)
$C$DW$932	.dwtag  DW_TAG_member
	.dwattr $C$DW$932, DW_AT_type(*$C$DW$T$369)
	.dwattr $C$DW$932, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$932, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$932, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$932, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$932, DW_AT_decl_column(0x1d)
$C$DW$933	.dwtag  DW_TAG_member
	.dwattr $C$DW$933, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$933, DW_AT_name("cbContext")
	.dwattr $C$DW$933, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$933, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$933, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$933, DW_AT_decl_column(0x1d)
$C$DW$934	.dwtag  DW_TAG_member
	.dwattr $C$DW$934, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$934, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$934, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$934, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$934, DW_AT_decl_line(0x201)
	.dwattr $C$DW$934, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$370

	.dwattr $C$DW$T$370, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$370, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$T$370, DW_AT_decl_column(0x10)
$C$DW$T$446	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$446, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$T$446, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$446, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$446, DW_AT_decl_line(0x204)
	.dwattr $C$DW$T$446, DW_AT_decl_column(0x03)
$C$DW$T$1126	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_NotifyParams")
	.dwattr $C$DW$T$1126, DW_AT_type(*$C$DW$T$446)
	.dwattr $C$DW$T$1126, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1126, DW_AT_decl_file("/home/sksung/work/udx/ch2/packages/../ti_tools/syslink_2_10_06_28/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1126, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1126, DW_AT_decl_column(0x27)
$C$DW$T$447	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$447, DW_AT_type(*$C$DW$T$446)
	.dwattr $C$DW$T$447, DW_AT_address_class(0x20)

$C$DW$T$376	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$376, DW_AT_name("FrameQBufMgr_Obj_Tag")
	.dwattr $C$DW$T$376, DW_AT_byte_size(0x84)
$C$DW$935	.dwtag  DW_TAG_member
	.dwattr $C$DW$935, DW_AT_type(*$C$DW$T$371)
	.dwattr $C$DW$935, DW_AT_name("listElem")
	.dwattr $C$DW$935, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$935, DW_AT_decl_file("FrameQBufMgr.c")
